{
    "post_title": "Homeland Security is testing AI to help with immigration, trafficking investigations, and disaster relief",
    "post_timestamp": "2024-03-18 15:59:28",
    "last_comment_timestamp": "2024-03-20 14:41:45",
    "time_difference": "1 day, 22:42:17",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-18 15:59:28",
            "replies": []
        },
        {
            "author": "itsatumbleweed",
            "body": "To be honest, AI could have a lot of really good uses *if* the humans that were to interpret the output could be trained to correctly interpret the output. \n\nI have no confidence in that training, however.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-18 16:16:43",
            "replies": []
        },
        {
            "author": "NomDePlume007",
            "body": ">...to help with immigration, trafficking investigations, and disaster relief\n\nFor now.\n\nGive a man a hammer, and every problem looks like a nail.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-03-18 16:07:12",
            "replies": []
        },
        {
            "author": "libginger73",
            "body": " If and only if AI didn't include our own biases, it would be nice/interesting to see what a strategy free from politics, greed, effect on the polls, etc would be. Unfortunately, that's impossible now that it has been trained on our output.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-18 17:35:35",
            "replies": [
                {
                    "author": "111anza",
                    "body": "I don't think we want it completely unbiased. It would essentially be technocrate....which will seem very heartless.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-19 06:51:53",
                    "replies": [
                        {
                            "author": "libginger73",
                            "body": "That would still be a better starting place than what we do now which is to let monied interests and groups like ALEC write laws for us.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-19 08:55:31",
                            "replies": [
                                {
                                    "author": "111anza",
                                    "body": "What makes you think Alec is better?\n\n Sometimes I wonder that maybe letting money and greed dominate is he best case scenario we can have, because at least it's predictable and based on some known factors. \n\nI am not very optimistic of the whole human nature and as history proves that a lot of humans worst deed was done with the most righteous reasoning and good intention. \n\nSo if we can't really rid the system of bias, then isn't it better to have it be based on a set of known biased so that at least it can be somewhat predictable and known.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-19 18:02:29",
                                    "replies": [
                                        {
                                            "author": "libginger73",
                                            "body": "I don't think  Alec is better. In fact its much worse! You totally misunderstood what I wrote!",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-03-19 18:18:05",
                                            "replies": [
                                                {
                                                    "author": "111anza",
                                                    "body": "I see,",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-20 14:41:45",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "larel8",
            "body": "NYT: \n[The Department of Homeland Security Is Embracing A.I. —- The agency will be the first in the federal government to roll out a comprehensive plan to integrate the technology into a variety of uses, from fighting crime to helping disaster survivors.](https://www.nytimes.com/2024/03/18/business/homeland-security-artificial-intelligence.html)\n\nDHS is partnering with OpenAI and Anthropic and Meta/Facebook (information scrapers) so American privacy is screwed imho.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-03-18 16:01:27",
            "replies": [
                {
                    "author": "Javelin-x",
                    "body": ">American privacy is screwed imho\n\nSince 1982... too late to complain now",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-03-18 16:07:05",
                    "replies": []
                }
            ]
        },
        {
            "author": "IXMCMXCII",
            "body": "America is one of the nations of the [Five Eyes](https://en.m.wikipedia.org/wiki/Five_Eyes). They’ve been monitoring all of this way before the advent of AI.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-03-18 16:31:53",
            "replies": []
        },
        {
            "author": "ucantresistme",
            "body": "How about you test slamming the door. Just turn everyone around and tell them to go home. It'll require less tech and less personnel.",
            "score": -3,
            "depth": 0,
            "timestamp": "2024-03-18 16:01:43",
            "replies": []
        }
    ]
}