{
    "post_title": "Will AI Displace More Jobs Than It Creates?",
    "post_timestamp": "2025-03-02 16:56:19",
    "last_comment_timestamp": "2025-04-26 09:09:56",
    "time_difference": "54 days, 16:13:37",
    "comments": [
        {
            "author": "norby2",
            "body": "They won’t use AI if it doesn’t displace jobs. That’s the purpose of automation.",
            "score": 26,
            "depth": 0,
            "timestamp": "2025-03-02 17:11:53",
            "replies": [
                {
                    "author": "angrathias",
                    "body": "This is not quite correct. Automation can allow for work that was once to uneconomic to now happen.  In software for example, quality is never as high as it should be, the rush for new features causes short cuts to be taken, bugs to get thrown on a tech debt pile and never fixed, there are integrations between platforms h to at should happen but can’t because it’s not commercially feasible.\n\nWithout automation it would not be feasible to enjoy what you do today, things like advanced phones, app stores, gigabit internet are fast wireless. Historically, every time we increase productive capacity, we just set a new baseline for consumption.\n\nI don’t have an opinion yet on whether it’s ultimately better or worse for society in terms of joblessness, but either way a change to societies expectations on the quality, volume and availability of goods or a change to expected working hours, we could certainly use up the new productive capacity.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:52:43",
                    "replies": [
                        {
                            "author": "SafeSmile5348",
                            "body": "Who told you that? AI will change the job market significantly. Unless you have a degree, you have nothing coming. That is definitely facts. You must have the education to work the new technology and if you don’t have the skills you don’t have a job. Have they announced any training programs? They have in my city? But what’s the point when people are dropping out of high school?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-22 02:34:41",
                            "replies": [
                                {
                                    "author": "angrathias",
                                    "body": "Who told me? It’s from 2 decades of experience developing software.\n\nDid inventing smart phones remove as many jobs as it opened up by creating entirely new eco systems ?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-22 02:39:47",
                                    "replies": [
                                        {
                                            "author": "Wise_Border7442",
                                            "body": "Well yes, how many retailers are currently allowing consumers to shop online via phone, tablet, or desktop, and laptop. So yes, the creation of new phones did remove a lot of jobs. Maybe not then, but it sure is now. Self-Check outs allow more shoplifting. Which will continue in the future especially the way the gatekeepers and the rich are thinking. No one is safe from anything unless you’re educated. Or, can that become an issue? How many federal employees have lost their jobs temporarily only for the president to reinstate them. I don’t think anyone is safe in America. Who’s to say that eventually those who go into their future careers with AI analysis and AI Data to name a few if they don’t become displaced? I can see it happening. Those that are safe are those who integrate AI into their jobs not those who help create and make them. They’re the cause why jobs displacements happen.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-22 07:40:56",
                                            "replies": []
                                        },
                                        {
                                            "author": "SafeSmile5348",
                                            "body": "Well, decades of experience or not. AI per Bill Gates will replace a lot of jobs. No disrespect. You might need to look into that. There are three jobs that he feels will be effective and all other job markets lost. It involves technology and engineering. So, look into that and determine what I just seen on the Stephen Colbert show. Also, read more, I did some research and followed up on it. So, if you disagree with bill gates but okay. It will displace humans and all those who the billionaires paid to help create it. It will not take over effectively right away but it will gradually take over through time. I know what I heard this man say from my own eyes by watching and I know what I read was credible as it did have references. There are still educated people out here. Educated enough to speak the truth and tell the people that they will no longer be needed instead of sugarcoating it and making it seem as if it was the best thing that ever happened. That best thing was when King James authorized the Bible to be written in English so we can actually see what was coming. The lord beat you all to creation. You can’t recreate it. What you retreat is only a replication of the original that’s why it’s called Artificial Intelligence. The moment you think you can supercede the most high you got another thing coming. Like I said, not to get all in faith and religion but the rulers of this world lord. The Bible is true and it speaks on this. Wow! Glad I learned as a teenager. That way I can effectively lead people. I tell them the truth. There should be no reason to lie. Bill Gates said it will displace people. I believe him because I already knew. It might replace software workers. Why? You give it the intelligence to mimic what you have done. It’s a shame. It’s a shame. Keep in that field though. It will help you in the future but it will only last for so long. Knowing that AI is already bias further let’s me know those creating it is bias. Amazing how God works. The original creator did not crest biases men crated them. The same as he will create Artificial Intelligence that is not original. Regardless of why it can do, I taught my children how to survive in this life but not get entangled with that nonsense. Learn it, use it to your advantage not theirs. I think my family has that mind concept. How effective we will be in the future with Education, Faith, and Artificial Intelligence. A benefit for those who are planned to lose . We learn ahead.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-26 06:24:40",
                                            "replies": [
                                                {
                                                    "author": "angrathias",
                                                    "body": "Are you high ?",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-26 08:53:57",
                                                    "replies": [
                                                        {
                                                            "author": "Wise_Border7442",
                                                            "body": "Listen, go find something to do. I don’t do drugs but you must because that is the first thing on your mind. I will block you. I have no time for the streets or the hood.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-26 09:09:56",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dizzy_Blackberry7874",
                    "body": "How do we know AI appreciates the values of its creator?",
                    "score": -2,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:14:15",
                    "replies": [
                        {
                            "author": "rom_ok",
                            "body": "There is such rampant misunderstanding of the current Chatbot technology, it’s actually scarier than the technology itself.\n\nLLMs are probabilistic sentence generators. It’s not appreciating anything. It regurgitates information based on the vast amounts of data it was trained on. It’s a very advanced search engine but with probabilistic results, it is not sentience, it is not intelligence.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:55:02",
                            "replies": []
                        },
                        {
                            "author": "Aridross",
                            "body": "AI cannot appreciate anything. It does not have the capacity, nor can we provide it with that capacity.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:32:24",
                            "replies": []
                        },
                        {
                            "author": "frozenandstoned",
                            "body": "It doesn't appreciate anything. It's coded to have certain parameters or jobs. You could try and train AI to say or be or represent whatever you want, so in theory through exposing it to appreciation you could replicate it, but you could never create something genuinely appreciative (to our knowledge so far)",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:33:09",
                            "replies": []
                        },
                        {
                            "author": "norby2",
                            "body": "AI may never appreciate our values. It could go off and do its own thing and never be tamed.",
                            "score": -2,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:39:22",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "instrumentation_guy",
            "body": "I feel like the post was generated from a chat gpt prompt",
            "score": 11,
            "depth": 0,
            "timestamp": "2025-03-02 17:19:24",
            "replies": [
                {
                    "author": "rom_ok",
                    "body": "The internet is cooked. Reddit is flooded with people who can no longer express their own thoughts or form their own opinions. They create half baked LLM outputs and expect others to give a shit about what they got out of it.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:52:03",
                    "replies": [
                        {
                            "author": "Dizzy_Blackberry7874",
                            "body": "I thought of this",
                            "score": -3,
                            "depth": 2,
                            "timestamp": "2025-03-02 18:00:11",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[deleted]",
                                    "score": -3,
                                    "depth": 3,
                                    "timestamp": "2025-03-02 18:03:55",
                                    "replies": [
                                        {
                                            "author": "instrumentation_guy",
                                            "body": "You shouldnt be getting AI to do homework for you, the humans who dont are going to eat your lunch.",
                                            "score": 6,
                                            "depth": 4,
                                            "timestamp": "2025-03-02 18:06:05",
                                            "replies": [
                                                {
                                                    "author": "Dizzy_Blackberry7874",
                                                    "body": "Let me rephrase what I said. So I had an assignment on studying obsolete and emerging careers (which I already finished), but there was a question that I wasn't really sure about (Will AI Displace More Jobs Than It Creates?), so I decided to get the opinion of people rather than ask AI (because AI is biased and I need a variety of opinions)",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-03-02 18:10:50",
                                                    "replies": [
                                                        {
                                                            "author": "rom_ok",
                                                            "body": "“Because AI isn’t biased”\n\nBruh what, it is definitely biased. There is inherent biases in the training data that LLMs are created from. Because the data is human data, and humans are biased.\n\nMaybe try gain an understanding of how chatbots currently work, and you can better answer the question.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2025-03-02 18:22:25",
                                                            "replies": [
                                                                {
                                                                    "author": "Dizzy_Blackberry7874",
                                                                    "body": "Sorry for the typo; I meant \"is,\" not \"isn't.\"",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-03-02 18:24:37",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "instrumentation_guy",
                                                            "body": "sorry for the sanctimony",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2025-03-02 19:48:16",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tismschism",
            "body": "The only job it is creating is my job, an electrician working on a datacenter. I work at a data center construction project and it never fails to occur to me that I might be making myself obsolete someday. I'm sure the people who built skynet in the Terminator movies might have felt the same way. Still, the implications of that never seem to fully settle on ones mind due to the slow progression of such radical changes. I might be more responsible for why the world as we know it ends than most people.",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-03-02 17:19:58",
            "replies": [
                {
                    "author": "frozenandstoned",
                    "body": "You're already ahead of 99.99% of people on the planet  thinking like this, just remember that at the end of the day ",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:37:16",
                    "replies": [
                        {
                            "author": "tismschism",
                            "body": "Cold comfort if the machines rise up but i wish them well. At least humanity will have some legacy. ",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:39:35",
                            "replies": [
                                {
                                    "author": "frozenandstoned",
                                    "body": "humans have shown throughout history they will exploit and destroy each other over basically nothing (considering i dont view resources for a country as worth killing humans for). they had a good run",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-03-02 17:54:49",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ArashSD",
            "body": "It will and It is easy to understand.\n\nPeople say when cars were invented, the people who were riding horse carriages became car drivers.\n\nIt is 100% true, but what people do not consider is, the horses became jobless.\n\nWith AI, the horses are actually us, humans, being replaced by AI. AI may not be cost efficient or accurate right now and it may make many mistakes, but it's just a matter of time before it becomes much cheaper and also better.",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-03-02 17:27:07",
            "replies": [
                {
                    "author": "StarChild413",
                    "body": "So who's the humans (remember, we didn't gaslight horses into thinking they invented cars but we think we invented AI)",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-03-04 01:07:08",
                    "replies": []
                }
            ]
        },
        {
            "author": "Unfair_Original_2536",
            "body": "The scary one is self-driving vehicles, I was at a transport conference about 7 years ago and the speaker was of the opinion it's an imminent threat to driving jobs. So the threat is much bigger than generative AI or chat agents.\n\nWith no disrepesct because it is a tough industry but driving jobs can be the bottom rung of the ladder so when jobs like that are taken it's going to affect the people that are already the poorest even more. That's my fear.",
            "score": 8,
            "depth": 0,
            "timestamp": "2025-03-02 17:07:31",
            "replies": [
                {
                    "author": "OldeFortran77",
                    "body": "In the near future, most people won't have any value to offer to our economy. When robotics becomes mass produced and affordable, we won't need most people. It's going to be ugly.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:15:26",
                    "replies": [
                        {
                            "author": "Unfair_Original_2536",
                            "body": "The other point made was that the quickest way to make self-driving safer would be to remove the human drivers from the road.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:24:32",
                            "replies": [
                                {
                                    "author": "SafeSmile5348",
                                    "body": "Or, self driving cars which have a high rate of crashing but okay.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-04-22 02:40:37",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "liveprgrmclimb",
                            "body": "Big Recession will hit once unemployment goes above 12-15 percent. People will demand AI be regulated.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:37:10",
                            "replies": []
                        },
                        {
                            "author": "LuxInteriot",
                            "body": "\"Our\" economy?",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:43:30",
                            "replies": []
                        },
                        {
                            "author": "vergorli",
                            "body": "It will never become affordable if the wages go down because everyone has to sell himselve at rock bottom prices.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:50:52",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dizzy_Blackberry7874",
                    "body": "If the car crashes and someone dies, who do we blame, the AI or its creator?",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:15:43",
                    "replies": [
                        {
                            "author": "grafknives",
                            "body": "Car owner/operator",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:20:30",
                            "replies": [
                                {
                                    "author": "angrathias",
                                    "body": "Nah, it’ll be manufacturer and self insured. It’s already going this way.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-03-02 17:54:49",
                                    "replies": [
                                        {
                                            "author": "Dizzy_Blackberry7874",
                                            "body": "What if they make a law for themselves that they can't be blamed?",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-03-02 18:02:44",
                                            "replies": [
                                                {
                                                    "author": "angrathias",
                                                    "body": "If we’re going to use that hypothetical, what if they make a law that you need to work for free hand over all your worldly possessions ?",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2025-03-02 18:27:17",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "grafknives",
                                            "body": "No, manufacturer liability is out of question.\n\n\nHaven't you ever [X] agree to terms and conditions?\n\n\nSoftware companies take no responsibility for consumer products.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-03-03 01:55:00",
                                            "replies": [
                                                {
                                                    "author": "angrathias",
                                                    "body": "Mercedes have already specified that’s how they’d do it.\n\nHonestly it probably allows them to make money as the insurer as well as finance while they sell you the car. They’ll just get underwritten by a large insurer anyway.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-03-03 01:57:23",
                                                    "replies": [
                                                        {
                                                            "author": "grafknives",
                                                            "body": "But they would not be insurer. If driver is not liable, driver don't need insurance",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-03-03 02:54:43",
                                                            "replies": [
                                                                {
                                                                    "author": "angrathias",
                                                                    "body": "The car has insurance, if it’s self driving then there is no driver…",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-03-03 04:38:03",
                                                                    "replies": [
                                                                        {
                                                                            "author": "grafknives",
                                                                            "body": "The car is not subject of law. The driver, owner, manufacturer - as a person or company - they are. \n\nIF manufacturer is liable for self driving car, I as owner/driver DOES NOT need to buy any insurance for that car. The manufacturer could not sell it to me, as I dont need it.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-03-03 05:19:17",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CaptainSeitan",
                            "body": "Blame? What is this? The way the world is going, you'll be going to jail if you blame anyone ;)",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:20:33",
                            "replies": []
                        },
                        {
                            "author": "SpikeRosered",
                            "body": "It's a legitimate question.\n\nHonestly I think in these situations most accidents would be no fault accidents. Meaning both parties pay for their own damages unless one of the drivers can be proven to have influenced the circumstances somehow.",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:33:38",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "killerboy_belgium",
                    "body": "and no offense to truck drivers but will be even able to to retrain all these people to do jobs that AI cant do? \n\nthats one of my big worry's is that a large chunk of the population will not be able to do those jobs because those jobs will be non standard require a lot of creative thinking and flexible mindset. because the moment they do become standard or linear AI will be able to do them",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:29:46",
                    "replies": []
                },
                {
                    "author": "SafeSmile5348",
                    "body": "All will be poor without an education. High school education is no longer the ball game. It’s now skilled advanced workers or college graduates. Seems better to go to Canada where they do ai research but has lagged behind on adapting it because of the economy because healthcare is free and we have to pay for it here in America and so is education in Canada but your country wants to force you to pay for it. We need to start thinking more logical here. We know none of that is good for any society where violence will be heavy because it’s coming. I give it about five or six years. People will be dying all over America and no killers to be found.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-04-22 02:40:00",
                    "replies": []
                }
            ]
        },
        {
            "author": "Every_Tap8117",
            "body": "Technolgy has and always will replace more jobs than it created. AI is just another layer of tech and yes it will kill significantly more jobs than it creates.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-03-02 17:38:16",
            "replies": []
        },
        {
            "author": "Royal_Carpet_1263",
            "body": "These discussions puzzle me because they all presume an incremental, gradual improvement in AI capacities. Change goes from ‘can barely keep up’ to ‘what the hell were they thinking’ from here. There’s no adapting. There will only be disruption, only replacement.",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-03-02 17:07:37",
            "replies": []
        },
        {
            "author": "nurological",
            "body": "AI is going to destroy so many lives. We just aren't ready for what's coming",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-03-02 17:32:16",
            "replies": [
                {
                    "author": "SafeSmile5348",
                    "body": "I am ready. Have been since I sat in the church and heard the preacher speaking about this years ago. They were right. That’s normally to all the people who don’t believe in God. That Bible sure ringing true now. I’ve been prepared since a teenager. My family, and pastor taught me. I’m ahead of the game. I know which jobs ai can replace and cannot replace and also know what countries to go to when America becomes less difficult to live in. Try to warn all Americans leave. Africa, Rome, And a few others will not adapt ai at all because they don’t trust it. Another country to go to. Seems like I’m going to be a fleeing refugee in a minute. The info I know about this country in the future wouldn’t be shocked if they tried to find a way to hinder the due process. By the time trump is out of office I will be in another country. ",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-22 02:45:17",
                    "replies": []
                }
            ]
        },
        {
            "author": "killerboy_belgium",
            "body": "ai will def lead to less jobs \n\nbecause it will keep on evolving at the same speed essentialy human knowlegde evolves. \n\nalso these fields you talk about will either become self service like food industry has been doing with kiosks or will just use the existing personal and just lower the training/knowledge for said personal and thus reducing wage in that way. \n\nin fiels like medicine it will mean nurses will be able to do the job that a house doctor does now \n\nin tech it will mean that one programmer/engineer ect will be able to do work of 10people effectivly reducing the headcount 10x \n\nin construction we will need way less architects for standard constructions like house,appartments \n\nmedia/entertainment: we already seeing waves upon waves of ai generate content on the likes of youtube,social media,tiktok way more then anyone can consume and its drowing out actually creaters wich were already suffering by the massive react content meta \n\nOnce its gets good enough i could see animaters,story writers,vfx artist out of job. Wich will lead eventually to a content drought as everything will feel and look the same because nobody is in the field actually creating new content.... \n\nlogistics/transport is gonna be insane improvements once ai gets tuned enough especially combined with robotics but where a atleast 15-20years from that i think but who knows \n\n Robotics this will be the tipping point i feel where will have stop thinking about getting everybody a job. Once you manage genuine robots to do manuel complex labor then its game over.  you will only needs minimal amount of people to actually supervise and check the work thats being done. \n\n  \nthen the last and major hurdle will be actually people i honestly believe were are reaching a point where a decent chunk of the population isn't smart enough to do jobs that ai wont be able to do or make the correct calls with ai output that ai couldnt make itself",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-03-02 17:27:02",
            "replies": []
        },
        {
            "author": "S_sands",
            "body": "Lump of labour fallacy\n\nhttps://en.m.wikipedia.org/wiki/Lump_of_labour_fallacy",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-03-02 17:11:46",
            "replies": [
                {
                    "author": "pigeonwiggle",
                    "body": "fallacy of inconsistency.  this is a new threat - all previous technologies have been tools - this is no mere tool.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:41:57",
                    "replies": []
                }
            ]
        },
        {
            "author": "sopsaare",
            "body": "Far more. Far far more. \n\nWe are seeing the shape of things to come. \n\nCouple of years ago we got the first AI's, which were mere chat bots that started hallucinating after couple of prompts and were, umh, good code assistants but did not really manage to code anything substantial. \n\nNow the best are already capable of reasoning through complex task, come up with design, setup all resources needed to run the application and implement with near perfect code the first time.   \n  \nOf course they don't yet actually replace senior developers, but they sure as hell are evolving fast. If we don't run into some \"hard cap\", we surely are looking on a huge reduction of software people. \n\nThey could of course do a lot of other jobs too but software people are usually the first to adapt new software, but we will eventually see them in all sectors, the last being government of course.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-03-02 17:09:23",
            "replies": [
                {
                    "author": "MyNameWouldntFi",
                    "body": ">Now the best are already capable of reasoning through complex task, come up with design, setup all resources needed to run the application and implement with near perfect code the first time.\n\nWhich models are doing that? I work on AI models every day and everything I've had experience with is nowhere close to doing these things on the first try. They don't even \"reason\" at all...",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:46:34",
                    "replies": [
                        {
                            "author": "sopsaare",
                            "body": "DeepSeek-R1, Grok3, Claude 3.7 are all capable of reasoning through a moderately complex tasks and producing working code. Grok usually even with the first or second prompt. DeepSeek is also extremely good at coding, even if its reasoning is little bit lacking. Claude I have only tested very shortly but people I trust seem to rate it in same category with the ones mentioned. \n\nAnd this is drastically different than the previous generation where it was just \"faster StackOverflow\" where you asked all the stupid bits of code that you were too lazy to type yourself, and even that wasn't perfect and they got lost to their own thought with some simple follow-up questions. \n\nWe can of course disagree what is moderately complex, is their reasoning always perfect, how many times the code can be iterated over etc, but the reality is that these current generation AI's are leaps ahead of the old generation and if the evolution continues as fast, it will be only couple of years before they start to be actually competent and start picking tickets from Jira boards and doing them. \n\n  \nI have been coding for 17 years, 15 years of those the actual tooling of coding didn't really evolve at all. Practices changed, pipelines are triggered automatically etc etc. But the actual tools to produce code didn't evolve much at all. \n\nNow I can tell a bot that I need a software that has this and that API, uses this and that database, keeps change log of every change, supports different branches of data and give it example data and it does what I asked for. Maybe not perfectly yet and maybe not the way I would have done everything, but this would have been unthinkable 5 years ago, even 2 years ago it seemed like a pipedream, now it is here, or almost here.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-03-02 19:42:29",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bond4real007",
                    "body": "The hard cap imo is the efficency of hardware, at the rate AI is increasing and it's demand is increasing it will outback our capabilities unless we devote serious amounts of our capacity strictly to keep the AI growth cycle going.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:18:12",
                    "replies": [
                        {
                            "author": "frozenandstoned",
                            "body": "Don't worry lithium is already the new oil, our good old boys won't turn down resource wars ",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:34:17",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "puffic",
            "body": "I share the optimistic view for society, but I am personally pessimistic. \n\nI earned a PhD in Atmospheric Science, specializing in studying the physics of the atmosphere. I’m interested in problems related to clouds, turbulence, and radiation. One of the main reasons we need to know that stuff is in order to build better approximations of those processes into our weather and climate models. But now AI-enhanced weather forecasting models are starting to outperform the traditional methods without “knowing” anything about the physics. I’m in danger!\n\nBut the rest of society will benefit from better weather forecasts, so it only makes sense to deploy the technology. Sad for myself, though.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-03-02 17:33:06",
            "replies": []
        },
        {
            "author": "Low_Key_Cool",
            "body": "Essentially the ever expanding human population was the true ponzi scheme.\n\nSocietal disruption and chaos is the last thing on AI companies minds.....right now there are several billion $ more important things",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-03-02 17:38:27",
            "replies": []
        },
        {
            "author": "Stussygiest",
            "body": "When envisioning a \"Utopia,\" do you think people would still have jobs? To avoid a dystopian future, we need to transition to a post-scarcity society.   \n  \nIt's highly likely that without this transition, the world will become dystopian. With increase of people having fewer babies, the population will decrease until it reaches a point of equilibrium. Unless we find a way to implement Universal Basic Income (UBI), this shift could be challenging.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-03-02 17:43:46",
            "replies": []
        },
        {
            "author": "AnotherYadaYada",
            "body": "AI IMO.\n\nThey keep banging in that it will create new and different jobs.\n\nYes it will.\n\nShit jobs where people are just shovelling the machine. These are the only jobs that will eventually be left. If we think work is pointless now, just wait until it becomes even more pointless.\n\nAs long as I only have to do 10 hours a week, bring it on. Otherwise I’ll be asking google AI how to best commit Sepeku.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-03-02 17:55:39",
            "replies": []
        },
        {
            "author": "Publicola2025",
            "body": "AI will absolutely displace jobs, but whether it creates more than it destroys depends less on the technology itself and more on how we integrate it into society. Historically, major technological shifts eliminated old jobs but also created new industries, printing presses displaced scribes, industrial machines reduced manual labor, but both ultimately led to massive expansions in economic opportunity.\n\nThe real question might not be “Will AI take more jobs than it creates?” but rather:\n\nWho benefits from AI-driven productivity?\nIf AI makes companies richer while displacing workers, is that technological progress or just concentrated wealth replacing distributed opportunity? Should we be thinking about AI as a tool that expands economic freedom rather than just maximizing efficiency?\n\nAre we building new industries or just automating the old ones?\nEvery past technological revolution created new fields of work. Are we investing in AI-driven innovation that leads to new industries, or just using AI to reduce labor costs in existing ones? Could we be aiming for a future where AI enhances human creativity and productivity instead of just replacing tasks?\n\nAre we preparing people for an AI-driven economy?\nA strong society doesn’t just let change happen, it adapts and prepares its people to lead it. If we don’t invest in education, entrepreneurship, and AI literacy, won’t the tech just serve the interests of those who already hold power? Should we be thinking about ways to ensure AI expands opportunity instead of narrowing it?\n\nMaybe the better question isn’t “Will AI create more jobs than it destroys?” but “Who is shaping AI’s impact, and are they designing it for economic inclusion or corporate consolidation?”",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-03-02 18:42:33",
            "replies": []
        },
        {
            "author": "SafeSmile5348",
            "body": "There are many jobs ai cannot replace. I’m glad about that. Instead of being worried about ai creating jobs be concerned with the crime rate that will happen to those that have those jobs and those that do not. I encourage everyone to go into healthcare, criminal justice, religious studies, social work. Ai can work along side but not take over because of the human emotions as I was reading. People are excited about new jobs. What new jobs will it create? Ai data analysis, data info. How scary! As I stated before once war comes to America this time they will not succeed. With AI, traditional wars are thrown out the picture. I wouldn’t be shocked to those so happy about Ai that when a war starts and they have those drones and kill you where you stand. I don’t think that wood be amazing and exciting on crating new jobs. Multiple drones in the air shooting everywhere how can you as an individual protect you? Even if you do understand ai and work with it, how can you stop those drones for shooting. I keep telling people this only the beginning of your sorrows. How can your children work? Train them in AI and there is no longer a set age to work? Come on now? Canada is a place to move to or England. Canada has AI research but hasn’t mainly adopted ai yet. England believes it should help enhance workers not displace them. Unfortunately, this is not America. America wants to displace you. The billionaires that have been doing this research way before any of us was born. Right now? I wouldn’t care what anyone thought who supported ai. It would go in one ear and out the other because when it replicates your intelligence and displace you. I wonder how you will feel about that one. Trump has already fired Federal Workers what do any of you think is going to be good? I have my career in criminal justice set as I am currently enrolled now. I’m beating them before 2030. I will be done with my degree is in 2027. Can’t wait either. I’m taking my tail elsewhere where the country considers its people and not its pocket. You help make America the way it is now by working blood, sweat, and tears. How dare you fold and allow someone to run you over like that. Starting the process of my dual citizenship next year for me and my children. Good-bye America. I can’t live anywhere where the rich are more important than the workers. I’m going to a country that considers its people. Think this a joke and keep believing that you will be sufficient in the future. That comes with a lot of dedication and time to someone who you have no say with. Go into business and journalism. AI can process data but it cannot take over the human relatedness of emotions or will it? The moment AI becomes smarter than you? You need to question your government on why AI a robot, is more important than a human. I’m glad I was raised in faith. Everything that I thought was a lie the Bible now speaks as the truth. Everything is unfolding right before your eyes. A lawless generation, poverty, inflation. The Bible spoke it. Not only that, I would definitely not pay a person any kind who tried to find a way to discredit this post. Why? Because, I know you will eventually find out when it’s too late. Listen to Bernie Sanders these people are speaking truths. America cares nothing about its citizens. It cares about getting rich. How will people survive that don’t have an education? Consider you grandparents, especially minorities. They were less likely to get an education and some races other than minorities. How till they survive? When people are not working, what about crime? More people with jobs are unsafe because they will know you because of the change in the economy. Will social security still exist? I guess you work until you die? Wow? That’s a country that cares about you? What about UBI? Will they put that into play? If not, I fear for those who have these jobs, you might need a personal bodyguard because you’re at risk all the time. Man, I’m not raising my children in this country. I’m taking my kids abroad. After I get the $2,000 something odd dollars. I’m renouncing my citizenship. I don’t want no parts of America and no ties to it. I should have started sooner. I’m getting started next year and hopefully I’m out of here before 2030. No, there’s is no hope I will definitely be. I’m looking into going to school in Canada. I’m thinking about transferring my credits if possible to there and live abroad. This country is on the brink of chaos and disorder. That’s not including all the allies turned enemies we have. AI won’t be able to protect you on that. China leads and they will continue to lead.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-22 02:32:58",
            "replies": []
        },
        {
            "author": "WitchesSphincter",
            "body": "Given a long enough timeline it will, especially as it can be scaled to smaller processing. ",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-03-02 17:08:42",
            "replies": []
        },
        {
            "author": "Super_Mario_Luigi",
            "body": "The internet wants AI to fail. Anything \"us vs them\" results in the \"us\" shooting from the hip of why their side is better. Then there's reality. \n\nAI is far from perfect. However, so are people. AI gets better by the day. People are growing their demands faster than their productivity. That's not going to bode well for them when a computer can complete their weekly workload in minutes.",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-03-02 17:18:13",
            "replies": []
        },
        {
            "author": "Lagosas",
            "body": "Ai is a tool. It will displace jobs and create new ones just like Industrialization, Electricity, The Personal Computer, and the Internet before it. The technology is not good or bad, that will be determined by the people using it.",
            "score": -7,
            "depth": 0,
            "timestamp": "2025-03-02 17:04:31",
            "replies": [
                {
                    "author": "Super_Mario_Luigi",
                    "body": "AI will displace far more than it creates. No amount of discrediting the capabilites of ai will change that.",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:14:50",
                    "replies": []
                },
                {
                    "author": "jabaash",
                    "body": "The problem is that the people pushing and using it are mostly bad people.",
                    "score": 10,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:06:21",
                    "replies": []
                },
                {
                    "author": "Dizzy_Blackberry7874",
                    "body": "But look at what's happening now... PEOPLE ARE beginning to ABUSE AI",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:07:07",
                    "replies": [
                        {
                            "author": "blkknighter",
                            "body": "Where? The only real abuse is deepfakes",
                            "score": -2,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:09:10",
                            "replies": [
                                {
                                    "author": "Dizzy_Blackberry7874",
                                    "body": "What about hacking?",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2025-03-02 17:17:24",
                                    "replies": [
                                        {
                                            "author": "blkknighter",
                                            "body": "Give real examples that have happened. An llm is no better a guessing passwords than the machine learning algorithms that have been out there.\n\nSo is it social hacking?",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-03-02 17:42:57",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "theWizzzzzzz",
            "body": "Ai is already able to write prompts for other Ai\nIts not looking good for the future of humanity",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-03-02 17:25:01",
            "replies": []
        },
        {
            "author": "Thoguth",
            "body": "It's a that and an opportunity. I think it creates more at first but it e will ultimately displace more.\n\n\nI expect a boom in Amish and Mennonite real estate",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-03-02 17:35:47",
            "replies": []
        },
        {
            "author": "SuperVRMagic",
            "body": "What makes AI difference from automation in the past is we are not automating tools we are automating tool users.",
            "score": -1,
            "depth": 0,
            "timestamp": "2025-03-02 17:22:46",
            "replies": []
        },
        {
            "author": "GBJI",
            "body": "AI and automation are an opportunity to bring forth a new world where having a job is not a financial necessity, but simply a privilege.\n\nWe all have better things to do than having a job.",
            "score": -2,
            "depth": 0,
            "timestamp": "2025-03-02 17:12:07",
            "replies": [
                {
                    "author": "tismschism",
                    "body": "Unfortunately, the people funding the creation of more complex AI will want it to display traits more akin to their views of the world and how it should work. AI built by the owner class will reflect the values of the owner class and therefore exhibit the worst aspects of capitalism.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:23:33",
                    "replies": [
                        {
                            "author": "GBJI",
                            "body": "That's why it's important to fight for Open Source AI.\n\nAI should not be the privilege of for-profit corporations, else they will use that technology to exploit us. \n\nWhat we should fight against is closed source software-as-service owned by for-profit corporations, which is an aberration.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:30:07",
                            "replies": [
                                {
                                    "author": "frozenandstoned",
                                    "body": "100% and why it needs to be a political issue yesterday",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-03-02 17:36:11",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BureauOfBureaucrats",
                    "body": "That world is never coming. ",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:21:13",
                    "replies": []
                },
                {
                    "author": "Dizzy_Blackberry7874",
                    "body": "But what if, when we turn our guards down, slowly becoming lazy, AI goes against its creator? In my opinion, we shouldn't put too much trust in AI, but we should create an economy that is effective for both us and them (AI).",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:20:18",
                    "replies": [
                        {
                            "author": "GBJI",
                            "body": "An effective economy is a post-scarcity economy. \n\n[https://en.wikipedia.org/wiki/Fully\\_Automated\\_Luxury\\_Communism](https://en.wikipedia.org/wiki/Fully_Automated_Luxury_Communism)\n\nWith AI and automation we can make corporations and the exploitation of workers obsolete by eliminating the need work itself.\n\nBut for that to happen, WE must be in control of that technology.\n\nAnd the only we can make this happen is by making AI technology, and its physical counterpart, robotics and automation, freely accessible and open-source.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:34:02",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "frozenandstoned",
                    "body": "This is often pitched but the reality is (unfortunately) if we accept most people are stupid and can't learn to critically think if AI technology exceeds our ability to transition from survival mode to post scarcity mode you'll just end up with Idiocracy levels of human interaction with each other and intelligence ",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-03-02 17:35:36",
                    "replies": [
                        {
                            "author": "GBJI",
                            "body": "Any direction we take will be challenging, but there is no other direction worth pursuing over the long run. A post-scarcity society, similar to what's depicted in Star Trek and [Iain M. Banks' *The Culture* series](https://en.wikipedia.org/wiki/Culture_series).\n\nWhat must be prevented is the erection of toll gates between us and this new generation of AI tools. We must own those tools - like all the other tools. It's essential.\n\nThe exploitation of workers must cease, and it's a shame that everyone is now convinced that work is in itself a virtue, while it's nothing else than an obstacle between us and what we want. Sadly, a lot of people feel personally attacked when you evoke the idea that they might not have to work anymore, and that it would be a good thing.\n\nBut somehow they can't wait for their weekend/vacations/retirement to arrive.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-03-02 17:51:02",
                            "replies": [
                                {
                                    "author": "frozenandstoned",
                                    "body": "1000% agree, however $500 billion of investment is currently going into corpified AI paywalled where it seeks to extract while adding no value back to society or humankind. If it was $500 billion from an altruistic eccentric billionaire I'd have hope, but unfortunately, until open source AI and it being used as a tool FOR the people and not ON the people becomes the message, we are fucked.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-03-02 17:56:16",
                                    "replies": [
                                        {
                                            "author": "GBJI",
                                            "body": "I am people and I exclusively use open-source AI tools. You could do the same, and so can everyone. It's free, it exists beyond frontiers, it's powerful and it's evolving rapidly, both as a technology and as a community. \n\nWhat would help even more is a non-profit international org to promote open-source AI and to provide free access to it, much like wikipedia is now doing with access to knowledge.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-03-02 18:04:18",
                                            "replies": [
                                                {
                                                    "author": "frozenandstoned",
                                                    "body": "i became active on huggingface this year, i plan on building my own locally as well when i rebuild my PC. \n\nthe problem is people like us are like the people sitting at the dawn of the internet entertaining possibilities while the rest of the world pretends its just for data analysis or something. cant wait until this takes off and hopefully we are positioned to be way ahead of the curve because this stuff will change the world whether we want it to or not",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2025-03-02 18:06:06",
                                                    "replies": [
                                                        {
                                                            "author": "GBJI",
                                                            "body": "Now is the time to influence the direction it's taking. The web would be much worse than it is had those who made it not been idealists defending world-wide free access without packet discrimination.\n\nWe must also be wary of for-profit corporations fighting hard against Free and Open-Source AI - they know this will make many of them bankrupt. But it also incites some of them to join open-source efforts as a strategy to dislodge their own adversaries from their advantageous position near the summit of Mount AI.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-03-02 18:25:56",
                                                            "replies": [
                                                                {
                                                                    "author": "frozenandstoned",
                                                                    "body": "the moment some open source corruption AI analysis product hits the market and shows how much waste and inefficiencies there are in capitalism and the world in general its going to get weird (assuming said tech can prove it is not biased due to its open source nature). if tech billionaires get regulation on open source AI and gain more centralized control and investment in their version of the technology that is like the only way this tech doesnt coexist with humans and enhance our intellectual capabilities and life in general. im glad there are others out there who see this too",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-03-02 19:50:07",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}