{
    "post_title": "Is AI (Chat GTP) going to make education better or worse?",
    "post_timestamp": "2024-09-24 23:47:12",
    "last_comment_timestamp": "2025-01-05 15:30:38",
    "time_difference": "102 days, 15:43:26",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/teaching. Please remember the rules when posting and commenting. \nThank you. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/teaching) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-24 23:47:13",
            "replies": []
        },
        {
            "author": "kylez_bad_caverns",
            "body": "It could make it better, but I’m going with overall worse. If you do not know how to structure a thesis or create an argument or have any concept of how to write, then AI is honestly not a useful tool. If anything, it should be used to fine tune an original work. However, many students seem incapable of the critical thinking skills and basic literacy needed to turn ai into a useful tool",
            "score": 18,
            "depth": 0,
            "timestamp": "2024-09-25 01:39:17",
            "replies": [
                {
                    "author": "stop-freaking-out",
                    "body": "In my professional life, I use AI to fine tune things or to make sure what I wrote conveys what I’m trying to communicate. Sometimes I just get stuck on a sentence and how I want it to flow. I usually modify against the AI suggestions because they don’t feel like my voice. I wouldn’t use it to straight up write something, I tried that on a cover letter and it wrote lies.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-05 15:30:38",
                    "replies": []
                },
                {
                    "author": "Eastern-Drink-4766",
                    "body": "The thing is that AI is so broad that if a student just wants to ask it how to write a good thesis statement, they can. We should teach the progression of using AI as a tool instead of avoiding it and allowing it to be a replacement for thinking instead of an aid. It is okay to move with the times!",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-09-25 02:30:05",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "Worse. It’s astronomically how often the answers it gives aren’t just wrong, but dangerously wrong.",
            "score": 9,
            "depth": 0,
            "timestamp": "2024-09-25 01:15:06",
            "replies": [
                {
                    "author": "rfoil",
                    "body": "It’ll get more accurate. In the interim teachers are editors of AI output.",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-09-25 06:55:22",
                    "replies": []
                }
            ]
        },
        {
            "author": "BackItUpWithLinks",
            "body": "It’s a tool. \n\nIt will make good teachers better, it will highlight even more how bad the bad teachers are.",
            "score": 50,
            "depth": 0,
            "timestamp": "2024-09-25 00:44:26",
            "replies": [
                {
                    "author": "lllBadgerlll",
                    "body": "Ha! I like that take, succinct and probably not wrong. The more time goes on the harder it will be to hide sloppy/lazy work. I feel we are in the Wild West of AI at the moment, the dust hasn't settled quite yet.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-09-25 01:02:27",
                    "replies": [
                        {
                            "author": "theonerr4rf",
                            "body": "Not really, at least how I understand it. Ai, specifically LLMS (large language models) like chatgpt need training data, and are constantly being trained on new data.\n\n IIRC it was microsoft that signed a contract with reddit to use the user generated content as AI training data. Think about how much AI generated content there is on reddit, now think about how much AI generated content there is on the rest of the internet, and/or anywhere that AI training data can/will come from.\n\n As AI gets trained on AI, the content it produces will eventually become worse. Then that worse content will eventually become training data, and the cycle will just continue.\n\nIf someone 30 years from now were to plot out a graph of “Quality of Ai outputs over time” it would look like a bell curve.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-09-25 02:33:26",
                            "replies": [
                                {
                                    "author": "Bebopo90",
                                    "body": "Eventually, smart AI developers will only train on data that is verified as having been made by a real human.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-09-25 02:50:29",
                                    "replies": [
                                        {
                                            "author": "Whyistheplatypus",
                                            "body": "And how would one verify that?",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2024-09-25 06:31:35",
                                            "replies": [
                                                {
                                                    "author": "Bebopo90",
                                                    "body": "At the very least, they would work together with publishers who claim, and can prove, that their works are all written by real humans. Then, they would program their AI to only train on things from those sources.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-09-25 19:42:11",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "rfoil",
                                                    "body": "Pattern recognition.",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2024-09-25 06:46:33",
                                                    "replies": [
                                                        {
                                                            "author": "DClawsareweirdasf",
                                                            "body": "As soon as they verify those patterns, AI generated content will assimilate them and become less distinguishable.\n\nMaybe AI will also then help identify human generated content. Which further helps AI generate human-like content.\n\nIt’ll be an arms race and we’ll never be certain what is human or not.",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2024-09-25 08:24:09",
                                                            "replies": [
                                                                {
                                                                    "author": "rfoil",
                                                                    "body": "Almost everything is derivative. The quote \"there is nothing new under the sun\" was attributed to King Solomon 3000 years ago. \n\nIt's our human job to remix and reapply our aggregate knowledge with generous doses of wisdom.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-09-25 09:27:01",
                                                                    "replies": [
                                                                        {
                                                                            "author": "DClawsareweirdasf",
                                                                            "body": "Sure, but the problem is AI can “remix and reapply” at an extremely fast rate. The only way we could keep up with that is if we use AI ourselves, therefore training it to be better at being human.\n\nI agree knowledge is derivative, but I’m saying in this race we are a human trying to outrun a cheetah. We’ll never win that race.\n\nIf we are to only train AI on human generated material, we will not be good enough at discriminating without using AI for the discrimination.\n\nSo AI will be able to learn “humans think these patterns make text sound human”. Then it will incorporate those patterns.\n\nAs we learn to discriminate those non-human patterns in AI it will, in a matter of minutes, develop newer patterns based on our new knowledge. We will never keep up.\n\nSo the only answer is that we use AI to discriminate what was made by AI or not. Therefore, training the AI even FASTER on what is considered human-like.\n\nAnd at the point, human discrimination between AI and “real” material will be so beyond the scope of what humans can do, that we effectively will be left out of the arms race all together.\n\nWe just don’t have the processing power as humans to absorb and integrate data, while seeking patterns, to compete on this.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-09-25 10:42:29",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "rfoil",
                                                                                    "body": "The difference may be that I see AI tools as subservient assistants, not peers or competitors. \n\nWe identify human problems worth solving. We employ multiple AI services to solve the problems \\~5x faster than we could a few years ago. \n\nThe real limiter for AI may be the cost in currency and energy.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-09-25 10:58:18",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "DClawsareweirdasf",
                                                                                            "body": "You are completely missing the point. This thread, and what I responded to, is about training AI on exclusively human data.\n\nI am arguing that that is impossible because AI will always have an edge at making data that appears human. If we use it as a subservient tool, then we therefore train it against itself because it will know how to “trick” itself into thinking its own content is human.\n\nWhether we use it to help us or not, it will always be able to generate content that appears human, and therefore we cannot exclusively train it on “data that is generated by humans”, unless we rely on historical sources exclusively.\n\nOur relationship with AI has no bearing on that argument. And our use of it as a problem-solving tool does not either.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-09-25 11:03:36",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Sasso357",
                                                                                                    "body": "The other problem as we've seen is it can be influenced by data given it by the programers. Their beliefs, ideals, politics, and point of view. It's biased by the programmers.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-09-25 13:45:58",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "rfoil",
                                                                                                            "body": "I've seen no evidence of that as a politically sensitive independent who hates America's current leadership choices. I have a pretty good understanding as a technologist who is deeply involved in AI architecture. \n\nI suggest providing ChatGPT 40 with the prompt \"how does AI remove political bias from content.\" You will get a more thorough answer than I can provide without falling behind on my task list. \n\nAs the bot reports: \n\nNo AI is entirely free from bias. The goal is to minimize bias to an acceptable level and continually improve through feedback and research.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2024-09-25 15:18:59",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Sasso357",
                                                                                                                    "body": "Every computer program can be programmed to view things in a certain way. That's how programming works. I'm also quite sure that the views expressed by US based ai programs will not be 100% matching of all views of everyone on earth as we all have different views. Regardless of what we want AI to be it's still just a program. Hopefully they will continue to improve and they'll be as close to unbiased as they can get.\n\nYou have not seen evidence of a lot of things in existence and yet it still exists. Other people may have observed it, or you share the AI programs biased points of view and are unable or unwilling to see anything else. You didn't get the right answer because you didn't ask the right questions. \n\n\"Yes, AI models like me can be influenced by the data they're trained on, including any biases present in that material. AI systems learn from vast amounts of text data, often sourced from publicly available content like books, websites, and forums. If that data contains biases, whether political, social, or otherwise, these can potentially be reflected in the AI's responses.\n\nHowever, AI developers generally aim to minimize these biases by employing diverse training data and implementing safeguards to ensure more balanced outputs. Despite this, complete neutrality is difficult to achieve, especially in contentious areas like politics or religion.\n\nProgrammers can also influence AI indirectly by deciding what data to include or exclude and how the model is fine-tuned, though the best practices in AI development typically involve striving for impartiality and fairness.\n\nStill, it's always good to approach any AI-generated information critically, especially on complex topics.\" From ChatGPT.\n\nI guess you skipped past the Gemini controversy already. The gender debate. Etc. ask it hot button topics, have a debate with it, play the devil's advocate, and you'll be able to see the points of view it was created with. \n\nEven the ai told you none are free of bias, just minimize it. Not everyone agrees with everyone, so obviously it'll be programmed one side over the other. They are improving as it's called a work in progress. You assume 100% unbiased because it tells you it isn't. Experiment. They have improved over the last year, but there were a lot of complaints. \n\nhttps://pubmed.ncbi.nlm.nih.gov/37928447/#:~:text=Abstract,has%20a%20left%2Dlibertarian%20orientation.\n\nhttps://pubmed.ncbi.nlm.nih.gov/35378902/\n\nhttps://www.forbes.com/sites/antoniopequenoiv/2024/02/26/googles-gemini-controversy-explained-ai-model-criticized-by-musk-and-others-over-alleged-bias/\n\nThere are many examples and studies you can read about. Regardless of whether you agree with what it says or not you should be able to agree that there is something. \n\nEven science fiction delves into the topic of ai and the possibly ways in which it can be manipulated.",
                                                                                                                    "score": 1,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2024-09-25 19:55:24",
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "rfoil",
                                                                                                                            "body": "I know the turf. I have been running software development firms for 29 years and code in 5 languages including Python, the language for training LLMs. \n\nBias is inescapable. I have a bias against students from Lafayette College, my alma mater's arch rival, and against Pakistani call center employees. We all carry forms of it. Good people fight to suppress it.\n\nThe pubmed articles are good. I don't consider Forbes an authoritative source since I can buy editorial in that rag tomorrow morning.  To quote the Fujimoto article: \"ChatGPT manifests less political bias than previously assumed; however, they did not entirely dismiss the political bias.\" That's about right from my perspective. \n\nI'm aware of the regrettable Gemini controversy but I'm not familiar with the product. Happy it was uncovered. The problem was identified as over-correcting against the risk of being racist. \n\nI'm very concerned with the media bias that seems persistent and firmly entrenched. Humans purposely distort the news to support their favored candidates and perspectives. I'm far more confident in news delivered via ChatGPT than from Rachel Maddow or Sean Hannity.",
                                                                                                                            "score": 1,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2024-09-25 21:27:44",
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Sasso357",
                                                                                                                                    "body": "\"Several AI systems, including facial recognition tools and chatbots, have unintentionally displayed racist or biased behaviors due to the datasets they were trained on, which may contain biased or discriminatory data. For example, Microsoft's 2016 chatbot \"Tay\" was quickly manipulated by users to generate offensive content, highlighting the vulnerabilities of AI to bias when not properly safeguarded. The biases often arise from the underlying data and societal prejudices embedded in the sources used for training.\" As per ChatGPT. \n\nWhich was my original point. Even ChatGPT will tell you that you should be careful of the content that it posts because of the reasons I said. You can ask ChatGPT that. People should gather news from multiple sources, and not just from one side, but from both sides and then make your own decision as unbiased as you can.\n\nI'm sure AI developed in different parts of the world will come to different conclusions on a lot of political religious and belief based questions. Whereas a lot of factual base questions they'll probably reach the same conclusion.\n\nIn the news recently, it was quite interesting. If AI falls into the wrong hands, it can be programmed for doing criminal activity. For example, we now have hackers employing AI to help steal crypto and passwords. That is also an easy Google search if you want to check it out.\n\nChatGPT replied \"I believe your concerns about AI bias are valid. AI systems can indeed reflect the biases present in their training data, which might come from culturally or politically skewed sources. While developers strive to minimize bias, the complex nature of AI means it can inadvertently absorb and reproduce societal prejudices. Since AI is shaped by human decisions—both in data selection and model design—it's crucial to approach AI outputs critically and verify them with multiple perspectives, especially on sensitive topics like culture, politics, and ideology.\"\n\nThat being said I still think AI is amazing and I hope to see how they advance in the future and one day hopefully a true AI.",
                                                                                                                                    "score": 1,
                                                                                                                                    "depth": 15,
                                                                                                                                    "timestamp": "2024-09-26 08:32:00",
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "rfoil",
                                                                                                    "body": "Considered it irrelevant so I ignored it.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-09-25 15:21:02",
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Whyistheplatypus",
                                                            "body": "So, exactly what an AI seeks to emulate?",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-09-25 08:45:13",
                                                            "replies": [
                                                                {
                                                                    "author": "rfoil",
                                                                    "body": "I wouldn't describe AI as emulation. It's more human designed automation that has access to a huge knowledge store. \n\nWithout this type of automation in your toolbox will be the equivalent of shipping a product using horse drawn wagons. That may be romantic on Mackinac Island, but useless in the modern world.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-09-25 09:14:47",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Whyistheplatypus",
                                                                            "body": "We are literally discussing the issue of AI emulating human comments though.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-09-25 09:33:11",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "theonerr4rf",
                                            "body": "Hopefully soon, everyday the line gets blurryer",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2024-09-25 02:58:26",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Slow_Supermarket5590",
                    "body": "It's not a tool. It's garbage  used to plagiarize. No good teacher allows it to be used.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-09-25 06:56:13",
                    "replies": [
                        {
                            "author": "BackItUpWithLinks",
                            "body": "> No good teacher…\n\n[No true Scotsman](https://quillbot.com/blog/reasoning/no-true-scotsman-fallacy/)\n\n🙄",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-09-25 07:22:04",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Chileteacher",
                    "body": "I so strongly disagree with this.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-09-25 21:41:22",
                    "replies": [
                        {
                            "author": "BackItUpWithLinks",
                            "body": "Cool. \n\nIt’s coming, so embrace it or get out.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-09-25 22:04:20",
                            "replies": [
                                {
                                    "author": "Chileteacher",
                                    "body": "What do you teach ?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-09-29 19:57:11",
                                    "replies": [
                                        {
                                            "author": "BackItUpWithLinks",
                                            "body": "I taught high school math. \n\nNow I teach technology for a corporation.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-09-29 20:55:53",
                                            "replies": [
                                                {
                                                    "author": "Chileteacher",
                                                    "body": "Now your response makes a lot of sense.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-10-01 15:05:02",
                                                    "replies": [
                                                        {
                                                            "author": "BackItUpWithLinks",
                                                            "body": "Yours doesn’t",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-10-05 09:09:21",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Chileteacher",
                                                    "body": "So you’ve never taught writing, now work in corporate education, this is the oldest trope in the book. People making claims about things they know nothing about",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-10-02 16:18:12",
                                                    "replies": [
                                                        {
                                                            "author": "BackItUpWithLinks",
                                                            "body": "> So you’ve never taught writing, \n\n🤣\n\nWhat does that have to do with anything?\n\n> People making claims about things they know nothing about\n\nThat’s even funnier",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-10-05 09:11:03",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "BackItUpWithLinks",
                                                            "body": "> So you’ve never taught writing, \n\n🤣\n\nWhat does that have to do with anything?\n\n> People making claims about things they know nothing about\n\nThat’s even funnier",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-10-05 09:11:08",
                                                            "replies": [
                                                                {
                                                                    "author": "Chileteacher",
                                                                    "body": "Hmm, well you would have a perspective that literally every subject but math and gym have, as they all involve writing. AI is used to produce poor writing and students gravitate towards it, forgetting how to write. Let me know if you need me to explain anything else about education for you.",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-10-06 19:47:40",
                                                                    "replies": [
                                                                        {
                                                                            "author": "BackItUpWithLinks",
                                                                            "body": "🤣\n\nYou think kids aren’t using AI/chatgpt to do their math?\n\nLet me know if you need a reality check about anything else.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-10-06 19:50:21",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Chileteacher",
                                                                                    "body": "Yeah they are, but a timed math test quickly susses out if they know it or not. When you are grading large pieces or writing, unless you have them sit in front of you for weeks and write it, there is no sussing out. 🤣",
                                                                                    "score": 0,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-10-06 20:01:00",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "BackItUpWithLinks",
                                                                                            "body": "You can easily see if a kid is using AI on a large writing project by looking at draft history.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-10-06 20:02:39",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Chileteacher",
                                                                                                    "body": "No.. no you can’t completely. A student could have a seperate “draft” up that they are writing from. Essentially AI takes everything that is great about human ingenuity and creativity for derivative internet word slop",
                                                                                                    "score": 0,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-10-06 20:06:24",
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mazdarx2001",
            "body": "Neither if it is taught well. That’s like asking if the “calculator “ was going to make teaching better or worse. Another is word processing software, or internet. I’m not sure any one of those could be said they made teaching better or worse. Students need to learn how to use them properly to increase productivity when writing, coding etc. If my students are practicing on ChatGPT everyday and your school is banning it completely, my students will be more productive,prepared and more desirable for hire. Imagine trying to get a job at NASA in the 70’s and 80’s and not knowing how to use a calculator or a computer because that was “cheating” or some other excuse made my a teacher or staff decision maker.",
            "score": 13,
            "depth": 0,
            "timestamp": "2024-09-25 00:20:21",
            "replies": [
                {
                    "author": "theonerr4rf",
                    "body": "Not really, at least how I understand it. Ai, specifically LLMS (large language models) like chatgpt need training data, and are constantly being trained on new data.\n\nIIRC it was microsoft that signed a contract with reddit to use the user generated content as AI training data. Think about how much AI generated content there is on reddit, now think about how much AI generated content there is on the rest of the internet, and/or anywhere that AI training data can/will come from.\n\nAs AI gets trained on AI, the content it produces will eventually become worse. Then that worse content will eventually become training data, and the cycle will just continue.\n\nIf someone 30 years from now were to plot out a graph of “Quality of Ai outputs over time” it would look like a bell curve. Especially when it comes to code, if one error made in a line of ai generated code is used everywhere then that will become training data, and then be everywhere",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-09-25 02:35:23",
                    "replies": [
                        {
                            "author": "Ok-Confidence977",
                            "body": "Why are you just copy/pasta’ing your reply. Highly suspicious 🤖",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2024-09-25 06:28:41",
                            "replies": [
                                {
                                    "author": "theonerr4rf",
                                    "body": "It was realvent to u/mazdarx2001 s comment as well. Notice how I even tacked on a bit mentioning something they said?. Im not a robot but people I know in real life say I act like one, and Im on a team that builds them so maybe I am… 🤷‍♂️",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-09-25 06:56:36",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Unfair_Salt_9671",
            "body": "I will word this simply: if you want yourself and future teachers of your class to receive as few ai written assignments as possible, then the best thing is to not be a hypocrite and avoid ai like the plague.",
            "score": 13,
            "depth": 0,
            "timestamp": "2024-09-25 00:43:34",
            "replies": [
                {
                    "author": "MAmoribo",
                    "body": "Is this satire?\n\nAvoiding a piece of technology (instead of teaching how to use it responsibly) is, simply put, dumb. These kids are already typing with two fingers because we got rid of typing class and they can barely write letters (or spell!) because we've been pushing 1 on 1 classroom with tablets and Chromebook. They don't know how to properly use Google and that drives me up a wall!\n\nTeaching how to use a tool safely, responsibly, and accurately will ALWAYS outweight ignorance towards it. The teachers I work with talk about chat got like it's from the future and some mysterious, useless object. Do I ethically agree with how they source information to feed the AI? Or how much energy it takes, no. But I do see the value in something that is new and upcoming. \n\nchat gpt is am amazing translator, Google translate could NEVER compete with these translations. Think of all thr ell kids who could benefit if taught correctly? Or how many more parents you could reach?\n\nChat gpt writes my parent emails when I'm fuming and don't want to sound like a cunt. It also helps write rubrics and descriptions for class projects. I go and edit, but the base is Ai. Same for things like grant proposals. I am editing, but the base is Ai because I am busy and don't want to stress over \"wording something well enough\". I'm an amazing editor, and this is a perfect tool for me.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-09-25 02:40:14",
                    "replies": [
                        {
                            "author": "Mother_Sand_6336",
                            "body": "So, because it’s a useful tool for you, you overlook the ethical and environmental harms… ?\n\nIt seems the same logic got kids those Chromebooks and Google accounts. It was a useful way to collect children’s data and instill habits, so we all ignored the possible harms.",
                            "score": 9,
                            "depth": 2,
                            "timestamp": "2024-09-25 06:50:26",
                            "replies": [
                                {
                                    "author": "MAmoribo",
                                    "body": "No, but whether I agree with it or not, it is something that is going to shape the future of technology. It's the same as the internet. Not teaching kids how to Google something or the harms of it/security is stupid. It's here to stay and if they don't learn the dangers and benefits of new technology, they're going to be more likely to get behind or even scammed/harmed with it.\n\nData collection is bad and I never said I was for Chromebook. I'm for typing class (which can be done without internet). But then... You are using social media and using Google and putting your information online. If we don't teach kids how to do it safely, again, we're not setting them up for success. Period. It's the same as sex Ed. Only teach abstinence, then you have stds and teen pregnancies.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-09-25 08:24:12",
                                    "replies": [
                                        {
                                            "author": "Mother_Sand_6336",
                                            "body": "I agree with you, then. An intentional and skeptical approach that explicitly teaches about tech is much preferable than just saying ‘well, laptops and phones are a thing so we should just accept they’ll be in the classroom’. And learning to use Google might make sense in MS, but I don’t think AI should be encouraged until after they’ve developed their own understanding of the writing process.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-09-25 10:33:51",
                                            "replies": [
                                                {
                                                    "author": "MAmoribo",
                                                    "body": "Encouraged is not the word I want to use. I think it can assist in writing process.\n\nHave Ai write an intro, have kids critique it and enhance/make it better after they learned how to write an intro type of ordeal.\n\nIts a tool for learning when used with intention.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-09-25 10:50:08",
                                                    "replies": [
                                                        {
                                                            "author": "Mother_Sand_6336",
                                                            "body": "I just don’t think you need ai for that. And I would want them to research or write without the internet beforehand.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-09-25 13:29:08",
                                                            "replies": [
                                                                {
                                                                    "author": "MAmoribo",
                                                                    "body": "You dont need ai. You also do not need the internet or a computer for that… do you use either of those tools in an english class? Why? They can use pen and paper. Just like ai, those things are tools kids need to be aware of & if they learn how to use tools properly, people are more knowledgable. I think AI is here to stay, so i want kids to have the knowledge, whether they use it or abuse it; theyre making an informed decision",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-09-25 13:35:16",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Mother_Sand_6336",
                                                                            "body": "My students use computers outside of class, and I’m sure they use the internet, but the internet has not helped them grow as thinkers or writers. Paper and pencil are better tools for that part of education. \n\nIf they develop their own confident writing process, it will be a cinch for them to pick up use of AI.",
                                                                            "score": 0,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-09-25 14:13:52",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Slow_Supermarket5590",
                            "body": "It's not a tool. Swing and a miss",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-09-25 06:57:39",
                            "replies": [
                                {
                                    "author": "grandpa2390",
                                    "body": "What is your definition of a tool?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-09-25 23:05:13",
                                    "replies": []
                                },
                                {
                                    "author": "uncle_ho_chiminh",
                                    "body": "\"a device or implement to carry out a particular function\"\n\nWeird. Sounds like a tool to me.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-09-25 10:52:35",
                                    "replies": []
                                },
                                {
                                    "author": "MAmoribo",
                                    "body": "Lol how you a teacher? Not knowing what a tool is? That's crazy.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-09-25 08:24:56",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Fresh-G6618",
                            "body": "THIS!",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-09-25 04:18:41",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Critique_of_Ideology",
            "body": "I think it will make it more difficult for many kids to be able to think even simple thoughts without it, so in that sense I am really pessimistic. It will also do lots of cool stuff and it can talk to you now so that’s neat. It might also end up killing all of us in some completely unpredictable way. Little column, A little column B, little possible Armageddon.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-09-25 05:36:43",
            "replies": []
        },
        {
            "author": "Takeurvitamins",
            "body": "Everyone keeps saying “it’s a tool, like a calculator!” Yeah but you don’t give a kindergartener a calculator, you teach them basic math first and give them the tool later once they understand basic concepts. School is the place for those basic concepts. \n\nPeople who want to give AI to kids forget that as adults we’ve had 20+ years learning how to investigate, how to hunt, how to ask questions. With google, kids ask one question and give up. Giving kids AI is basically Ipadding them on overdrive. \n\nAnd for everyone saying that we need to teach them properly, what class are you going to give up to make room for AI class?",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-09-25 05:43:33",
            "replies": [
                {
                    "author": "grandpa2390",
                    "body": "Most of the comments I've read so far regarding it being a useful tool (at least top level) are referring to its use by teachers.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-09-25 23:07:07",
                    "replies": [
                        {
                            "author": "Takeurvitamins",
                            "body": "Most of the comments here are not representative of my admin unfortunately. But if you want my take on use by teachers:\n\nIt’s also bullshit. This is my fifth year teaching and I’m finding out how many teachers just want easy street. I’m teaching with a peer who just uses everything I have plus stuff from a website. Give dittos made by other teachers, teach from slide decks made by other teachers, give other teachers’ tests. Have we no work ethic to make our own material? If we default to having AI do this for us, what are we even doing? My mom was a teacher and my friends dads always had some smart shit today like “those who can’t do, teach” and asking AI to do the work for us just validates that shit in my eyes. \n\nI legit watched a teacher use MagicClass to whip up a slide deck for a class he has no business teaching (not trained in it, very aware he has no business teaching it) minutes before the class. and stumble through it. He never even fact checked it!\n\nI understand using a calculator - it’s for complex problems that we don’t need to focus on because our job isn’t the math, it’s determining what to do with the math. With AI, if it’s doing the job of creating lesson plans, grading, provide feedback, then what the hell are we for? The analogy doesn’t work for AI and teachers like it does for calculators because building your class IS part of what you should be focusing on. When you build your class, you are a better teacher.\n\nFor those who say they use it for inspiration, I’ll go back to the hunting skill I mentioned for students: if you want to be inspired, talk to people, read, watch YouTube videos, and then tweak those ideas to be your own. If you just ask AI to give you ideas, you haven’t even gone to the trouble to investigate what’s been done and what you could do.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-09-25 23:30:51",
                            "replies": [
                                {
                                    "author": "grandpa2390",
                                    "body": "I would say in response to the attitude of everybody about this profession and how it might be affected by this. This is a very thankless job, and so I really don’t care what they think anymore. As long as my students are getting what they need. I’m not gonna make my life harder than it has to be and burn out so my students suffer just to try and change the minds of people who will never respect me and what I do. I mean, nobody’s going to be impressed if I’m not using it when I could. So I’m just going to use it in a way that I can still respect myself\n\nThat’s just me, of course",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-09-26 00:04:56",
                                    "replies": [
                                        {
                                            "author": "Takeurvitamins",
                                            "body": "Fair enough. I’m coming from academia, for what it’s worth. I don’t want to burn out obviously, but I also can’t be happy not making my own work. Th teacher I’m teaching with constantly has to say “huh…I’m not sure what they’re asking here…” while I can tell my student exactly what I’m asking and why.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-09-26 05:26:30",
                                            "replies": [
                                                {
                                                    "author": "grandpa2390",
                                                    "body": "Totally understand. We all have different ways of measuring our… work ethic. I could outsource more of my job than I do if I weren’t concerned about having self respect. Also, I don’t like the output enough, so I use it as an assistant, coplanner, instead. I couldn’t use it to help me grade. It isn’t trustworthy enough for something like that",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-09-26 17:58:41",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "grandpa2390",
                                    "body": "I use it for inspiration in addition to all that you mentioned. For me it’s one more tool rather than a Swiss Army knife or a magic wand.\n\nI think it’s like the other teachers said here. It will make good teachers better by giving them one more tool. And bad teachers worse… much worse",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-09-25 23:37:02",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "uncle_ho_chiminh",
                    "body": "Who said anything about giving it to the kids especially before they learn the basics?",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-09-25 10:53:21",
                    "replies": [
                        {
                            "author": "Takeurvitamins",
                            "body": "My admin",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-09-25 15:46:21",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "syntaxvorlon",
            "body": "I have seen a number of opinions here that view the LLMs as tools. They are correct, but they misattributed who is using the tool on whom.\n\nTech companies exist to employ computers to serve capital, to enrich a few while emmiserating the many. What this latest round seeks to do is remove a layer of workers from the economy and replace them with a few poorly paid skilled workers who can fix the mistakes the LLM inevitably makes.\n\nImagine if your boss fired you and your colleagues so his idiot brother could do your job (for free) then rehired you as his assistant to fix his fuck-ups at worse pay. You would be doing the parts of your job he can't and making up for the parts he can do (badly). Your skilled labor has been \"disrupted,\" you make less money and your boss gets to keep your pay.\n\nThis has literally already happened at a hilariously expensive school in England. But I want you to imagine it happening to a wider economy, to all of the college graduates who manage to start a career. It has become hard enough to get work with a BA, now you can be an Idiotbox Helper for $16 per hour with an MA.\n\nWhen that trend starts becoming apparent it will ABSOLUTELY demotivate students, which will make your job as an Educational Aide even harder as you try to get kids to actually use the AI to learn Algebra.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-09-25 04:43:46",
            "replies": []
        },
        {
            "author": "LordLaz1985",
            "body": "It’s already making things worse.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-09-25 05:24:14",
            "replies": []
        },
        {
            "author": "Tylerdurdin174",
            "body": "I genuinely do not understand how anyone in education who has even remotely messed around with AI doesn’t think this is a significant threat to the profession.\n\nAt a time when education is devalued as a career and there are significant shortages of people entering the field it just so happens that a tool has developed that can do a significant portion of the job instantly and at a high level.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-09-25 18:56:22",
            "replies": [
                {
                    "author": "grandpa2390",
                    "body": "It does pretty well, but I don't see how it could replace a human editing it and executing it. Not anytime soon at least. If it does surpass human teachers then I suppose that will be great for all of those who need a teacher. I hate to be a person that says (as an example) we should stop experimenting with green energy because it's a threat to my job in the coal mines. Though I feel the pain.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-09-25 23:09:38",
                    "replies": []
                }
            ]
        },
        {
            "author": "sajaxom",
            "body": "It is an interesting lesson in trust. I feel most people would not trust a random redditor to write content for assignments, as a student or a teacher. And yet, when we slap AI on something, people tend to automatically trust it, to believe that it has knowledge or value beyond our own. If we all learn the lesson of “don’t trust the random person/thing that claims to solve all your problems”, then yeah, it could make education better. But I don’t think any of us believe that is actually going to happen.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-09-25 03:20:09",
            "replies": [
                {
                    "author": "grandpa2390",
                    "body": "I don't \"trust\" it per se. It's like having a... Teaching assistant. Someone who I can discuss lesson plans, ideas, etc. with. I question it, I argue with it, I give it suggestions, Ask it for suggestions, tips/advice, and together we eventually end up at a result that I want. The great thing about it is that I can reject its ideas without feeling guilty. I hate when I work with people and I don't like their ideas but I don't want to hurt their feelings.\n\nI don't have to worry about hurting its feelings. No that's not a good idea, that's not what I want. I'm not doing that. Try again. Give me better suggestions. haha. Explain why you suggest doing it that way. Meh, I don't like that reasoning, I read I should be doing it like this.Let's try this approach. \n\nChatGPT \"You're right. I overlooked that. Let me try again with... insert methodology etc....\"",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-09-25 23:17:31",
                    "replies": [
                        {
                            "author": "sajaxom",
                            "body": "That’s a reasonable way to use it, as a sounding board that helps you sort and rank your ideas. But I don’t think most people are using it that way, and that is my concern. We have tried to super-humanize it, to make it appear as though it contains knowledge and should be trusted and respected. We have created something that can spit words out like a human, because it has been trained on human language, and that has fooled a lot of people into believing that it reasons like a human. In reality, it does not reason at all. It is not intelligence, it’s a language model. It is an excellent tool for its purpose, like a hammer. But that is all it is - there is no knowledge behind that, just the next word.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-09-26 01:07:51",
                            "replies": [
                                {
                                    "author": "grandpa2390",
                                    "body": "I know what you mean. I totally agree with the others who say it will help good teachers do better and bad teachers do worse. Absolutely 100% that.\n\nTo further add to the last part of what you said. For me, and hear me out, I see it as Google 2.0 unless there already exists a Google 2.0, then whatever number. In many respects, I often use it much in the same way as I would a search engine. As a sounding board etc. and also to get ideas (which I then often take to Google to find the REAL source of and see how those ideas actually work etc.)\n\nJust as an example, right now I'm trying to use it to create a better scope and sequence for teaching my ELL students (I work in an international school) English. It's better than working on it myself, but what it wants to give me sucks. I'm combining it with my experience and any other source I have access to try and work out a scope and sequence that will work for my students.\n\nI don't see it replacing the smart people at Cambridge, Oxford, etc. anytime soon.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-09-26 01:13:11",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Neither_Pudding7719",
            "body": "Better… And worse.  I want to see AI summarize this comment thread.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-25 06:04:08",
            "replies": [
                {
                    "author": "grandpa2390",
                    "body": "I just copied and pasted. Didn't bother formatting or anything to make sure it was all legible. So I don't know how much of the thread, and its layout, the LLM actually understands.\n\nIn the Reddit thread, participants discuss the role of AI, particularly ChatGPT, in education. The consensus is that AI is a tool that can either improve or hinder education depending on its use. Good teachers could enhance their skills using AI for tasks like planning and creating materials, while bad teachers may misuse it, leading to negative outcomes. Some express concerns about AI's long-term impact on student learning and creativity, while others emphasize responsible use and the potential for AI to streamline tasks. Overall, the debate highlights AI’s dual potential.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-09-25 23:15:10",
                    "replies": [
                        {
                            "author": "Neither_Pudding7719",
                            "body": "Thanks!  There we are.  Now here is where this thread begins to look like one of those mirrors facing a mirror where the images reproduce in a seemingly infinite cascade!  I copied and pasted u/grandpa2390 's summary into a GPT prompt and asked the LLM to evaluate the summary from a Reddit thread and provide analysis including several examples of both positive and negative outcomes from the burgeoning AI introductions in education.  I advised it to limit respose to 200 words or fewer.  \n\nI'd give the response an A grade!  LOL",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-09-26 14:11:21",
                            "replies": []
                        },
                        {
                            "author": "Neither_Pudding7719",
                            "body": "The summary effectively captures the central debate about AI's role in education, noting both the positive and negative potential based on how it is used.\n\n**Positive outcomes:**\n\n* **Enhanced teaching efficiency:** AI can help teachers automate routine tasks like grading and lesson planning, allowing more time for direct student engagement.\n* **Personalized learning:** AI tools can tailor educational content to meet individual students' needs, improving outcomes for diverse learners.\n* **Resource creation:** Teachers can use AI to develop interactive and dynamic learning materials, enhancing the educational experience.\n\n**Negative outcomes:**\n\n* **Overreliance on AI:** If teachers or students depend too heavily on AI, it may reduce critical thinking, problem-solving, and creativity.\n* **Reduced teacher-student interaction:** Automation could lead to less personal attention, diminishing the student-teacher relationship that is vital for emotional and academic support.\n* **Equity concerns:** Not all students or schools may have access to AI tools, exacerbating existing inequalities in education.\n\nAI's potential hinges on responsible, balanced integration into educational systems.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-09-26 14:14:22",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok-Confidence977",
            "body": "It’s going to make some things better and other things worse. You know, like every other technology.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-25 06:27:22",
            "replies": []
        },
        {
            "author": "SinfullySinless",
            "body": "I like it as a basic tool that can speed up planning if placed in the hands of someone who understands their craft. \n\nI go to AI PD courses all the time, our district tech guy is a massive nerd and goes to conferences all the time so he is very useful. \n\nI use Diffit to change reading levels for the world’s fastest differentiation. Diffit can also create questions and worksheets based on the text. \n\nI use the Tools -> Translate function on Google Docs all the time for Level 1-2 ML students to get texts in their own reading level. \n\nI use Formative with NewsELA or unit vocab to create understanding checks or study activities. \n\nNow where AI fails is I have gone to ChatGPT and I have given it a super detailed prompt to create a lesson. It can provide a super basic lesson that, if you knew nothing about the topic, it does seem like a solid lesson. \n\nAlso I’ve tried to submit my project directions + detailed prompts for ChatGPT to create rubrics, never liked them. It’s easier and faster to just make my own rubric. \n\nOverall, AI is great for planning in the hands of someone who knows what they are doing. But ChatGPT taking over education? Not likely.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-25 07:18:43",
            "replies": []
        },
        {
            "author": "Temporary-Dot4952",
            "body": "Well, seeing as near constant tech use has destroyed the normal development of most of our students' brains, I would assume that chat GPT will also make it worse.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-25 07:20:01",
            "replies": []
        },
        {
            "author": "uncle_ho_chiminh",
            "body": "Both. Depends how people use it. It really does set a higher skill floor though for both students and teachers. If you aren't better than AI, you're useless. I fear for all my failing high school students futures with the advent of AI.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-25 10:49:07",
            "replies": []
        },
        {
            "author": "Deskbot420",
            "body": "AI is a tool that can support learning but isn’t an alternative to learning. That being said it’s been one of the most helpful tools in recent times to make education better. \n\nPlus, AI as a tool is still questionable at best. It can do some cool stuff but it also can’t count how many times the letter R appears in the word strawberry. So who’s to say really it’s still personal opinion",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-25 13:17:46",
            "replies": []
        },
        {
            "author": "EvilNoobHacker",
            "body": "I mean, it’s a tool, the worry, like every other tool, is that students are gonna try and make the tool do all the work for them. \n\nThen again, same thing was said about the internet and that’s seemed fine enough so far. \n\nBesides, if you’ve taken a look at any AI outside of ChatGPT, it’s looking like less and less of the techno-hell future Silicon Valley bros tend to uncritically adore. The consolidation towards the big dogs in AI was *quick*.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-25 14:10:33",
            "replies": []
        },
        {
            "author": "grandpa2390",
            "body": "It's a tool. It's very useful if you treat it like a tool. I have used it to help me develop curriculums that don't exist. Like I needed to develop a plan for an afterschool screen-free coding program for kindergarten. I know a lot about programming but not about teaching it to K students. I found a few resources here and there on the internet, but AI helped me put it together and contribute things that I didn't know and couldn't find elsewhere.\n\nI say it contributed because it wasn't as simple as \"Give me a 16 week screen-free coding course\" and done. I could have done that, but it would have been very lazy and terrible. I had to look over what it spat out. I had to do a lot of tweaking. This activity is not very good, I saw this suggested elsewhere for this skill, let's do it instead. etc.\n\nI even learned a few things as I asked it why it thinks the students should do things in this order but not that. On more than one occasion I was like... yeah that makes perfect sense. We'll do it like that. The program went very well.\n\nI've also used it to help me save time on tedious paperwork so I can spend more time thinking about my students/lessons. And It's been a really great brainstorming tool for activities and strategies for teaching this or helping a student with this issue or that issue (or symptoms if I don't know the issue).\n\ntl;dr\n\nit's like cyborgs or something. Good teachers will use it to augment their already great (or striving for great) skills. Bad teachers will just become worse because if you take what ChatGPT spits out and call it a day.... it's not going to go very well for you. Well enough that you might keep your job, but... Maybe not if all of the good teachers, and caring teachers become even better with the use of the tool so that the divide just becomes so much larger and obvious.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-25 23:01:56",
            "replies": []
        },
        {
            "author": "RaspberryOk9709",
            "body": "I think AI doesn’t give a damn about education. I use it as a teacher to make rubrics and SMART goals and kids use it to try not to actually do their work",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-25 23:58:15",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Did the smart board make education better or worse?",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-26 00:58:08",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "I think overall it will make education better. I am going to use my college courses as an example. If I currently copy paste any test question from one of my online courses AI or google itself will bring up a Quizlet someone else has made with all the answers ready for me to use. AI is going to force educators to stop using lazy pre-made stuff and actually tailor education to their students and current knowledge.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-09-26 20:02:43",
            "replies": []
        },
        {
            "author": "Medieval-Mind",
            "body": "Better, assuming we can learn how to use it properly. From my perspective as a teacher, I use it frequently to make my life easier - defining words appropriately, creating work for students, etc - allowing my to have less on my plate so I can focus more on education. On the other hand, many of my students no longer write their own essays, they just get ChatGPT to do it. Until and unless we learn how to fix that, it'll be worse... but I think - or at least, I *hope* - we will eventually learn how to control the technology appropriately.",
            "score": -2,
            "depth": 0,
            "timestamp": "2024-09-25 00:44:39",
            "replies": [
                {
                    "author": "chuckitiff",
                    "body": "My concern is also with the people talking about how wrong the answers can be. Why are they not doing their job of reading over things and fixing them? Again. AI is a tool, not the entire answer. \n\nI have used it to make assignments, passages, write emails to make them sound more professional, etc. but I always check the work and change what is necessary. You should be tying in the AI with other resources. If they're just trying to use the AI, I could see why it's failing. \n\nAI is here and isn't going anywhere. People are going have to get on board or drown.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-09-25 05:53:16",
                    "replies": []
                }
            ]
        },
        {
            "author": "spakuloid",
            "body": "Better *1000",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-09-25 02:02:25",
            "replies": []
        },
        {
            "author": "5pudding",
            "body": "Neither, it will just become a part of life - AI is a horribly misused buzzword at the moment which you could argue has been here for a decade or more already.\n\nThe Key is how you use it. Some people have zero literacy with the internet in general, or how to search for something. Those who do, get the advantages.\n\nSimilar to the whole \"you won't have a calculator with you when you're older\" argument. Those who resist change will end up unnecessarily doing things the hard way",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-09-25 02:25:23",
            "replies": []
        },
        {
            "author": "Sasso357",
            "body": "Can save teachers lots of prep time. Students skills have dropped dramatically, which shows on tests. What should have been a study/research assistant, turned into an education blocking program.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-09-25 13:40:52",
            "replies": []
        },
        {
            "author": "rfoil",
            "body": "AI for education is in its infancy. In a one hour demo of a planning tool last week, teachers stayed for 2.5 hours and wanted implementation the next day. In the words of a department head, “this promises to turn the tedium of learning prep on its head.”",
            "score": -1,
            "depth": 0,
            "timestamp": "2024-09-25 06:53:43",
            "replies": []
        },
        {
            "author": "rfoil",
            "body": "The reduction in lesson planning time is generally estimated to be 80% for secondary school teachers. Schools that don’t provide AI assistance will lose faculty quickly.",
            "score": -1,
            "depth": 0,
            "timestamp": "2024-09-25 06:57:41",
            "replies": []
        },
        {
            "author": "rfoil",
            "body": "The giant educational publishers will be the big losers in the AI world. Continuous improvement, endless flexibility, and  unlimited resources applied via teacher selectable pedagogies and lesson templates. But the big winner is students, because differential instruction will be managed by the bots. \n\nTeachers will be learning orchestrators, encouragers, and facilitators. The promise of the No Child Left Behind Act of 2001 will finally be realized, nearly 30 years after its signing. \n\nOdd that it was a foreign national who quoted from the NCLBA, yesterday, as an aspiration whose time has finally come.",
            "score": -2,
            "depth": 0,
            "timestamp": "2024-09-25 08:10:51",
            "replies": [
                {
                    "author": "rfoil",
                    "body": "For background, I've done consulting work and been on the editorial board for one of those education giants.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-09-25 08:13:24",
                    "replies": [
                        {
                            "author": "CommercialBee6585",
                            "body": "If you were a parent sending your child to a fee paying school, would you be satisfied with your investment if teachers were using AI? ",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-09-25 13:35:07",
                            "replies": [
                                {
                                    "author": "rfoil",
                                    "body": "I'd think they were backward and poorly prepared if they weren't using AI next year. This year is a bit early.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-09-25 14:59:38",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rfoil",
                    "body": "For those doubters, one of our team members was an observer at an adult learning class tonight. The teacher was euphoric about AI lesson planning and said she can't imagine teaching without it after only a few classes. \n\nNo going back.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-09-25 21:31:51",
                    "replies": []
                }
            ]
        }
    ]
}