{
    "post_title": "Study: Automation drives income inequality",
    "post_timestamp": "2022-11-21 07:23:24",
    "last_comment_timestamp": "2022-11-23 13:03:25",
    "time_difference": "2 days, 5:40:01",
    "comments": [
        {
            "author": "FuturologyBot",
            "body": "The following submission statement was provided by /u/Gari_305:\n\n---\n\nfrom the Article\n\n>“If you introduce self-checkout kiosks, it’s not going to change productivity all that much,” says MIT economist Daron Acemoglu. However, in terms of lost wages for employees, he adds, “It’s going to have fairly large distributional effects, especially for low-skill service workers. It’s a labor-shifting device, rather than a productivity-increasing device.”  \n>  \n>A newly published study co-authored by Acemoglu quantifies the extent to which automation has contributed to income inequality in the U.S., simply by replacing workers with technology — whether self-checkout machines, call-center systems, assembly-line technology, or other devices. Over the last four decades, the income gap between more- and less-educated workers has grown significantly; the study finds that automation accounts for more than half of that increase.\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/z0xowq/study_automation_drives_income_inequality/ix7tk43/",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 07:56:13",
            "replies": []
        },
        {
            "author": "coyote-1",
            "body": "There is supposedly a labor shortage. It’s awfully difficult to reconcile a supposed labor shortage with increases in automation with folks bitching about losing jobs to immigration.\n\nSomething does not add up.\n\nBut the reality of course is this: one person monitoring a half-dozen automated cashiers, vs a half dozen real life cashiers. The machines don’t need medical benefits or competitive salary. The moment the dollar amount of *shrink* is made up for by the labor/benefit savings, of course the automation replaces the humans.\n\nThe other half of that reality: when Jane cannot work as a cashier at the market, her job prospects are bleak. If she and all like her can no longer afford to come in to purchase food, the market goes out of business. Automating people out of jobs ultimately comes back to bite the economy on the ass.\n\nThe automation wave is just getting into *hockey stick graph* territory. At some point in the forthcoming decade or so, a universal basic income is going to become a necessity.",
            "score": 135,
            "depth": 0,
            "timestamp": "2022-11-21 08:56:26",
            "replies": [
                {
                    "author": "Skarr87",
                    "body": "You basically described why capitalism the way we apply it and in a generalized way, profit motive is a system that will eventually cannibalize itself.  Automation and AI should herald in an increase to human welfare and prosperity but instead may lead to economic collapse where the only way to mitigate/delay it is to apply bandaids that are antithesis to the system that is the cause of the collapse.  So there will be heavy pushback in implementing these new programs.",
                    "score": 46,
                    "depth": 1,
                    "timestamp": "2022-11-21 12:55:38",
                    "replies": [
                        {
                            "author": "brandonsredditname",
                            "body": "Why mitigate/delay the ultimate synthesis?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-21 18:07:32",
                            "replies": [
                                {
                                    "author": "getdafuq",
                                    "body": "Because mUh FrEe MaRkEt!",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 22:53:12",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "boxsmith91",
                    "body": "UBI won't solve anything without massive changes to our entire system. In the US and to a lesser extent, the entire world \n\nThink about it: if everyone over 18 is suddenly getting $1000 a month from the government, what will food suppliers do? Raise prices. General goods suppliers? Raise prices. How about landlords? Raise prices.\n\nAbout 50% of the US rents. And guess what? It's the half that needs the UBI to begin with. If you think landlords won't just raise rent by $900, you haven't been paying attention.\n\nAll the tests done over the years on UBI were too small and localized to affect prices. It's misleading data at best.\n\nUBI without strict price and rent controls will ultimately just lead to hyperinflation. And with those controls in place, you'd no longer be in a capitalist system anyway. And I'm fine with that, but I think the deeper question is: if we need to warp our economic system to such a degree to make UBI work, what's even the point of capitalism anymore? Of currency?",
                    "score": 40,
                    "depth": 1,
                    "timestamp": "2022-11-21 12:19:46",
                    "replies": [
                        {
                            "author": "Artanthos",
                            "body": "Which is why my prediction is massive barracks style dorms and cafeterias.\n\nThe government will farm out to the lowest bidders. Everyone gets very basic food and shelter. The government pays far less than trying to provide everyone with individual homes. No money is transferred to the jobless.",
                            "score": 11,
                            "depth": 2,
                            "timestamp": "2022-11-21 14:25:39",
                            "replies": []
                        },
                        {
                            "author": "Eleusis713",
                            "body": ">Think about it: if everyone over 18 is suddenly getting $1000 a month from the government, what will food suppliers do? Raise prices. General goods suppliers? Raise prices. How about landlords? Raise prices.  \n>  \n>About 50% of the US rents. And guess what? It's the half that needs the UBI to begin with. If you think landlords won't just raise rent by $900, you haven't been paying attention.\n\nAreas of society like housing and rent are already dysfunctional and require their own solutions regardless of whether we implement UBI. Many UBI advocates acknowledge that UBI would likely have to be implemented in conjunction with a temporary nationwide rent freeze as an example. But it's not true to say that UBI would lead to inflation across the board as a rule.\n\nPrinting money is typically what would cause inflation and modern UBI proposals don't involve printing money. UBI is *redistributive* in nature. Generally, consumer price sensitivity and competition keep prices reasonable and stable. It's the same reason why prices don't increase when minimum wage goes up. People won't wake up one day and be perfectly fine with paying $8.00 more for a burger at a restaurant. Even if every restaurant raised their prices at the same time, it only takes one of them to not do that to absorb much of the business and outcompete their competition.\n\nAdditionally, increasing the buying power of the middle class through UBI would increase the velocity of money within the economy and have a *deflationary* effect. What this means is that money is moving to where it is useful faster rather than being stagnant and not moving. In the US economy, money velocity is the lowest it's ever been and has been continually trending downward for decades. This points to economically unhealthy *underconsumption*. This is a big problem given how 70% of the US economy is driven by consumer spending.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2022-11-21 15:48:22",
                            "replies": [
                                {
                                    "author": "boxsmith91",
                                    "body": "I'm glad someone brought up the \"competition\" angle. I didn't want to make my original post too long, but I'll address this here sure. Basically, you're coming at it from the Yang angle.\n\nTo your first point, a temporary nationwide rent freeze is probably less likely to be passed by congress than a UBI in the first place. And even if it did, it doesn't change the long term problem.\n\nThe key flaw in the \"competition\" idea is that, at least in the US, competition doesn't really exist anymore. Let's take housing for example. Despite the Fed's ever-increasing interest rates making buying a home less attractive, prices haven't moved much. Care to guess why? It's because, in areas where people actually want to live (this is key), the supply of housing is ridiculously small compared to the number of people who want to buy. Ironically, this is only fueled by the ever-increasing cost of rent due to landlord greed. Apartments are in a similar situation. Because of a combination of restrictive zoning, NIMBY-ism, and lack of materials, not much new housing is being built. Either apartments or single family homes.\n\nSo the whole idea that \"if UBI happens and landlords raise rent, there will be some that don't and this competition will drive prices down\" is fundamentally flawed. There simply aren't that many vacancies for it to make sense in attractive areas. It's hard to say \"fine, I'll just go elsewhere,\" when elsewhere doesn't exist. And it also assumes landlords don't just collude, which they totally do lol. A temporary rent freeze only kicks the can down the road. Eventually, landlords would just stop renting out apartments out of spite, or demand more rent under the table under penalty of being kicked out. Because most landlords are inherently shitty people.\n\nSame thing can be said with food suppliers. Most food companies have monopolies or near-monopolies because the government hasn't done any real trust busting in 40 years. Under UBI, some companies could raise prices 200% or 300% and you'd be forced to pay because nobody else supplies it anymore. I'm guessing these costs would find their way into fast food prices as well. And even if they didn't, who wants to eat at restaurants / fast food every meal?\n\nFinally, your whole point about redistribution and the velocity of money only makes sense if you're talking about taxing the rich. Which obviously should happen, but good luck with that. The middle class / poor are already spending money as quickly as they're getting it. Savings are at an all time low. Only the rich are hoarding their wealth and slowing down the velocity.\n\nI guess, kinda circling back to my original point, what I'm trying to say is that I don't think there's a way for free market capitalism to exist alongside a heavily automated society. The amount of controls necessary to ensure most of the population doesn't just die in a ditch would basically necessitate a socialist or even communist system. And if you think the rich are going to just willingly give up their way of life because it's the right thing to do, you're in for a rude awakening in a few decades.",
                                    "score": 6,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 16:22:55",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "reiffschneider",
                            "body": "The point is to move beyond capitalism and to a lesser extent dependent on currency, right? The point of automation is to live in a post-scarcity world where people are allowed to follow their own goals and projects and flourishing rather than toil themselves into an early grave",
                            "score": 28,
                            "depth": 2,
                            "timestamp": "2022-11-21 13:51:25",
                            "replies": [
                                {
                                    "author": "louisasnotes",
                                    "body": "Nope, like everything else in our World, the point of automation is to grow profits for Multi-nationals.",
                                    "score": 13,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 15:58:27",
                                    "replies": [
                                        {
                                            "author": "WH1TERAVENs",
                                            "body": "I like this comment chain. All comments have different opinions but are true to some extent. My addition is UBI or anything else that brings equality shouldn't be glorified or taken as dumb try to create a utopia. Just look at it objectively like the comments above.",
                                            "score": 5,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 17:48:04",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "RallyPointAlpha",
                                    "body": "Yeah and the internet was supposed to be a digital utopia and now it's a capitalistic hellscape....but I'm sure the same dudes who did this to the internet will use AI and automation to build a utopia this time for sure!",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 20:22:09",
                                    "replies": []
                                },
                                {
                                    "author": "DrTwitch",
                                    "body": "Everyone wants to talk about the point, but thats just the public talking points. The people implementing automation have no interest in you doing art. It's all relative.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 16:23:02",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Southern-Trip-1102",
                            "body": "All roads lead to socialism.",
                            "score": 10,
                            "depth": 2,
                            "timestamp": "2022-11-21 13:52:56",
                            "replies": [
                                {
                                    "author": "julianwelton",
                                    "body": "You'd hope but what's more likely to happen is a The Expanse scenario (The 1% are rich while everyone else is either working in extremely dangerous conditions, waiting on a lottery for jobs, in the military, or homeless). Now you may be thinking \"that doesn't sound too far off from what we have now\" and you'd be right, we're well on our way!\n\nThe other option is probably something like The Road. So pick your poison, I guess.",
                                    "score": 12,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 14:51:29",
                                    "replies": [
                                        {
                                            "author": "rainpizza",
                                            "body": "The problem that the dude \"Southern-Trip\" is not addressing is the fact that socialism is basically like a plutocracy but by the gov't.\n\nThey both lead to a concentration of wealth and power while siphoning the little wealth and power that the lower classes have.\n\nA truly Orwellian dystopia.",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 19:47:53",
                                            "replies": []
                                        },
                                        {
                                            "author": "Southern-Trip-1102",
                                            "body": "That would be the case if capitlaism didn't self destruct economically even without a revolt.\n\nhttps://youtu.be/SEGGvVinUao",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 14:54:11",
                                            "replies": [
                                                {
                                                    "author": "julianwelton",
                                                    "body": "Yes, but how many lifetimes will that self destruction take? I'm relatively young and I highly doubt I'll see the end of capitalism before I die. We didn't even get to the bandaid stage yet where they implement half measures to appease and control people, which will certainly buy them years and years to continue to hang on to their grotesque wealth and power. \n\nI also just don't really believe that when capitalism does finally collapse, however and whenever it does, that humans will suddenly decide to do the right thing. Really Capitalism only exists because people want it to. A (very) large portion of the population will do **anything** as long as it benefits them, as long as they have more. \n\nTl;dr Star Trek was a lie lol!",
                                                    "score": 6,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 15:16:43",
                                                    "replies": [
                                                        {
                                                            "author": "Southern-Trip-1102",
                                                            "body": "We are already in the band-aid stage. Welfare is a litteral band aid. The 1950s was the peak now they are cannibalizing the system which keeps them in power.\n\nIt's not that humans are suddenly going to do the right thing, but rather that socliasm will be in their self interest. Something that people get wrong about Marxism is that it's based on altruism n stuff. While reality couldn't be any more different. An axiom of Marxism and classical economics is that people are primarily selfish and interested in their own material outcome. That is what will bring socialism, not altruism but self interest.\n\nAlso, due to the falling rate of profit, only groups/nations of humans who use socialism will have economic growth, which would force or inspire others to do the same.",
                                                            "score": 6,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 15:21:53",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "nosoanon",
                                                    "body": "capitalism has enriched the poor more than socialism ever has because the market gives incentive to produce\n\nit just enriches the rich exponentially more\n\nand displaces millions of unlucky and poorly adjusted people\n\n&#x200B;\n\ngood luck trying to emulate the prosperity created by the market by a government bean counter, we all see how well they manage our money now",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 17:17:23",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Artanthos",
                                    "body": "Or a plutocracy with 90% living in a dystopia.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 14:27:00",
                                    "replies": [
                                        {
                                            "author": "Direct-Effective2694",
                                            "body": "The capitalists had better hope they do better than that or they’re not going to be around for long. The only thing keeping this shit running is all the little treats we get here in the first world. \n\nIf those treats like home ownership and cheap luxury goods start to go away then things will start to get interesting.",
                                            "score": 5,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 14:57:08",
                                            "replies": []
                                        },
                                        {
                                            "author": "unculturedburnttoast",
                                            "body": "Plutocracy, and other forms of authoritarianism, always have an Achilles heel, often that they believe they deserve to be on top and are wildly incompetent, and the constant oppression creates revolutionary forces.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 17:39:36",
                                            "replies": [
                                                {
                                                    "author": "Artanthos",
                                                    "body": "Historically, those revolutionaries have not faced modern weapons.\n\nModern weapons don’t really care about large numbers of unarmed people.\n\nSoon to be weapons, autonomous and ever vigilant, will care even less.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-22 14:54:13",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Southern-Trip-1102",
                                            "body": "One would think but capitlaism has multiple self destructing phenomena. Search up the falling rate of profit on YouTube, it may bring you hope.\n\nhttps://youtu.be/SEGGvVinUao",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 14:30:02",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "rainpizza",
                                    "body": "As long as wealth and power doesn't concentrate in a few hands(as we have seen multiple times in socialism and capitalism alike), I am okay with a change.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 19:04:32",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "raybanshee",
                            "body": "Well said. Every member of the antiwork subreddit should be made to read this.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2022-11-21 13:45:30",
                            "replies": [
                                {
                                    "author": "ionstorm20",
                                    "body": "I think you need to read the antiwork subreddit. I'd be willing to bet 99% of them ***want*** the massive changes boxsmith said were needed.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 14:38:43",
                                    "replies": [
                                        {
                                            "author": "raybanshee",
                                            "body": "Ok yes, I agree that the 'tear it all down' sentiment is strong over there, however there is an appalling lack of understanding of principles of supply and demand. I guarantee you that if you ran a poll, 90% of the subscribers of antiwork would agree that $50/hr minimum wage would solve the countries problems.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 15:12:07",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "getdafuq",
                            "body": "Even if the prices go up, being able to afford *something* is vastly preferable to being able to afford *nothing.*",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-21 22:54:16",
                            "replies": []
                        },
                        {
                            "author": "fhsoownfjff",
                            "body": "Food prices won't increase. If they do, people with capital start food businesses to reap profits due to prices being artificially inflated. And competition will drive prices down. Housing is one thing because city land is limited and valuable. But food and general goods? Not gonna happen from ubi.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-22 02:05:14",
                            "replies": []
                        },
                        {
                            "author": "Ark-kun",
                            "body": "Why is it $1000 and not say 0.1% of total property/wealth divided by the number of people in the country?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-22 02:07:16",
                            "replies": [
                                {
                                    "author": "boxsmith91",
                                    "body": "1000 is what Andrew yang campaigned on during his 2020 run. The number doesn't really matter, it was just an example.\n\nThe same result would happen regardless of the amount.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-22 02:18:21",
                                    "replies": [
                                        {
                                            "author": "Ark-kun",
                                            "body": ">The same result would happen regardless of the amount.\n\nI do not think so. Please prove that UBI proportional to total citizen wealth is equivalent to fixed sum UBI. This seems to be a really wild claim.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2022-11-22 02:24:00",
                                            "replies": [
                                                {
                                                    "author": "boxsmith91",
                                                    "body": "Did you not read my post? The number is irrelevant because landlords and other businesses would just raise prices to meet that new consumer income. Thus, the poor and middle class have gained no ground, and we all experience massive inflation. \n\nCompetition does not really exist in attractive areas to live in for the housing market because there are so few homes / apartments available compared to the number of those seeking them, and more cannot easily be built due to various factors.\n\nWith food and consumer goods, many companies are monopolies or nearly monopolies. They can raise prices because they're already eliminated the competition, and the government hasn't trust busted in decades. It is theoretically possible to disrupt these industries, but you'd need massive capital to get off the ground and that assumes they won't use underhanded tactics to drive you out of business. There's a reason most small businesses fail nowadays.\n\nUltimately, wealth inequality isn't something that can be fixed by printing more money, unless the government is willing to set hard caps on the prices of pretty much everything. Capitalism can't really work in a world where most of the world is automated and regular people have no means of earning a living. UBI is a pipedream of a bandaid that just tries to kick the can down the road instead of facing this ultimate truth.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-22 02:36:46",
                                                    "replies": [
                                                        {
                                                            "author": "Ark-kun",
                                                            "body": "I'm not sure you've read what I wrote.\n\nIn short, inflation-independent numbers are not affected by inflation.\n\n1% of all houses always costs 1% of all houses no matter how much the houses cost in absolute numbers.\n\nAs the pandemic has shown, many expensive areas are expensive not because people like the area, but because companies require people to live in certain locations. Remote work and UBI alleviate this issue. The rents in most major cities went down during pandemic.\n\nMy proposal of wealth-based taxation solves many of the issues we're currently facing. \n\n>can be fixed by printing more money \n\nI never said anything about printing money. This seems to be a strawman argument. In fact I explicitly told you where the money will come from.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-22 23:36:55",
                                                            "replies": [
                                                                {
                                                                    "author": "boxsmith91",
                                                                    "body": "If you don't print money, where does it come from then?\n\nAll you've talked about is \".1% of total property / wealth\". Are you suggesting taxing the wealthy? I mean, that's not even a UBI position lol. And good luck with that.\n\nIt's impossible. Swiss bank accounts. Offshore accounts. Cayman island accounts. There are all sorts of creative ways to hide your money that make it very difficult for the government to determine your total wealth. Including property in the calculation would help, but so much of the ulta-wealthy's wealth is tied up in stocks that it wouldn't amount to much.\n\nIt's VERY tricky to tax stock wealth. That's why only dividends are taxed, and not the entire value of your portfolio. If they tried to tax based on total portfolio value, people would just manipulate the share price at the time of assessment to pay as little as possible. Unless you were to take the average share value across the entire year, but we're really getting into the weeds here.\n\nAnd even IF you accomplish all of this and implement a UBI from the taxed wealth, my original point stands. Landlords and certain essential goods suppliers will just raise the rent to match the increased income, and the middle class / poor effectively have the same amount of income they started with. All you've done is make the landlords and corporate monopolies richer and siphoned some wealth away from investment bankers and CEOs not in those industries profiting from charging people more for what they need to live.\n\nIf your goal is to actually redistribute wealth, you need to cap the prices of key goods (like food) and rent.\n\nEDIT: Thought more about it. I suppose you're more talking about totally unemployed people living off of UBI, so they can move wherever. UBI would have to be a pretty significant portion of total wealth to pull that off. \n\nAnd sure, in theory, moving to less desirable areas where there are more open houses / apartments available would foster competition and help keep landlords from just charging the absolute maximum, but there's a reason beyond work that most people don't live too far outside of major cities.\n\nMost people don't wanna move away from their friends and family. As someone who did that for 4 years to further their career, it's fucking miserable. I've turned down offers 20, 30K more than what I'm making now, because I don't want to have to relocate to another state again.\n\nI'd much rather see a future where the government stepped in and converted a lot of unused urban space into high density free housing than a future where we have our current shitty systems, but only half the population works and the half that doesn't is forced to move out to bumblefuck nowhere because rent is too expensive in places people want to live.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-11-23 00:35:44",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ark-kun",
                                                                            "body": ">If you don't print money, where does it come from then?\n\nAll welfare usually comes from taxes.\nTaxes depend on inflation. If everything goes up 10x, then taxes roughly go up 10x. It's possible to make UBI inflation-adjusted. Most welfare for the lower class does not lead to rampant inflation (unlike, say corporate handouts).\nI've proposed one potential scheme (0.1% wealth tax), but other schemes can be used.\n\nP.S. The number 0.1% is likely too low. I think that the total wealth tax that's used for everything (not just UBI should be ~1% with UBI funded by a certain share of that. \n\nOh, and I forgot to say that in my opinion the UBI should replace most welfare and the wealth tax should replace almost all other taxes. \n\n>All you've talked about is \".1% of total property / wealth\".\n>Are you suggesting taxing the wealthy?\n\nI'm suggesting taxing everyone. Every year the state takes 0.1% of what everyone has and evenly redistributes the total amount among everyone.\n\nIf all people have same wealth, the net flow is 0. When wealth inequality exists, it's slowly redistributed towards equal wealth.\n\n>It's VERY tricky to tax stock wealth.\nThe current stock taxes are much more compkex. \n>Unless you were to take the average share value across the entire year \n\nAlmost, but not exactly: In short, every day the bank/broker needs to record the total value of the stock the person owns (they can buy/sell stock) and average this over the year. This information is really easy to get for the brokers. Averaging somewhat simulates paying stock tax daily.\n\n>only dividends are taxed \n\nI think this is not a correct way to tax the stock. And the rich people know that. Lots of stocks do not pay dividends. Rich people pay 0 taxes for them. They do not sell the stock eithef. They borrow against that stock using it's value as collateral. Let's tax that money-making value.\nI also think that income tax is likely incorrect way of taxation which enables exponential accumulation of wealth. Wealth tax prevents that. \n\n>Landlords and certain essential goods suppliers will just raise the rent to match the increased income \n\nThe absolute prices do not matter. Think about this as follows: The landlords pay 0.1% of their real estate which is redistributed between all people including the renters. There are no dollars here. Just fractions of a house. House that brings in 2x rent costs 2x as much and is taxed 2x as much increasing the landlord-derived share of the UBI pool 2x. Things remain the same. \n\n>need to cap the prices of key goods \n\nI do not think capoing prices is a good idea.\n\n>totally unemployed people living off of UBI \n\nI think that UBI needs to be livable.\nThere is a spectrum of unemployment there... People might be learning new skilks for work, preparing to start a business, writing a novel etc.\n\n>Most people don't wanna move away from their friends and family. \n\nI understand this. And I think that UBI and acceptance of remote work can make this better. Imagine not needing to choose between staying with your friends and family and being able to make liveable wages. I hope that UBI will bring us much closer to this. \n\n>only half the population works and the half that doesn't is forced to move out to bumblefuck nowhere because rent is too expensive in places people want to live \n\nWith the current system everyone has to work (no time for health, education, skills), but still need to live in bumblefucks.\n\n>converted a lot of unused urban space into high density free housing \n\nThis can be a good idea as well. Although those places would probably be not the nicest ones.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-11-23 02:56:02",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Southern-Trip-1102",
                    "body": "If history is any measure, they aren't going to implement a UBI. The rulling classes of times past always had a chance to prevent revolt, they failed.",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2022-11-21 11:51:09",
                    "replies": [
                        {
                            "author": "Artanthos",
                            "body": "The ruling classes of the past didn’t have automatic weapons.\n\nOr autonomous robots armed with those weapons.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2022-11-21 14:28:19",
                            "replies": [
                                {
                                    "author": "Southern-Trip-1102",
                                    "body": "True however the same technology that allows a single person to control an entire army is the same technology that involves AGI, at which point we have bigger problems.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 14:31:37",
                                    "replies": [
                                        {
                                            "author": "Artanthos",
                                            "body": "You don’t need AGI to have autonomous systems.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 14:35:14",
                                            "replies": [
                                                {
                                                    "author": "Southern-Trip-1102",
                                                    "body": "An army is an extreamly complex system, you need maintenance, logistics, etc. You need agi to manage all that without people managing it who could revolt themselves. Anyways this is a pointless discussion because capitlsism would self destruct even if there was no revolt, search up the falling rate of profit on YouTube.",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 14:37:38",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "The ruling class would likely be socialist among themselves. What incentive would they have to be capitalistic when they have basically created a post scarcity society for themselves.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 15:29:02",
                                                            "replies": [
                                                                {
                                                                    "author": "Southern-Trip-1102",
                                                                    "body": "It's not exactly correct to call what the ruling class have for themselves to be socialism.\n\nCapitalists rely on captilaism for their income, when it falls so do they and it will they. https://youtu.be/SEGGvVinUao",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-11-21 15:32:38",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Deleted",
                                                                            "body": "I’m saying capitalism as a system won’t exist in the future if we have true post scarcity. There won’t really be “money” because there’s no need for such a concept.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-11-21 15:41:37",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Southern-Trip-1102",
                                                                                    "body": "Correct. I'm just saying that capitalism will fall far before post scarcity.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-11-21 15:43:22",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Artanthos",
                                                                                    "body": "Money is a proxy.\n\nTrue wealth is knowledge, resources, and the means of production.\n\nThe truly wealth will be invested in, or own, one or more of the above.\n\nBut unless you have all of the above, and to a degree that you have access to anything and everything, you will still use money as a proxy.\n\nNobody is going to try to buy food with raw lithium or pay for knowledge with fresh produce.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-11-22 15:14:11",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Artanthos",
                                                                            "body": "That only works in a society based on labor provided by the lower classes.\n\nIn an autonomous society, no laborers are required to mine the mines, grow the food, produce the energy, or manufacture the goods.\n\nCapitalism, in some form, would still exist. The person who owns the lithium mine, likely won’t own the means of food production or the factories. But most of today’s laborers won’t be part of that economy.\n\nThere will still be a small middle class. A few tasks that need minimal human supervision. Creatives that have unique ideas or forms of expression. Those that work in roles where the wealthy prefer humans (e.g waiters). Government.\n\nOverall, in this type of society, capitalism would be much more limited in scope and only really exist for the upper segments of society and those in their proximity.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-11-22 15:07:05",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Southern-Trip-1102",
                                                                                    "body": "Capitalism can not exist with that level of automation. The mechanism by which caps get profit evaporates are a certain level of automation as described in the falling rate of profit. It can not progress past that level of automation without collapsing.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-11-22 15:29:49",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Artanthos",
                                                                                            "body": "It cannot exist without change.\n\nCollapse is only one form of change, and a form that will be actively resisted.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-11-23 10:36:00",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HourWorking2839",
                    "body": "*incoherent mumbling about 'first mover advantage' and a shoulder shrug*",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2022-11-21 10:47:10",
                    "replies": []
                },
                {
                    "author": "TheOneAllFear",
                    "body": "Your conclusion is not true. It will take time but low skilled jobs of that kind will dissapear. One example, elevator stuards, they existed and now are no more, it's not like people today do not have jobs because that job dissapeared. \n\nOne other example you can see is in the education, before getting a college degree 50-60 years ago and you would get any job you want, now university or masters. As time goes on the education improves and so people are trained for higher skill jobs.\n\nOfc there might be an argument about the fact that automation speeds this up too much and this 'natural' transition that happened before is slow and cannot keep up. Also it is true not everyone can be a rocket scientist and they do need help from the society for them to be an active member.\n\nAlso all that being said i am for an universal basic income however i don't want it to be introduced for people to survive i want it for people to enjoy life. Because in the first version that ammount will be too little to count and that people that need it the most are considered lazy(an argument used by oponents of this) instead of actually helping them.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2022-11-21 15:53:45",
                    "replies": []
                },
                {
                    "author": "Kimorin",
                    "body": ">There is supposedly a labor shortage. It’s awfully difficult to reconcile a supposed labor shortage with increases in automation with folks bitching about losing jobs to immigration.\n\nnot really... there is a labor shortage BECAUSE automation is driving cost of production down. automation is getting to be cheaper than what business pay for workers and workers don't want to work for less money so business can't find people to work... \n\nalso this doesn't even take into account of skilled workers which may actually be having a shortage due to retirement and other factors.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2022-11-21 11:23:16",
                    "replies": [
                        {
                            "author": "r33c3d",
                            "body": "Companies would probably be smart to train their displaced workers with skills they can apply to things automation can’t solve. Otherwise, doesn’t the problem just exacerbate itself?",
                            "score": 7,
                            "depth": 2,
                            "timestamp": "2022-11-21 11:26:59",
                            "replies": [
                                {
                                    "author": "Kimorin",
                                    "body": "i would be smart.... but it's a long term benefit with short term expenses... businesses usually are not that forward looking.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 11:30:36",
                                    "replies": [
                                        {
                                            "author": "r33c3d",
                                            "body": "I remember reading that most advanced assembly line work (which is what we need) requires employees to know how to do things like multiply fractions in their heads. And yet most Americans have no idea how to do this. So maybe our educational system is so bad that we can’t avoid automation!",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 11:34:29",
                                            "replies": [
                                                {
                                                    "author": "Kimorin",
                                                    "body": "i mean... assembly line work SHOULD be automated... it's a lot of repetition, does anyone actually enjoy doing assembly line work? there are so many questions regarding the future of our economy and our careers it's hard to say how it would go. But in an ideal scenario, everyone would be doing something that they enjoy, instead of doing something a robot can do just because they have to.",
                                                    "score": 6,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 11:37:47",
                                                    "replies": [
                                                        {
                                                            "author": "ASaltyBiscuit",
                                                            "body": "You can make north of $20/hr doing a simple production line job. It's ten hours days of placing a lid on a product as it goes by, or scanning the product as it goes by. Mind-numbing work that has no sense of purpose, especially as the company doesnt sell anything new or even of good quality.\n\nAutomation is an inherently good thing, we just need to figure out how to transfer the benefits of automation to the people when corporations are the ones who have the incentive to pursue it.\n\nHigher taxes on corporations would be a start. If you implement a UBI and tax unskilled labor highly you would fix the problem but be left with a super large wealth gap between the unemployed unskilled worker and any kind of skilled labor. This would appear worse but the general quality of life would be better (same standard of living, just way less work). It would be tough for a society because unskilled workers would have to watch skilled laborers enjoy the lions share of benefits from the growth of the economy.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 13:32:24",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "OrangeJr36",
                                    "body": "Workers and voters themselves vote against such plans constantly. Job retraining is *extremely* unpopular among people who lose their jobs to automation and economic shifts. Suggesting such policies is what caused a massive shift against Gore, Obama and Clinton in their elections in Ohio, West Virginia, Kentucky and Indiana. \n\nThese organizations and their workers don't want to retraining, they want to keep the status quo, even if it leads them to ruin. They see any suggestion of learning something else as a direct threat to their employment.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 12:19:00",
                                    "replies": [
                                        {
                                            "author": "r33c3d",
                                            "body": "Yeah. I used to work as a union librarian. There were coworkers that refused to use a computer and continued to write out their work for other people to input — 30 years after computers were adopted by the library. And the union allowed this to happen under the guise of “discrimination.” Yikes.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 13:22:55",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Artanthos",
                                    "body": "Some companies do.\n\nGranted, they are the exception and it can be difficult to get hired there.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 14:30:12",
                                    "replies": []
                                },
                                {
                                    "author": "scurvofpcp",
                                    "body": "It is hard to say this without being controversial but many people end up in service jobs because that is all they can handle, due to either emotional or intellectual issues. \n\nAnd while there is going to be a huge portion of people in those service jobs who are able to do far more with a little training/medication/therapy, there is still going to be those who are going to fail to thrive even without help.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 14:40:30",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "raybanshee",
                    "body": "Andrew Yang knows what's up.",
                    "score": -2,
                    "depth": 1,
                    "timestamp": "2022-11-21 13:44:16",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "One more important factor would be countries which are democratic and which aren't. In a democracy politicians would ultimately have to rely on votes from the majority (which would be lower income) thus more likely it is that resources are distributed. On the other hand, people in authoritarian regimes are likely to suffer from automation.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-11-22 08:54:39",
                    "replies": []
                }
            ]
        },
        {
            "author": "babyyodaisamazing98",
            "body": "That’s just simple supply and demand. If you can pay a one time fee to have a robot do the job 24/7 for 10 years then the demand for a human to do that job essentially drops to 0. No one is going to want to pay the $60000-$80,000 a year for the fully burdened cost of an employee who isn’t any better at the job then a robot. \n\nUltimately governments will have to provide a basic income to people or face revolt. There will be a lot of pain and suffering along the way though.",
            "score": 45,
            "depth": 0,
            "timestamp": "2022-11-21 08:05:19",
            "replies": [
                {
                    "author": "wildeye-eleven",
                    "body": "Exactly, You’ve already said what I came to say 👌",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2022-11-21 10:52:20",
                    "replies": []
                },
                {
                    "author": "Southern-Trip-1102",
                    "body": "If history is any measure, they aren't going to implement a UBI. The rulling classes of times past always had a chance to prevent revolt, they failed.",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2022-11-21 11:51:32",
                    "replies": []
                },
                {
                    "author": "rhobotics",
                    "body": "Who’s going to pay for the UBI?",
                    "score": -4,
                    "depth": 1,
                    "timestamp": "2022-11-21 10:01:09",
                    "replies": [
                        {
                            "author": "pop013",
                            "body": "Those who put people out of job?",
                            "score": 14,
                            "depth": 2,
                            "timestamp": "2022-11-21 10:29:42",
                            "replies": [
                                {
                                    "author": "rhobotics",
                                    "body": "Yeah, but won’t this exacerbate the situation?\nWhat I mean is, big, established companies won’t probably have a problem since they have been operating for decades.\n\nWhat about new automation companies that are starting right now, that are actually employing people? \n\nHow are they going to manage to survive among these big corporations that are automating more and more?\n\nSome other redditor said that UBI could actually be taken out of the sale tax. But nothing comes from nothing right?\n\nIs the gov going to increase the sale tax? And because less people have less work, won’t that mean that less people will have more money to pay the surplus tax? Companies have a way to pass the increase in prices to consumers.\n\nWon’t this UBI accelerate the decline in job losses?",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 10:39:08",
                                    "replies": [
                                        {
                                            "author": "pop013",
                                            "body": "Thats why i put \"?\"i dont have a clue, my opinion is that automation will peak at some point and than fall back to some\" normal number\" because you dont want a lot of people without job ie money to spend.\n\n\nLets say:\n\n\nIf You have 1 million $, you wont spend most of it. But 10k of us have 10k $, most of us will spend most of it... See where i aim? \n\n\nSorry if i sound unclear, English aint my native",
                                            "score": 4,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 10:53:38",
                                            "replies": [
                                                {
                                                    "author": "rhobotics",
                                                    "body": "Interesting point of view!\n\nThe notion that agressive automation will eventually peak and fall back down since people will need jobs to spend money.\n\nThey way I see it is, the more automation, the more maintenance. Meaning the more people repairing stuff, designing stuff, etc.\n\nOne thing to take into consideration that I think we haven’t spoken off is the notion of replacing machines with better machines!\n\nYes, if a human costs you, let say 100 000 credits a year, and a “robot” costs you had of that, well, for any company, this is a no brainer right?\n\nBut, what happens when a new company makes a “robot” that now costs 25k credits and is faster and consumes less energy?\n\nDo you see where this is going? Like you said, like a bell shaped curve.\n\nThis is why, with the info that I’ve gathered thus far, I don’t think UBI should be paid by the companies. \n\nInstead! Give more government or private capital to encourage new companies that will change the status quo and create new jobs for the creation of faster, energy lean and cheaper “robots”!",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 11:18:23",
                                                    "replies": [
                                                        {
                                                            "author": "johnp299",
                                                            "body": "Faster and more efficient robots will plateau at some point, and probably fairly quickly. What then?",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 12:12:25",
                                                            "replies": [
                                                                {
                                                                    "author": "rhobotics",
                                                                    "body": "What then?\n\nThat, I have not yet thought about it!\n\nInteresting question!\n\nI hope some one can give it a try.",
                                                                    "score": 3,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-11-21 12:19:27",
                                                                    "replies": [
                                                                        {
                                                                            "author": "pop013",
                                                                            "body": "Throwing around ideas, someone will get it right :-)",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-11-22 00:38:58",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "rhobotics",
                                                                                    "body": "I hope so!\n\nThis is a very crucial problem to solve!\n\nMaybe it will be solved by itself or not, it’s still worth looking into it.",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-11-22 09:37:10",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "pop013",
                                                            "body": "Oh i see, now i get you. \n\nYeah, people should consider maintenance jobs in this kind of arguments, or making better robots. Where i work, maintenance  of just some part of automated proces is lot of human work... \n\n\n And how you put it,  it seems more logical for government to find solution. \n\nWe have social care system in Serbia, its not much but itnkinda works. It would work great if we werent corrupted as fck. UBI sounds like extreme social help...ok now I'm blablaing too much. \n\nTnx for showing perspectives i didnt see.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 11:34:24",
                                                            "replies": [
                                                                {
                                                                    "author": "rhobotics",
                                                                    "body": "Hey thank you!\n\nMaintenance is very very important in any industry.\n\nBut we’ll also need engineers of all kinds!\n\nOne might say that, oh, in the future, or very near future, we’ll get humanoid robots with super intelligence and robots will maintain robots and so on…\n\nHmmm, yes and no.\n\nThe more the machine is sophisticated, the more it would tend to cost and to maintain.\n\nTake for example, GITS, ghost in the shell (please forget GITS 2045 T.T )\n\nIn that timeline, you have cyborgs! Yes fricking cyborgs!\n\nBut… it’s not for free. It’s very expensive to maintain. So much that, the main protagonist, Motoko Kusanagi and some others they need to work at a highly elite secret police enforcement department to keep their prosthetics maintained.\n\nSo yeah, uwu, we’ll have humanoid robots and more sophisticated machines that, hey maybe it won’t be so expensive to hire a person for a certain particular job!",
                                                                    "score": 3,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-11-21 11:43:00",
                                                                    "replies": [
                                                                        {
                                                                            "author": "pop013",
                                                                            "body": "And certain jobs need noskill assistants to help main engineer.... Like circle of life hehe\nGreat talk man, tnx, just needed one.",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-11-21 11:46:18",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "rixtil41",
                                                                            "body": "I disagree. We have other humans that can maintain other so why is it so impossible for it to apply to robot or AI. What makes us so special?",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-11-21 15:32:33",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "rhobotics",
                                                                                    "body": "For starters, let’s talk technically. It’s much easier and cost less to make a human than to make a humanoid robot.\n\nYes, Honda worked on Asimov and now Tesla is working on its own implementation, but for now, human labour is cheaper than full fledged humanoid robots.\n\nSecond, awareness. Humans have a sens of awareness that no machine has today. Again, this will change in the incoming years and it might even cost less to rent that type of artificial awareness Than to employ a human.\n\nBut the first point is still valid. Electro mechanical parts deteriorate and/or break over time, compared to software that it doesn’t break if you don’t touch it.\n\nSo, it’s not yet clear to me how all of this is going to pan out. But I think, and I might be wrong, sophisticated anthropomorphic machines might be costly in both acquisition and maintenance.\n\nSo it begs the question, why do we bother with humanoid robots if at some point they might cost not as much as human labor but more than what we thought it was going to cost.\n\nJust think of cars! Yes, electric ones might have less maintenance than combustion one, but they still degrade and still need to be inspected for safety.\n\nI think, now, we might be having humanoid robots akin to a Ford model T. So we’re not that close to an equivalent robot of an electric car.",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-11-21 16:16:04",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "rixtil41",
                                                                                            "body": "Let's comeback in 2039 and see just how wrong or right you are.",
                                                                                            "score": 2,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-11-21 16:19:01",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "rhobotics",
                                                                                                    "body": "I would say 2030. A lot is going to change in less than a decade!",
                                                                                                    "score": 2,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2022-11-21 16:24:24",
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "rixtil41",
                                                                    "body": "Also stopping automation or progress just so you could keep a job is backwards.",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-11-21 15:59:20",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "babyyodaisamazing98",
                            "body": "Corporate taxes used to be 90%, they are currently almost 0. There were a lot more small businesses back then too. You could easily increase taxes on profits to pay for this. \n\nEasily as in companies could do it without going under. However there will be significant blood shed before they actually allow it to happen.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2022-11-21 11:37:17",
                            "replies": [
                                {
                                    "author": "rhobotics",
                                    "body": "I personally think, the increase in tax is just going to be passed to the consumer, which will make things worse.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 12:13:34",
                                    "replies": [
                                        {
                                            "author": "BRAND-X12",
                                            "body": "We just need a progressive corporate tax so that large companies who do that to continue growing are at a disadvantage to smaller companies that don’t need to. \n\nIt blows my mind entirely that the corporate tax is flat.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 15:21:11",
                                            "replies": [
                                                {
                                                    "author": "rhobotics",
                                                    "body": "Then again, a corporate tax is a gouvernement thing, some might agree some won’t. \n\nSo it’s not something that we can rely on in order to solve the automation problem that displaces people.\n\nI think, something else needs to happen other than UBI.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-22 09:40:52",
                                                    "replies": [
                                                        {
                                                            "author": "BRAND-X12",
                                                            "body": "UBI is a government thing. Anything we pass *with* UBI is a government thing. Nearly 100% of fixes for the after effects of automation is a government thing. \n\nWe can’t let the fact that laws can be repealed stop us from passing legislation. We’ve seen how resilient *truly* popular legislation is, like SS; if we pass something that really helps then repealing it will be political suicide. \n\nThat being said, idk how you’re going to fund anything without increasing progressive taxation in almost every corner. **Flat** taxes will make things worse, **progressive** taxes will push revenue to the bottom of the income scale.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-22 10:10:31",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "gusty_state",
                                    "body": "Globalization and computers made it a lot easier to offshore stuff. Nowadays they'd just say that they're headquartered overseas. But yes, corporate taxes are too low. I'd love to see them tax businesses and provide universal healthcare with a private option (Australian style). Decouples healthcare from direct employment and ensures a healthier workforce.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 15:23:30",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nomorerainpls",
                    "body": "Why would you assume that sort of outcome when it requires that the majority of the population possesses only a bare minimum of skills and is unable to acquire new ones?",
                    "score": -3,
                    "depth": 1,
                    "timestamp": "2022-11-21 08:21:41",
                    "replies": [
                        {
                            "author": "MrGraveyards",
                            "body": "It doesn't matter what skills you have if nobody needs those skills. Not everyone is going to be an engineer of some sort. I was doing a very simple IT job for years and everyone I know that is not in IT looks at me like some sort of next level genius. Very nice that somebody who waits tables (automateable) is also able to make tables (automateable, or already automated), that doesn't mean they'll have a job.\n\nI don't really know where this is going, but one of the logical outcomes is a large swath of people that is simply not employed. And maybe, if a country is rich enough, that can be ok, this can be provided from taxes. Don't people remember primary school? Those kids who couldn't write a single normal sentence, had only bad grades in match? Yeah, they still can't do that when they are thirty. In they have to engineer? Yeah, don't think so.",
                            "score": 8,
                            "depth": 2,
                            "timestamp": "2022-11-21 08:51:30",
                            "replies": [
                                {
                                    "author": "nomorerainpls",
                                    "body": "Oh this is one of those “machines are gonna take all our jobs” comments. \n\nYears ago there was this guy who went from house to house delivering blocks of ice from his horse-drawn carriage. Then came along this thing called a freezer robbed him of his livelihood. Then cars came along and put his horse out of a job. He ended up eating the horse. That’s my story about capitalism. Good story, huh?",
                                    "score": -3,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 09:33:55",
                                    "replies": [
                                        {
                                            "author": "MrGraveyards",
                                            "body": "I'm not saying I have all the solutions. Either the poor and dumb eat each other or the people who automate will have to bend together and come up with something to keep them at a reasonable living standard. I mean you can decide any.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 09:40:34",
                                            "replies": []
                                        },
                                        {
                                            "author": "savedposts456",
                                            "body": "Machines absolutely will take all our jobs. It’s only a matter of time. Tesla is working on a humanoid robot that will replace a huge portion of unskilled labor in developed countries within the next few decades. This will be a huge disruption. It’s not like in the past where technology allowed humans to be more productive - humans will be replaced entirely (when it comes to low skill labor).",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 12:16:15",
                                            "replies": [
                                                {
                                                    "author": "nomorerainpls",
                                                    "body": "“machines will take our jobs and believe me - this time will be different from lift and switchboard operators, pin boys and gas pump attendants! Bring back human computers!”",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 12:58:06",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gari_305",
            "body": "from the Article\n\n>“If you introduce self-checkout kiosks, it’s not going to change productivity all that much,” says MIT economist Daron Acemoglu. However, in terms of lost wages for employees, he adds, “It’s going to have fairly large distributional effects, especially for low-skill service workers. It’s a labor-shifting device, rather than a productivity-increasing device.”  \n>  \n>A newly published study co-authored by Acemoglu quantifies the extent to which automation has contributed to income inequality in the U.S., simply by replacing workers with technology — whether self-checkout machines, call-center systems, assembly-line technology, or other devices. Over the last four decades, the income gap between more- and less-educated workers has grown significantly; the study finds that automation accounts for more than half of that increase.",
            "score": 27,
            "depth": 0,
            "timestamp": "2022-11-21 07:23:47",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "\"New data suggest most of the growth in the wage gap since 1980 comes from automation displacing less-educated workers.\"\n\nAutomation is not the primary, secondary, or even tertiary problem. Companies being greedy and cutting costs *wherever* possible are driving inequality. \n\n[CEO to average worker pay ratio](https://www.epi.org/publication/ceo-pay-in-2020/) are currently at an all time high. This has gotten much worse over the past decades. Corporations are firing loads of people, [raising their prices (driving inflation and more inequality)](https://oversight.house.gov/news/press-releases/subcommittee-analysis-reveals-excessive-corporate-price-hikes-have-hurt#:~:text=Studies%20by%20the%20Economic%20Policy,continue%20to%20contribute%20markedly%20today), and many of them are seeing more profits than ever. Not to mention, there's a [huge labor shortage](https://www.uschamber.com/workforce/understanding-americas-labor-shortage-the-most-impacted-industries) right now.",
            "score": 21,
            "depth": 0,
            "timestamp": "2022-11-21 10:29:06",
            "replies": [
                {
                    "author": "scurvofpcp",
                    "body": "I would say it is a mix of both. \n\nThe companies that can automate are able to produce an employment market that benefits them the most. \n\nAnd on the flip side of that, one of the largest dangers of unskilled work is that it tends to require long hours and is draining enough, and time demanding enough,  that the people stuck in those positions  are unable to do things such as education, side hustles and the like.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2022-11-21 14:46:37",
                    "replies": [
                        {
                            "author": "glyptometa",
                            "body": "Have to add consumption as well. Consumers drive the system to perhaps the greatest extent. They want and buy low cost items and services. Demand for lower prices drives companies to seek lower cost manufacturing and service provision, which also drives automation, to meet price demands and/or to drive higher volume.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-21 17:48:41",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Trygolds",
            "body": "Production and manufacturing goes up while jobs go down yet the wealthy still want labor to pay for social services and social security. We  have to stop relying on labor and sales taxes as the source of income for government services from roads to housing to social programs. We keep being told by the wealthy that own the media there is a problem with not enough young people to pay for the old people yet production continues to raise. We produce enough wealth to more than care for our elders and our poor just stop relying on the workers and the poor to pay for it all.",
            "score": 9,
            "depth": 0,
            "timestamp": "2022-11-21 09:15:36",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Yeah they act like when companies automate they are going to give us that money to not work…. Um no we will all live in a fucking tent city while the rich eat cake.",
            "score": 14,
            "depth": 0,
            "timestamp": "2022-11-21 09:46:06",
            "replies": [
                {
                    "author": "DividedContinuity",
                    "body": "Yes if there is one thing I'm sure of is that there wont be a situation of middle class living standards funded purely by 'free money' from the government... Ever.\n\nI don't know what the future will look like, but it's not that.",
                    "score": 10,
                    "depth": 1,
                    "timestamp": "2022-11-21 11:09:34",
                    "replies": [
                        {
                            "author": "savedposts456",
                            "body": "We’ll see. The ruling elite want stability - their biggest fear is widespread violence. If it becomes apparent that a huge portion of the population may miss a few meals and get violent, they may decide a UBI is worth it in order to keep society somewhat stable. Who knows.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2022-11-21 12:26:53",
                            "replies": []
                        },
                        {
                            "author": "Deleted",
                            "body": "Shit I’d believe the government would give us all a basic income way before the Zuckerbergs, Gates, Musk, Bezos of the world ever let automation cause them to give all Americans a stipend.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-21 13:04:23",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OkEntertainment7634",
                    "body": "Yep and if politicians try to just tax the crap out of companies, they’ll just move to Mexico or anywhere else so that they don’t have to pay those taxes. People even theorize a bunch of billionaires will just purchase a third world country so they can all move (legally only) to their and never pay any taxes. \n\nEither way, you and me get screwed out of the money. Best of luck in the future",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-11-21 16:18:24",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "the current economic paradigm drives income inequality. the disease is capitalism, income inequality is just a symptom.\n\nautomating labour is a blight on people, not because doing less work is bad, but because the economic system is detached from reality.",
            "score": 59,
            "depth": 0,
            "timestamp": "2022-11-21 07:37:30",
            "replies": [
                {
                    "author": "RufussSewell",
                    "body": "We just need a robot tax that funds UBI. The more profit that is earned from robots, the more goes to each citizen. \n\nThat would also make the public more interested in supporting the transition.",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2022-11-21 09:12:48",
                    "replies": [
                        {
                            "author": "rhobotics",
                            "body": "I’m having a hard time understanding this “Robot tax” that funds UBI thing.\n\nLet’s say for a minute that we do go ahead and give this a try.\n\nThe first item to address I guess would be, to define what a robot is right?\n\nBut where does that begin and where does that end?\n\nThat the first problem I see.\n\nNext, what happens to companies that have used automation for decades, do we let it slip and we only tax the new ones that use automation? That’s kind of unfair and it will stifle progress don’t you think?",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2022-11-21 09:56:08",
                            "replies": [
                                {
                                    "author": "RufussSewell",
                                    "body": "The details won’t be easy, it would take some smart people to spend time making a plan. But basically all large companies will be largely automated soon. The profits from those companies need to actually be taxed. As we know, Amazon and Apple pay almost no tax. The solution to that is easy. If sales happen in the US, Apple pays a percentage of US sales in taxes. Say 20%. It doesn’t matter that the company is based in a PO Box is Northern Ireland. Their sales are here, that’s how they get taxed. \n\nA large portion of those entirely new corporate taxes goes to UBI. It’s the only way forward that makes any sense. \n\nIf Amazon wants to keep selling things to people but there’s no more need for jobs, those people will need to get money from somewhere. \n\nThat money can come from the productivity of robots rather than humans.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 10:12:33",
                                    "replies": [
                                        {
                                            "author": "Surur",
                                            "body": "Won't they just raise prices?",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 10:58:48",
                                            "replies": [
                                                {
                                                    "author": "Morgell",
                                                    "body": "If they want people to be able to buy their products, they'll have to be real careful about raising prices.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 12:33:36",
                                                    "replies": [
                                                        {
                                                            "author": "Surur",
                                                            "body": "It's as inflation never happens. /s",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 12:48:13",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Minionz",
                                    "body": "So where would 3d printers fall on that scale? CNC? both are programmed to perform configured tasks. They are not automatic in that you must upload a program, but many automated devices are the same way, but they use logic instead. How would the tax be applied a percentage of profits? per \"bot?\". It's a very very complex idea, and has the potential to snuff out small companies/peoples side jobs depending on how its implemented (see stuff like etsy vendors)",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 10:43:54",
                                    "replies": [
                                        {
                                            "author": "rhobotics",
                                            "body": "Yeah, that’s a very good point!\n\nI think new automation companies are going to get hurt by this UBI tax since they’re not well established.\n\nAlso, I think that new companies might employ more people, by size ratio, than established ones.\n\nWe’ll have to see, but so far, I can’t get a good explanation for UBI.\n\nI have the feeling that we’re just ignoring the inevitable by just being comforted by the UBI Deux Ex Machina",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 11:04:34",
                                            "replies": []
                                        },
                                        {
                                            "author": "RufussSewell",
                                            "body": "Just based on profit and how many employees they have, not number of bots.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 12:30:22",
                                            "replies": [
                                                {
                                                    "author": "Minionz",
                                                    "body": "That would promote job elimination. They tax as a penalty for job elimination.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 12:31:33",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BadNameThinkerOfer",
                            "body": "Until the wealthy, with their overwhelming influence over the government, convince said government to cut/abolish the tax. Then everybody except them is fucked.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2022-11-21 12:24:18",
                            "replies": []
                        },
                        {
                            "author": "Deleted",
                            "body": "gates, enough is enough. just because you saw the need for charity doesn't mean that charity should be needed.",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2022-11-21 09:17:31",
                            "replies": [
                                {
                                    "author": "RufussSewell",
                                    "body": "It’s not charity. It’s humans reaping the reward of our collective progress. Rather than just a small handful of humans.",
                                    "score": 16,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 09:30:55",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "but that still doesn't address the underlying problem. that goal is treating the symptom not the disease. it could work, but it would only work temporarily.",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 09:34:04",
                                            "replies": [
                                                {
                                                    "author": "RufussSewell",
                                                    "body": "I’m not sure what you mean.",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 09:37:44",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "what i said in the first comment was that capitalism is the problem , not automation. taxation can mitigate the capitalist problem but it won't solve it.",
                                                            "score": -1,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 09:42:58",
                                                            "replies": [
                                                                {
                                                                    "author": "RufussSewell",
                                                                    "body": "Oh, sorry, I totally disagree with that. I don’t love capitalism but it seems to be the only system that works. It just needs to be well taxed to fund social programs.",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-11-21 09:48:45",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Deleted",
                                                                            "body": "if it works why does it need increased redistribution by state mandate, just to keep functioning? and that redistribution goes both ways. see corporate bailouts.",
                                                                            "score": 3,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-11-21 09:52:17",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "RufussSewell",
                                                                                    "body": "Nothing works on its own. It needs regulation, oversight, transparency and enforcement of those things to work. If not we start drifting into fascism. It’s a delicate balance that needs constant work to stay on the path. \n\nIt’s plain to see that capitalist democracies with a strong bent toward social welfare for the poor and fair but heavy taxation of the wealthy ends up with flourishing societies. \n\nCommunism ends up with too much corruption and becomes an autocracy every time. As far as I can tell only capitalism and dictatorships work as governments. And dictatorships, while often functional, don’t offer much in the way of quality of life. \n\nWhat are some examples of governments that have worked for the people that are not based on capitalism?",
                                                                                    "score": 3,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-11-21 10:00:59",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Deleted",
                                                                                            "body": "capitalism is a fairly recent ideology. and no capitalism doesn't increase innovation. science does.\n\nif a dog needs a tight leash to behave is that dog a good dog?",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-11-21 10:03:31",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "RufussSewell",
                                                                                                    "body": "Show me the evidence? All the world has ever known are dictatorships (monarchies, religious rule etc) and capitalist democracies. Of those, socialist democracies that are based on taxed free market capitalism are the only ones that have shown to be prosperous for the large majority of people. \n\nWhat other examples are you talking about? You can’t just be against something. What are you for?",
                                                                                                    "score": 3,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2022-11-21 10:24:02",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Deleted",
                                                                                                            "body": "sure they are the better example now. but they could be improved. and you know they can, not just by regulation but changing the underlying system all around. you ask for examples but before capitalistic democracies there were no examples for them either and here we are now.\n\nso i ask you again, if a dog needs a leash to behave is it a good dog?",
                                                                                                            "score": 0,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2022-11-21 10:28:14",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "RufussSewell",
                                                                                                                    "body": "What are you suggesting is the solution?",
                                                                                                                    "score": 3,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2022-11-21 10:30:41",
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Deleted",
                                                                                                                            "body": "i don't have a solution. i'm asking you to help me get there. i'm asking you to leave the capitalistic paradigm and together we can think of a better solution.",
                                                                                                                            "score": 0,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2022-11-21 10:32:35",
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Surur",
                                                                                                                                    "body": ">  if a dog needs a leash to behave is it a good dog?\n\nFire is still very useful even if you cant leave it unsupervised.\n\nYour thinking is very simplistic.",
                                                                                                                                    "score": 2,
                                                                                                                                    "depth": 15,
                                                                                                                                    "timestamp": "2022-11-21 10:51:30",
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Deleted",
                                                                                                                                            "body": "what if we have a dog that needs less supervision? fire can't learn, dogs can.",
                                                                                                                                            "score": 1,
                                                                                                                                            "depth": 16,
                                                                                                                                            "timestamp": "2022-11-21 10:55:16",
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Surur",
                                                                                                                                                    "body": "I don't know of any job which dogs do autonomously. Do you mean a cat maybe?",
                                                                                                                                                    "score": 2,
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "timestamp": "2022-11-21 11:16:41",
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Deleted",
                                                                                                                                                            "body": "cats don't work.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "timestamp": "2022-11-21 11:23:49",
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Surur",
                                                                                                                                                                    "body": "They catch mice, and they do it all by themselves. Dogs on the other hand...",
                                                                                                                                                                    "score": 2,
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "timestamp": "2022-11-21 11:25:41",
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Deleted",
                                                                                                                                                                            "body": "there is a reason why \"fat cat\" is applied to capitalists.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "timestamp": "2022-11-21 11:28:42",
                                                                                                                                                                            "replies": []
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Southern-Trip-1102",
                            "body": "What makes you think they will allow such a tax? The powers at be already dodge taxes, and they control the gov too. Rulling classes of ages prior could have also appeased the people and yet they didn't even to save themselves.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-21 11:54:13",
                            "replies": [
                                {
                                    "author": "RufussSewell",
                                    "body": "The population needs to want it enough to elect people that will put the tax in place. That starts in places like Reddit and spreading ideas that people can get behind. \n\nIt won’t be easy. You’re right about that.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 12:07:40",
                                    "replies": [
                                        {
                                            "author": "Southern-Trip-1102",
                                            "body": "You are assuming the population have the power to elect people in the first place. In case you haven't noticed, capitalist nations are ruled by plutocracy.\n\nhttps://www.cambridge.org/core/journals/perspectives-on-politics/article/testing-theories-of-american-politics-elites-interest-groups-and-average-citizens/62327F513959D0A304D4893B382B992B\n\nCandidates are bought, both through lobbying and campaign donations, this has been the case since the start of the nation.\n\nIt's a one party state with 2 factions whose main difference is social policy.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 12:12:21",
                                            "replies": [
                                                {
                                                    "author": "RufussSewell",
                                                    "body": "We have to work with what we have. \n\nThere are people running and winning who want to tax corporations. If enough people support them they will have the power to tax the wealthy. \n\nI have no interest in going further down this rabbit hole with you.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 12:20:18",
                                                    "replies": [
                                                        {
                                                            "author": "Southern-Trip-1102",
                                                            "body": "No we don't. Look at history, the ruling class is never dethroned voluntarily.",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 12:21:34",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BreakRaven",
                            "body": "> We just need a robot tax that funds UBI.\n\nGood job, you just increased the price of everything that used a robot in its creation. Give yourself a pat on the back.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-22 02:44:10",
                            "replies": [
                                {
                                    "author": "RufussSewell",
                                    "body": "But we also got a bunch of free money to spend on that stuff. \n\nIt has to go this way because there will be absolutely no jobs soon. Robots will be better workers than humans in every field very soon.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-22 08:45:11",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "strangeapple",
                    "body": "Inequality can exists with or without capitalism though. The way I see it actual problem lies in social hierarchy, faults in collective decision making and shortcomings of governance process, which gives rise to wage-slavery and dominance of few over many.",
                    "score": 21,
                    "depth": 1,
                    "timestamp": "2022-11-21 07:57:46",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "capitalism needs inequality to function. you need people with less capital to sell their time cheaper so you can make a profit. so in order for capitalism to function income inequality must always be present.\n\nbut your point still stands. a faulty hierarchical decision making process can also create inequality.",
                            "score": 27,
                            "depth": 2,
                            "timestamp": "2022-11-21 08:03:37",
                            "replies": [
                                {
                                    "author": "nomorerainpls",
                                    "body": "Your assertion that inequality is required assumes we all place the same value on labor and goods. In facts it’s extraordinarily naive to imagine you’ve created a universal index of value.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 09:37:06",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "bullshit. you are applying value fluctuation of a product to value of labour. a product can make a profit. labour must make a profit.",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 09:41:06",
                                            "replies": [
                                                {
                                                    "author": "Surur",
                                                    "body": "Obviously not true. Not all labour needs to make a profit. Only on average.",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 11:00:19",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "labour needs to contribute something to the group. a single employee can be unprofitable but his contribution helps others be more profitable.\n\nbut the other commenter was wrong. because placing different value on labour is inequality just the same. you need people to value their time less, whatever the reason, to create profit from their labour. otherwise there would be no profit, because the labourer would demand to be paid the added value of his work.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 11:12:35",
                                                            "replies": [
                                                                {
                                                                    "author": "Surur",
                                                                    "body": "> you need people to value their time less to create profit from their labour\n\nThis of course ignores the multiplication effect from organizing labour e.g. one person can not usefully refine iron from ore, but organizing 10,000 people allows you to create useful products.\n\nSo a single person's value is less than when they are in a group. Your individual labour is not worth as much as when you work with others. You cant just withdraw your labour from the spoon factory and make your own spoons for the same price as you were paid.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-11-21 11:23:46",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Deleted",
                                                                            "body": "neither can you organize an empty factory. how can you create profit without the added value from labour? you can't. thus leading to what i said, capitalism needs inequality to function. without inequality there is no capitalism.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-11-21 11:27:37",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Surur",
                                                                                    "body": "> neither can you organize an empty factory\n\nIsn't this article about just that - A capitalist setting up (organizing) a factory with as few or no employees and cranking out products, and reaping the reward of that work?\n\n>  how can you create profit without the added value from labour? you can't.\n\nYou can pretend that organizing labour is not work, but it obviously is, which is where the value comes from. Managers also \"go to work\".",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-11-21 11:29:13",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Deleted",
                                                                                            "body": "like really empty. no workers, no machines.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-11-21 11:32:09",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Surur",
                                                                                                    "body": "I don't know what you are getting at, but that's called Real Estate lol.\n\nI heard it's pretty profitable.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2022-11-21 11:35:26",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Deleted",
                                                                                                            "body": "sure thing buddy.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2022-11-21 11:36:31",
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "Southern-Trip-1102",
                                                                                            "body": "Managing is work but owning something isn't work. Let's say you have 2 investors, both are equal managers in talent and ability, yet the first investor makes more money simply because they own more initial capital not because of actual ability.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-11-21 11:56:06",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Surur",
                                                                                                    "body": "So managers work by choosing things, right. So the owner obviously made the initial choice to purchase something.\n\nSome owners are good at making choices, and they reap the reward, and some are bad, and some are lucky.\n\nBut the point is choosing things is still work.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2022-11-21 12:35:03",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Southern-Trip-1102",
                                                                                                            "body": "The issue is, again, that one investor makes more money simply due to having more money. That is an irrational incentive scheme. Only ability/effort should be rewarded not ownership. \n\nManagement is an ability yes, a vital ability, one that should be rewarded based on ability like every other profession is, not ownership. It makes no sense, it would be like rewarding a civil enggienr more than a computer engineer simply because one makes bigger things than the other",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2022-11-21 12:37:25",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Surur",
                                                                                                                    "body": "> That is an irrational incentive scheme\n\nThis is the incentive scheme the western world is built on.\n\n> not ownership\n\nOwnership gives you the right to make decisions.  \n\nSo in your world, do people even own themselves? I guess not.\n\nAnd if they do, what else can they own? How are you going to reward them in a way that does not confer ownership rights? Trips to Disneyland?",
                                                                                                                    "score": 1,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2022-11-21 12:44:31",
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Southern-Trip-1102",
                                                                                                                            "body": "Yes which is why the western world has many problems. A car with a bad engine will still work even if poorly.\n\nDo not stawman my position. I am obviously referring to ownership of capital not of person, unless you are stupid you know this.\n\nManagement will be rewarded as any other position is, with money. Owners are effectively overpaid managers, so the change is rather simple, to not pay them based on ownership but on managerial ability.",
                                                                                                                            "score": 1,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2022-11-21 12:49:47",
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Surur",
                                                                                                                                    "body": "So in your world you are allowed to own things.\n\nSo you are allowed to be rewarded for your choices, which you have a right to make by virtue of owning the item.\n\nSo imagine your architect gets rewarded for his work with money.  \n\nHe uses the money to buy a flat which he rents out.\n\nHe now earns rent, by virtue of the work he did. That work being the decision to buy a flat.\n\nWhere's your problem with that?",
                                                                                                                                    "score": 1,
                                                                                                                                    "depth": 15,
                                                                                                                                    "timestamp": "2022-11-21 12:59:25",
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Southern-Trip-1102",
                                                                                                                                            "body": "You are allowed to own things as long as you aren't using them to extract value through ownership. Renting things out is getting value without producing value through ability. Buying a flat for lets say 10 pounds and getting net 1 pounds a month indefinitely do not equal. \n\nAgain, I have no problem rewarding people for their efforts and ability, I do have a problem with rewarding people for ownership. Non periodic input does not equal periodic reward.\n\nI don't care if you think he deserves the ability to rent things out and extract value through ownership. It's not about what people deserve or is ethical but what is efficient, and letting people get periodic reward without periodic input (effort/ability) is inefficient and a bad incentive system.",
                                                                                                                                            "score": 1,
                                                                                                                                            "depth": 16,
                                                                                                                                            "timestamp": "2022-11-21 13:06:19",
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Surur",
                                                                                                                                                    "body": "See, the problem is that you think of ownership as passive. It's actually active .\n\nEvery day you decide whether you are going to keep your property or sell it. Strangely enough that decision decides whether you continue to earn money from your ownership.\n\nSince we already decided that you can earn rewards from making decisions, that is the work you do which determines you getting a reward. \n\nYour framework is not internally consistent.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "timestamp": "2022-11-21 14:28:21",
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Southern-Trip-1102",
                                                                                                                                                            "body": "Again, reward from ownership does not equal reward for choices aka managerial ability.\n\nBack to my 2 investor example. Both make the same exact choices and yet simply by owning more the first investor makes more money. You can make money from making choices yes, that is called being a manager, but ownership reward is a poor proxy for the true reward management should get. The quality of choices should be rewarded, not how much capital you have for those choices.\n\nYou clearly do not understand my framework.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "timestamp": "2022-11-21 14:34:41",
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Surur",
                                                                                                                                                                    "body": "What makes the choice to buy or sell something for someone else (and being rewarded for this) different from being rewarded for making decisions about your own property?\n\nWhat if I decide to do extra training and now I am more qualified and can earn more?\n\nWhat if I decide to invest my money in a new tools, and now I can do more work and earn more money? Still fair?\n\nWhat if I hire someone to run that tool for me? Suddenly not fair?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "timestamp": "2022-11-21 15:02:28",
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Southern-Trip-1102",
                                                                                                                                                                            "body": "Because the reward you get for ownership vs management is not equal even if somewhat correlated. \n\nInvesting into yourself (tools, education) is fine because you are improving your own ability. Which means you can improve your periodic input/ability and thus your periodic reward.\n\nThe issue with hiring someone else to use that tool is that you are no longer being rewarded for improving your own periodic input/ability but rather for simply owning something which improves someone else's productivity. It's a bad incentive. Also before you say that the owner is rewarded for imrpoving the worker's productivity let me remind you that the owner isnt the tool, the tool is the thing which improves productivity not the owner.\n\nAgain, why do you keeping bringing up if things are fair or not? The world isn't fair, the only thing that matters is improving our civilization through better incentive systems and more.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "timestamp": "2022-11-21 15:13:31",
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "Surur",
                                                                                                                                                                                    "body": "You are not making sense. But I see now that you are not going for a logical framework but for one that is based on the outcome you desire. \n\nUnfortunately the world does not work that way.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "depth": 21,
                                                                                                                                                                                    "timestamp": "2022-11-21 15:26:29",
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Southern-Trip-1102",
                                                                                                                                                                                            "body": "I think most reading this will see that my framework is plenty robust.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "depth": 22,
                                                                                                                                                                                            "timestamp": "2022-11-21 15:28:40",
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "Surur",
                                                                                                                                                                                                    "body": "Let me try again. Under your framework I own a farm, purchased after years of hard labour as an architect.\n\nI hire 10 guys to plough the field. Under your framework, the harvest is split between the 10 guys and the owner gets nothing?\n\nSo the owner buys a tractor and is now able to plough the whole field himself - he gets to keep everything.\n\nYou can see how this system is worse - right?  It disincentivises growth, and it incentivises automation and subsequent unemployment.",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "depth": 23,
                                                                                                                                                                                                    "timestamp": "2022-11-21 18:02:35",
                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "in6seconds",
                                    "body": "There seems to be an ideal frontier level of inequality: [https://www.frontiersin.org/articles/10.3389/fpsyg.2017.02052/full](https://www.frontiersin.org/articles/10.3389/fpsyg.2017.02052/full#:~:text=The%20correlation%20between%20the%20Gini,20)\n\nAs with most things, moderation is best",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 11:42:40",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Deleted",
                            "body": "Are you proposing trying to modify the natural fundamentals of human society? That's quite a bold ambition.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2022-11-21 12:12:01",
                            "replies": [
                                {
                                    "author": "strangeapple",
                                    "body": "Sure. Make study of logic and reasoning more prevalent than study of reading and writing. Encourage non-hierarchical social roles, akin to Adlerian individualism. Put a cap on how much wealth a single individual is allowed to own so no one would own more than they can ever spend in a lifetime. Give everyone basic income to get by so there would be no fear of ending up homeless - fear kills creativity and people are far more motivated to be part of society when society is worth being a part of. End homelessness. Invest massive resources into studying and technologically improving collective decision-making processes so that one day we could for once live our lives without constant effort going into stopping some idiots taking all our rights away, starting a nuclear war or next genocide.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 12:38:29",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "doabsnow",
                            "body": "The actual problem is that there has always been inequality, and people have always died of it.\n\nWhat do you think people did when they couldn't successfully hunt or grow crops?\n\nThey starved to death.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2022-11-21 08:58:45",
                            "replies": [
                                {
                                    "author": "pcvfallen",
                                    "body": "That example does not show inequality. That's just a natural course of life. If you included that other people would allow them to starve to death that example would work to show inequality. However, pre-capitalist society was so intertwined that food distribution across the population was necessary for societal survival. Therefore, this particular inequality wouldn't have happened.",
                                    "score": -3,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 09:16:53",
                                    "replies": [
                                        {
                                            "author": "Surur",
                                            "body": "No, they just sacrificed you to the gods.  You seem to be glorifying pre-history.",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 11:01:28",
                                            "replies": [
                                                {
                                                    "author": "pcvfallen",
                                                    "body": "Hmm, are you a reincarnated sacrifice to know so much of what happened prehistorically?",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 19:07:44",
                                                    "replies": [
                                                        {
                                                            "author": "Surur",
                                                            "body": "It's the blood stains.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 19:31:04",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Southern-Trip-1102",
                            "body": "The issue isn't inequality in ability but the inequality generated by capitlsism through ownership of capital. \n\nLet's say you got 2 investors. Equal ability. Investor 1 has more I starting capital than 2. For this simple fact investor 1 will make money money simply due to ownership and nothing else. That is the problem.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2022-11-21 11:58:23",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "People that are born smart have an advantage. People born with looks have an advantage. People born with money have an advantage.\n\nLife will never be equal. The best we can do is keep the bottom as high as possible and give opportunities for improvement.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 12:14:01",
                                    "replies": [
                                        {
                                            "author": "Southern-Trip-1102",
                                            "body": "I don't care about inequality due to ability. I care about inequality due to ownership. One is efficient the other isn't.\n\n\nYou should not be rewarded for just owning more, that is a stupid reward mechanism which leads to inefficiency and hurts productivity as well as reduce opportunities for those who actually deserve it. We should reward ability aka merit.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 12:16:59",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "Do you not believe that there are things that require stewardship over in order to operate reliably? How do you think these people got the money in the first place? \n\nMerit is determined by the market. You might be the best toenail painter in the world, but if nobody is willing to pay you to do it, it is obviously not very valuable.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 12:23:06",
                                                    "replies": [
                                                        {
                                                            "author": "Southern-Trip-1102",
                                                            "body": "Management is great, a very valuable ability. The issue is that people should be rewarded for their management ability not for owning more. As I expressed in my initial investor example, ability, such as managment ability, should be rewarded not ownership.\n\nThe market is a poor measure of merit. Theoretical physicists were vital for the vast majority of the value we have today from semi conductors to electricity and yet they are paid scraps. The market is especially poor at measuring indirect merit. Another example is how the market rewards fraudsters and companies which pollute and hurt people through cigarettes etc. \n\nThis isn't about fairness or justness this is about efficiency.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 12:29:36",
                                                            "replies": [
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "Speaking of physicists: https://monthlyreview.org/2009/05/01/why-socialism/",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-11-21 12:49:18",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Southern-Trip-1102",
                                                                            "body": "This is a good one.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-11-21 12:50:56",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Utterlybored",
                    "body": "It has been this way, but it doesn’t need to be this way.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2022-11-21 07:50:53",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "it won't be this way for much longer. we have passed the point where the benefits are no longer bigger than the losses. it is just a matter of time.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-21 07:54:40",
                            "replies": [
                                {
                                    "author": "Pragmatist_Hammer",
                                    "body": "I read that is \"it's just murder time\" and thought \"you son of a bitch, I'm in!\"",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 08:44:31",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "nah, dead people don't feel humiliation. i want them humiliated not dead. it's way worse for the powerful. being on top of the world one day, and being accountable the next. fuck their egos not their body.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 08:48:24",
                                            "replies": [
                                                {
                                                    "author": "lucidrage",
                                                    "body": "Pretty sure Epstein would disagree...",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 09:36:24",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "nomorerainpls",
                                    "body": "retarded post by someone who obviously can’t cope",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 09:38:05",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "goatslurper",
                    "body": "Well said. Even though we all have the computing power of what used to fill entire rooms in our pockets, the number of hours we work is the same (if not more, considering that bosses now try to communicate with us 24/7). Technological innovation under capitalism does not ease the working class' burden.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2022-11-21 08:32:25",
                    "replies": []
                },
                {
                    "author": "Artanthos",
                    "body": "Income inequality dates back to the founding of the first cities.\n\nIt has existed in all economic models except hunter/gatherer. Even then, some had better hunting grounds.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2022-11-21 14:33:28",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "murder has existed since the beginning of human kind. cancer has existed since the beginning of human kind. doesn't mean we should not do something about it.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-21 14:36:27",
                            "replies": [
                                {
                                    "author": "Artanthos",
                                    "body": "The only solution I can see is removing free will.\n\nWhich would also solve the murder problem and most of the other ills in society.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-22 15:17:41",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "m0llusk",
                    "body": "That is false.  We had Capitalism back in the 70s and it was constrained by high taxes on the rich, strong regulations, and entire industries being unionized.  Things didn't start to rot until we backed away from trying to tame Capitalism.  \n\nMost human endeavors require some rules, some control, some way of asserting reason and responsibility.  If you don't bother trying to set some limits then systems go haywire.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2022-11-21 09:16:58",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "that is what i'm saying. treating the symptom is wasting resources. we need to cure the disease. if the cure is a tighter leash, so be it. if the cure is total departure from the ideology, so be it.",
                            "score": 11,
                            "depth": 2,
                            "timestamp": "2022-11-21 09:20:41",
                            "replies": []
                        },
                        {
                            "author": "BadNameThinkerOfer",
                            "body": "Well yeah, if you continue to allow the capitalist class to exist, any concessions you get from them are always going to be temporary.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2022-11-21 12:19:50",
                            "replies": []
                        },
                        {
                            "author": "Deleted",
                            "body": "Capitalism is a nuclear reactor and we took the brakes off it and were headed towards a negotiable.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-21 13:12:21",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "The object of automation isn't to reduce labor, it's to maximize its productivity.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-11-21 12:09:08",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "the objective of automation is to increase profits.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-21 12:12:37",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "Not all automation is profit-oriented. And profits are relative to productivity levels. So it's productivity.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 12:20:11",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "the only reason to increase productivity is to increase profits. so it's profits.",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 12:20:53",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "I have a roomba. Using it is not making me a profit.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 12:24:14",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "are you a corporation? is profit your only reason for existing?",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 12:27:10",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "glyptometa",
                    "body": "I would add consumerism and materialism",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-11-21 17:50:57",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "Income inequality is a societal problem, not technological",
            "score": 4,
            "depth": 0,
            "timestamp": "2022-11-21 10:00:20",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Please explain why it is even a problem",
                    "score": -3,
                    "depth": 1,
                    "timestamp": "2022-11-21 12:15:11",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Continue to ignore it and you tell me",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2022-11-21 14:53:22",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "2012Aceman",
            "body": "If you want jobs just outlaw stoplights and have a human coordinating traffic at every major intersection. Not particularly useful or productive, but a ton of jobs, and you’d get that “personal touch” with your commute. \n\nIf, however, we were automating things so that our time could be freed up to do OTHER THINGS, we ought to keep that original intent in mind.",
            "score": 9,
            "depth": 0,
            "timestamp": "2022-11-21 09:11:49",
            "replies": [
                {
                    "author": "grislebeard",
                    "body": "That ONLY happens if the benefits of automation are socialized, either through expropriation (taxes) or collective ownership. If the benefits only go to the owner of the robots, then you get what we have: a boring dystopia where a handful people have more wealth than almost everyone else in the country combined.",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2022-11-21 11:46:22",
                    "replies": []
                },
                {
                    "author": "DividedContinuity",
                    "body": "That's the question though isn't it.  If/when we get to a point that automation rapidly decreases the need for labour in most sectors, then what exactly are those 'other things' and how do they pay a salary?\n\nWe're not talking about industrial revolutions like we've seen in the past where the labour market is transformed over several decades, we're talking about revolutionary change on the scale of years and months.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2022-11-21 11:01:42",
                    "replies": []
                },
                {
                    "author": "Leave-Rich",
                    "body": "Isn't the purpose of all technology to make our lives easier so hopefully eventually we don't have to work.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2022-11-21 12:12:58",
                    "replies": []
                },
                {
                    "author": "glyptometa",
                    "body": "Or apply no effort to control intersections whatsoever. Creates even more jobs in towing, smash repair, first response, health care, mortuaries, car factories and after-market armoring of cars. Many of those jobs will suit people unable to write computer code or get a job in academia.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-11-21 17:57:39",
                    "replies": []
                }
            ]
        },
        {
            "author": "Fragmentia",
            "body": "I've also heard Reaganomics does as well! But perhaps if we cut taxes for the rich enough they will invest in an all robot workforce and share the wealth through philanthropy.",
            "score": 3,
            "depth": 0,
            "timestamp": "2022-11-21 11:10:32",
            "replies": [
                {
                    "author": "Southern-Trip-1102",
                    "body": "forgot the /s",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-11-21 13:57:10",
                    "replies": []
                }
            ]
        },
        {
            "author": "mhornberger",
            "body": "All technology does, since all technology (more or less) serves to save (or replace, same thing) labor.  And the capital expenditure needed for automation acts as a barrier to entry, and makes it more difficult for smaller players to compete.  This is true at every point along the technological gradient, and is not particular to automation.  The increasing cost of war partially drove the centralization of power and the development of the nation-state.   Tribes of dudes with pointy sticks can't go up against organized armies with armor and artillery.  Which takes capital, and concentrates power.   At each iteration of technological advance, the gap between the poorer groups with the pointy sticks and the group with the aircraft carriers (the US has eleven!) grows more difficult to overcome.   \n\nBut that also entrenches the need for training and education.  Which is just another type of arms race.   Workers have to compete in an economy that needs ever-increasing specialized expertise.   Which makes them vulnerable to opportunity costs (what else could I have studied?) and path dependence (the skill you learned went out of fashion).",
            "score": 3,
            "depth": 0,
            "timestamp": "2022-11-21 13:21:29",
            "replies": []
        },
        {
            "author": "Bootytonus",
            "body": "A lot of people here don't seem to realize that the markets existed before capitalism, and they will be here after it's gone. As long as there are people, there will be markets to barter and trade in.",
            "score": 3,
            "depth": 0,
            "timestamp": "2022-11-21 15:17:03",
            "replies": []
        },
        {
            "author": "QwertzOne",
            "body": "[The Two Futures Of Automation: Capitalism VS Socialism](https://youtu.be/6WwHvNDrGV0)",
            "score": 2,
            "depth": 0,
            "timestamp": "2022-11-21 09:59:06",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "It’s not automation that drives income inequality, it’s the government passing laws to benefit the rich at the expense of everybody else.\n\nIf automation drove income inequality, then the American middle class wouldn’t have grown after the fdr era. Even as automation and machinery made leaps and bounds during the 1900s, the middle class expanded. \n\nWhy? Because the rich were taxed and the government used that to fund roads, public infrastructure such as water pipes, bridges, hospitals, schools for k-12 as well as college, graduate, and medical schools, and good government jobs.",
            "score": 2,
            "depth": 0,
            "timestamp": "2022-11-21 10:35:02",
            "replies": []
        },
        {
            "author": "grislebeard",
            "body": "Well doi, the whole point is for the owning class to reduce having to pay people. Automation would be great if the benefits were socialized (taxes or collective ownership), but in our boring dystopia, the owners just get to own the automation and all the benefits \n\nEdit: spelling",
            "score": 3,
            "depth": 0,
            "timestamp": "2022-11-21 11:41:36",
            "replies": []
        },
        {
            "author": "jackalope689",
            "body": "At this point is there anything that can’t be attributed to driving income inequality?  The only thing that apparently doesn’t drive it is effort.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 11:58:33",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "One way to address income inequality is to learn skills that others are willing to pay you to do.  However, sometimes it involves time and effort.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 15:55:43",
            "replies": []
        },
        {
            "author": "marvis303",
            "body": "I work on digital tech and AI and I really want these technologies being used for good. The study tells me that making great tech isn't enough. We need to do better in balancing short and long-term benefits though.\n\nLong-term, I believe automation has lots of potential to improve people's lives. For example, my grandma used to be a switchboard operator as a young woman. Switchboard operator is not a job any more, but telecommunication is still an entire industry. Without automation, this would have never grown as it did. Nevertheless, the automation in this space meant that a lot of people like my grandma were no longer needed in those jobs.\n\nIt makes me curious to think beyond technology and also consider the business models, social and political implications of technology.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 14:10:16",
            "replies": []
        },
        {
            "author": "ExLegeLibertas",
            "body": "what a bullshit conclusion. \n\nautomation doesn't \"drive inequality.\" the ruling class ownership of capital drives inequality. automation under capitalism eventually creates an underclass that has to live on crumbs because their labor is no longer necessary. \n\nthe Luddites were right, then and now. \n\nthe machine generates wealth, the wealth should be evenly distributed, because the tool is no longer necessary. private ownership of automated industry is the driver of inequality and must be abolished.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 17:11:33",
            "replies": []
        },
        {
            "author": "InitialCreature",
            "body": "So start learning how to automate yourself now. Own your own automation force multiplication. That's why I'm starting to study it now.",
            "score": 0,
            "depth": 0,
            "timestamp": "2022-11-21 11:27:28",
            "replies": []
        },
        {
            "author": "GiveMeKnowledgePlz",
            "body": "That means automation is a racist, colonialist thing and we need minorities and people of low social background needs to be in hard manual labor",
            "score": 0,
            "depth": 0,
            "timestamp": "2022-11-21 12:00:21",
            "replies": []
        },
        {
            "author": "themaleshannon",
            "body": "Could it be that the persistent demand for increasingly higher wages for the same output of the same unskilled labor drives the desire for automation?",
            "score": 0,
            "depth": 0,
            "timestamp": "2022-11-21 12:46:17",
            "replies": []
        },
        {
            "author": "spider-bro",
            "body": "Like most things in a free market system, things that drive inequality tend to do so by (a) increasing the wealth of the poorest by a lot, and (b) increasing the wealth of the richest by an enormous amount.  \n\nExamples:\n\n* industrial revolution: made cheaper goods available to all, made factory owners super rich  \n* internet: made abundant information available to all, made new class of “dot com millionaires”, richest people on planet now software tycoons\n* AI: gives everyone access to cognitive assistance which only people with assistants had before, enables solution to engineering problems of all types, makes intelligent labor cheap for business owners\n\nAgain, the pattern is:  \n\n* make the poorest people wealthier\n* make the richest people way more wealthier\n* increasing gap between poor and rich\n* while moving everyone upward\n\nJust something to keep in mind when we talk about inequality: increases in relative wealth difference between top and bottom tends to accompany absolute increases in wealth for everyone.",
            "score": -4,
            "depth": 0,
            "timestamp": "2022-11-21 08:54:07",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "good point. if machines produce goods cheaper, your 2 dollars can buy more goods than before. nevertheless this paper is saying just that, productivity doesn't really rises, so prices aren't going down. which means that the income inequality is coming from the poorest becoming poorer.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2022-11-21 09:15:16",
                    "replies": []
                },
                {
                    "author": "reviedox",
                    "body": "I still don't understand your reasoning behind AI benefiting lower-class. Today it takes more jobs than it creates, and the new ones are high-skill anyways so it's not like trucker or cashier who lost his job can just switch to become a programmer or AI-technician with 5 years experience and degree.\n\nNot to mention industrial revolution was in early stages of capitalism and improved access to necessary basic goods like food, medicine, clothes etc. The AI might only improve access to luxury goods and services, even then we're at phase of capitalism where the producers rarely decrease price when the fixed production cost decreases.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2022-11-21 13:50:42",
                    "replies": []
                },
                {
                    "author": "woobloob",
                    "body": "This is true but it's important to recognize how much poorer people actually become in some ways when the wealthy get wealthier. It becomes harder for most people to buy a house, harder to find a job, harder to create your own company. Basically people become less free, and it's dangerous to ignore.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2022-11-21 09:06:33",
                    "replies": []
                }
            ]
        },
        {
            "author": "dreadpirate_metalart",
            "body": "It blows my mind that people think humans are equal in some way or that they should be.  Genetically it will never happen unless there is embryonic manipulation. You get the hand you’re dealt at birth or through a life event.  I think most people that want equality probably don’t have the skills or traits to compete.  Life is not an even playing field and it was never meant to be.",
            "score": -9,
            "depth": 0,
            "timestamp": "2022-11-21 08:31:20",
            "replies": [
                {
                    "author": "woobloob",
                    "body": "It's about humans actually being more equal than some societies recognize. It blows my mind that people accept the level of inequality that they do.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2022-11-21 09:08:20",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "A recent study of genetic factors related to academic performance demonstrates that those with the highest parental income but with the lowest genetic factor scores graduate college at higher rates than those individuals with the lowest parental income but with the highest genetic factors.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-11-21 09:11:14",
                    "replies": []
                },
                {
                    "author": "Eric1491625",
                    "body": "Because so much of modern society and its morals are predicated on it. \n\nEquality of one person one vote. It's called democracy and people hate countries without it.\n\nEquality of man and woman. People hate Qatar and Saudi Arabia because they don't have it. \n\nEquality of Dalit and Brahmin. People hate India's caste system because they're not equal. \n\nEquality of Aryan and Jew.\n\nEquality of Muslim and Hindu. \n\nThere's a limit to how much inequality people can accept until it's too much.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-11-21 10:01:48",
                    "replies": [
                        {
                            "author": "dreadpirate_metalart",
                            "body": "To be clear I was referring to active learning and total cognitive capacity of any particular human. As we all know not everyone is the same.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2022-11-21 10:14:13",
                            "replies": [
                                {
                                    "author": "Eric1491625",
                                    "body": "Of course it's not the same. That's not what people are complaining about. \n\nNobody is fighting against cognitive inequality here. People are fighting against income inequality. Which is, by the way, *not* primarily determined by cognition.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2022-11-21 10:38:09",
                                    "replies": [
                                        {
                                            "author": "dreadpirate_metalart",
                                            "body": "It all starts with your genetics and where you happened to start life on this planet.  Time will only make the inequalities worse. Revolutions require pain most people don’t have the stomach for it.",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2022-11-21 11:29:04",
                                            "replies": [
                                                {
                                                    "author": "charlesfire",
                                                    "body": ">It all starts with your genetics\n\nNo, it doesn't. It has way more to do with your parents income than anything else.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2022-11-21 11:59:50",
                                                    "replies": [
                                                        {
                                                            "author": "dreadpirate_metalart",
                                                            "body": "So you don’t think that a person’s genetics would help them break free from the pack?",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2022-11-21 12:27:53",
                                                            "replies": [
                                                                {
                                                                    "author": "charlesfire",
                                                                    "body": "No. Your parents income is the biggest predictor of success by far. Genetics is almost irrelevant.",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-11-21 12:51:39",
                                                                    "replies": [
                                                                        {
                                                                            "author": "dreadpirate_metalart",
                                                                            "body": "People build wealth through education. I would agree that the way the US educates our children is broken at its core and needs to be re-evaluated. But back to genetics there will be people that excel more than others due to genetics of neural pathways.  There will always be a top of the food chain so to speak.",
                                                                            "score": 0,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-11-21 13:06:37",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "charlesfire",
                                                                                    "body": "That's the big fallacy upon which the USA is built : \"If you work hard, you'll get rich\". [The reality is that your success has more to do with how rich your parents were than anything else](https://cew.georgetown.edu/cew-reports/schooled2lose/). If your parents are rich, you're going to get better education and you won't have to worry about rent or food, thus vastly increasing your chances of success. And I haven't talked about how school financing disadvantages poor neighborhoods, how neopotism advantages the wealthy and generational wealth.\n\nThe USA isn't a meritocracy. It never was a meritocracy.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-11-21 13:42:20",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "dreadpirate_metalart",
                                                                                            "body": "I’m curious what you think a functioning society looks like? Rich people aren’t going to give you their wealth and taking their wealth requires everyone to be on the same page. News flash it’s not going to happen. At least not without a fight. Be it overt or subverted means.",
                                                                                            "score": 0,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-11-21 14:01:03",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "charlesfire",
                                                                                                    "body": ">Rich people aren’t going to give you their wealth\n\nWhy would they? I'm quite wealthy myself (like way above the average for my country). I should be the one giving money to less wealthy people, not the other way around.\n\n>taking their wealth requires everyone to be on the same page.\n\nNo. It just takes a majority.\n\nEdit : Also, you totally deviated from the actual discussion with that last comment. We were talking about how genetics influence wealth. Why aren't you defending that point of view anymore?",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2022-11-21 14:10:19",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "dreadpirate_metalart",
                                                                                                            "body": "I will say I believe the majority of super rich have gotten their money through ill gotten gains. Through a system that is rigged to help it endure. Regardless is you don’t believe that genetics plays a part in generational wealth. In fact it does to my account at some point someone in the genetic branch was smart enough or strong enough to make it to the top of whatever position.",
                                                                                                            "score": 0,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2022-11-21 14:49:21",
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": -1,
            "depth": 0,
            "timestamp": "2022-11-21 11:50:12",
            "replies": [
                {
                    "author": "charlesfire",
                    "body": "\"Some of you may die, but it's a sacrifice I'm willing to make.\"",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2022-11-21 11:55:46",
                    "replies": []
                }
            ]
        },
        {
            "author": "Juannieve05",
            "body": "The only way for hunanity to thrive Is to start automating AND reducing population accordingly.",
            "score": -3,
            "depth": 0,
            "timestamp": "2022-11-21 09:25:29",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Is that really any surprise though? I could have told you that. Yet it will continue to happen anyway.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 08:45:56",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "My understanding is that automation initially causes jobs to go down, but over time increases the number of jobs required as the company is able to expand. Not sure if that translates to the economy as a whole, however…",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 11:49:15",
            "replies": []
        },
        {
            "author": "Leave-Rich",
            "body": "Hopefully everything eventually will be done by robots with humans doing a select few things the hardest part is how to figure how to allocate goods if robots do most of the jobs.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 12:11:15",
            "replies": []
        },
        {
            "author": "techjunkie86",
            "body": "I'm ready for my chipotle robot to scoop 100% accurate serving amounts without worrying that I need to check my order before leaving.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 13:32:27",
            "replies": []
        },
        {
            "author": "Sticky_Quip",
            "body": "Have an automated tax and raise corporate taxes, fund ubi.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 13:38:38",
            "replies": []
        },
        {
            "author": "Baldigarius42",
            "body": "it is the non-sharing of wealth that leads to inequality, an anti-capitalist society is the solution.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 13:40:55",
            "replies": [
                {
                    "author": "raybanshee",
                    "body": "We can spread the money around however we like, but it's not going to change the underlying issues of resource scarcity and overpopulation.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2022-11-21 13:54:55",
                    "replies": [
                        {
                            "author": "Baldigarius42",
                            "body": "I'm not saying otherwise",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-21 14:07:10",
                            "replies": []
                        },
                        {
                            "author": "Baldigarius42",
                            "body": "but don't forget that the world's production can feed the population twice",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-11-21 14:10:22",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "global capital siphoning competition needs to be automated for equality and addressing climate crisis -> maximize every human/societal benefit and minimize environmental impact\n\nfactory making things cheap was good but people weren't supposed to work like machines/program\n\nso i think putting people back in the creative/be their own boss position and let robots/AI do the labor/calculation is good...and invest in companies that make their tools\n\ncorporations make robots/AI/environmental friendly ingredients/methods/etc requiring latest research & development take a cut i guess\n\nthis is already happening in digital content creation economy...handmade goods/services economy will follow",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 14:13:59",
            "replies": []
        },
        {
            "author": "T3hArchAngel_G",
            "body": "This seems pretty obvious to me.  Automation removes a lot of simple work, and a majority of the work force is doing what higher ups don't want to do.  Eliminate simple work, and you eliminate a large chunk of the work force.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 14:23:47",
            "replies": []
        },
        {
            "author": "OkEntertainment7634",
            "body": "Sure does. People that can purchase automated machinery will maintain the income that would have gone to a worker. So, the would be worker never has the chance to earn wealth from that firm. Scale it up further and that’s our future",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 16:14:41",
            "replies": []
        },
        {
            "author": "MuNuKia",
            "body": "This article does not take into consideration that automation also create higher skilled jobs, that get paid more than lower skill jobs. Also with the supply chain issues, high skill work is needed to stabilize supply chain disruptions, to reduce the rate of inflation.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 21:30:37",
            "replies": []
        },
        {
            "author": "Kwelikinz",
            "body": "I’d go with sexism and racism as the actual drivers of income inequality, being that income inequality has been constant and was pretty much overlooked until recently. Teachers spring to mind as primary recipients of inequity.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-21 23:49:27",
            "replies": []
        },
        {
            "author": "OliverSparrow",
            "body": "Acemoglu is a first rate economist. However, he fails to say what kind of productivity he is discussing. Undoubtedly automating a till will increase labour productivty at the expense of capital productivity. Whether that is a commercial Good Thing or no depends on the full cost of capital and of labour. \n\nTurning to the headline, my immediate response is \"Well, duh?\" Firms will automate the most routine tasks, which are also the lowest paid, not because that is economically optimal - you want to eliminate the highly paid jobs - but because that is what you can practically automate. Doing thi sis what the Big Theme of the 1990s - business process re-engineering - delivered. Not robots, but reorganising processes so as to make them cheaper and more efficient.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-11-23 13:03:25",
            "replies": []
        }
    ]
}