{
    "post_title": "Rich people know what's coming. The goal of AI is to automate what humans can do. We use it every day without realizing it.",
    "post_timestamp": "2025-01-26 11:17:47",
    "last_comment_timestamp": "2025-05-05 18:46:01",
    "time_difference": "99 days, 7:28:14",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "r/FluentInFinance was created to discuss money, investing & finance! Join our Newsletter or Youtube Channel for additional insights at www.TheFinanceNewsletter.com!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FluentInFinance) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-26 11:17:48",
            "replies": []
        },
        {
            "author": "Alchemyst01984",
            "body": "I'd support AI if humans were still taken care of as their jobs get replaced. \n\nAI should make it easier for us all. We have way too many resources and wealth concentrated to the few",
            "score": 20,
            "depth": 0,
            "timestamp": "2025-01-26 13:57:30",
            "replies": [
                {
                    "author": "shadowyartsdirty2",
                    "body": "Ironically people rejected universal basic income in the US despite knowing that Ai was advancing now more jobs are being replaced by Ai and those exact same people are now interested in universal basic income. Oh well humanity is good at shooting itself in the foot.",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2025-01-26 16:26:07",
                    "replies": [
                        {
                            "author": "Alchemyst01984",
                            "body": "It might be a human thing, but many of us can't look passed what's directly in front of us. It's understandable, but at the same time frustrating. It's why education is so important. Our country wouldn't have outlawed black people from getting one for so long if it wasnt",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-01-26 16:35:10",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dart000",
                    "body": "Well, that's not going to happen. Humans are way too greedy for that, especially now.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-26 15:58:09",
                    "replies": [
                        {
                            "author": "Alchemyst01984",
                            "body": "It may not happen. I will keep pushing for it though",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-01-26 16:04:11",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Downtown-Tomato2552",
            "body": "So does anyone have sources from \"AI Experts\" that discuss this?\n\nI'm not particularly young and thus have gone thru several technology waves. For each of those I could see the \"alternative\" job and benefit. For instance while PCs eliminated jobs if also made many more and made most people far more productive. \n\nAI in conjunction with automation advancements is the first technology that I dont see the \"alternative\". In short I can't see any job or job skill that this combination can't do and pretty much in every case can do better than even the most skilled human labor. \n\nI'm by no means an AI expert, which is why id like to see this exists discuss this topic. \n\nId like to know if I'm good or whether I should be investing my retirement funds in some acreage where I can grow my own did till I die.",
            "score": 40,
            "depth": 0,
            "timestamp": "2025-01-26 11:45:25",
            "replies": [
                {
                    "author": "DarkExecutor",
                    "body": "This is exactly how AI will work as well.  It will eliminate some jobs, but people will need actual workers to input the data.\n\nIt's like that joke where the mechanic charges $10 to swing a hammer but also charges $9990 for knowing where to swing it",
                    "score": 34,
                    "depth": 1,
                    "timestamp": "2025-01-26 13:18:40",
                    "replies": [
                        {
                            "author": "Downtown-Tomato2552",
                            "body": "Why can't AI input the data? The assumption here is that only humans will be able to discover new data and I think that is a false assumption. \n\nOnce the model has an understanding of the tools used to collect new data, discover new data, which I think is not far away and may already be happening, no need for humans to enter data.",
                            "score": 18,
                            "depth": 2,
                            "timestamp": "2025-01-26 14:12:53",
                            "replies": [
                                {
                                    "author": "DarkExecutor",
                                    "body": "Because how do you know if it's right?  Relying on AI to always tell you the truth is dangerous",
                                    "score": 14,
                                    "depth": 3,
                                    "timestamp": "2025-01-26 14:36:51",
                                    "replies": [
                                        {
                                            "author": "ImpressiveFishing405",
                                            "body": "You could definitely say the same for humans too",
                                            "score": 17,
                                            "depth": 4,
                                            "timestamp": "2025-01-26 14:39:43",
                                            "replies": [
                                                {
                                                    "author": "Defiant_Homework4577",
                                                    "body": "Exactly. With humans you have accountability and a chain of blame. How are you going to blame an AI?",
                                                    "score": 11,
                                                    "depth": 5,
                                                    "timestamp": "2025-01-26 18:08:57",
                                                    "replies": [
                                                        {
                                                            "author": "SexyMonad",
                                                            "body": "Tell it that it is wrong, why, and to fix it.\n\nIt’s what they would tell the humans to do.  But without all the pesky firing and hiring and human emotional nonsense.\n\nAI slaves never tire, or resist.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-01-27 14:12:21",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DarkExecutor",
                                                    "body": "Except that we have checks in place to ensure that humans don't mess up, mainly cross verification",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2025-01-26 18:06:49",
                                                    "replies": [
                                                        {
                                                            "author": "Downtown-Tomato2552",
                                                            "body": "And why couldn't you have two different AI agents based off of different model sets during the same thing? Essentially human cross checking is nothing more than two different AI agents. The difference would be that the AI agents could purposefully be created to cross check, eliminating all the human failures.",
                                                            "score": -1,
                                                            "depth": 6,
                                                            "timestamp": "2025-01-26 18:54:54",
                                                            "replies": [
                                                                {
                                                                    "author": "DarkExecutor",
                                                                    "body": "When it happens, I'll believe it. For now, all AI work needs to happen with a human handled",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-01-26 19:03:22",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Downtown-Tomato2552",
                                                                            "body": "I'm not saying it will happen, I just can't come up with any reason it can't happen. \n\nThis is what happens for pretty much any path I go down. \n\nWhich was the rain for the post. \n\nEither I'm missing something that will prevent this from happening... Or it's going to happen.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-01-26 19:16:04",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Admirable-Leopard272",
                                                                                    "body": "It definitely will happen. People are majorly in denial",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-01-27 10:42:24",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "vulpix_at_alola",
                                                                                            "body": "It will happen, for sure. But not with the AI technology we have right now. Ironically a paper by apple has pretty much proven the AI we have right now cannot think. It can really only memorize. When we have AI that can actually learn, and not just memorize, that's when this will happen.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2025-01-28 05:04:24",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Fearless_Hunter_7446",
                                                                            "body": "Have you somehow missed the speed that AI is developing in? It could barely draw humans 6 months ago, now they do so accurately.\n\n\"for now\" may just be the coming week.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-01-28 07:39:54",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "At some point, the AI was informed by the human (even an amalgamation of one), and so its correctness is only as correct as a person allowed them to be\n\nThe source is the problem. It’s a human source\n\nYou’re assuming an AI is only taking the best and correct information to impart on its users, but instead it’s taking the best interaction with a human and running probability weighted trash through the interaction. What if the interaction itself is wrong?\n\nWe know AI will provide any answer, hallucinate an answer, because it recognises that the interaction can’t be completed or fulfilled without an answer.\n\nThe human failure is thinking there is an answer, or an answer that can be answered with information in a particular format (when the truth might lay outside that format) and we humans would have no way to correct this, so the AI is just stuck giving us bad answers because it doesn’t know that it’s not giving us what we want",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-01-27 04:44:12",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Downtown-Tomato2552",
                                                                            "body": "At this point humans are informed by humans so essentially  everything you said applies to humans as well. Sure if we decide to limit AI to certain data sets we will then also limit it to answers within that data set or some extrapolation of an answer from that data set. Humans are no different. \n\nConsidering the rapid advanced in automation I also think it's wholly possible that AI can and will likely start to gather information outside what humans give to it in the same way that a human gathers information from its surroundings.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-01-27 17:57:16",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "5TP1090G_FC",
                                                    "body": "Don't trust a lawyer, completely. As if they have access to relevant data to argue you're case with \"with reasonable ,    \"  reasonable doubt according to whom, what law. According to Dubai, I can now marry your 9 year old daughter according to their law. In America that \"maybe considered\" rap of a minor. Not completely sure on that mind you.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-01-26 20:13:20",
                                                    "replies": [
                                                        {
                                                            "author": "5TP1090G_FC",
                                                            "body": "What, person \" of reasonable mind \" would ever consider that acceptable. Very confusing judgment",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-01-26 20:16:11",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Downtown-Tomato2552",
                                            "body": "One of the big concerns with AI right now is that the \"miss information\" available to the models is growing faster than the correct information. \n\nCurrently that information is from humans. \n\nFurther more given a set of tools to gather information, which is less biased, humans or a computer? Given a set of tools which is less likely to make a mistake, humans or a computer? Given a set of tools which is less likely to be misled by misinformation, Ego and internal gaps of knowledge, humans or computers?\n\nThe data collected by AI would likely not only be less biased but also more correct.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2025-01-26 14:56:37",
                                            "replies": [
                                                {
                                                    "author": "IGnuGnat",
                                                    "body": "Yes, but it is starting to appear as if they may find new ways to curate the data, letting AI learn by accessing massive poorly curated data may be less efficient than feeding it carefully curated, organized data in smaller amounts. Humans are still likely to make mistakes in curation, nothing is perfect.... yet",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-01-26 22:15:44",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "capndiln",
                                            "body": "As long as the cost of a wrong action by the agent is less than the cost of using a human, it's not a problem.",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2025-01-26 18:22:35",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Mondkohl",
                                    "body": "Because the AI training the AI generates mostly nonsense. The skill with AI comes with knowing how to coax it into generating the correct response to any given input. If you don’t control the input data, you can’t reliably control the output data.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2025-01-27 00:09:16",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Otterswannahavefun",
                            "body": "It’d also going to generate jobs in things like green energy and chip manufacturing in the US.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-01-26 19:37:52",
                            "replies": []
                        },
                        {
                            "author": "5TP1090G_FC",
                            "body": "I like that joke, I've used it a few times before.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-01-26 20:06:42",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TFenrir",
                    "body": "It's hard to pin down where AI experts actually are. You can see a lot on Twitter - actual researchers at these big companies, talking about research papers - but also expressing their personal feelings on the topic. \n\nThere are places like LessWrong, where AI safety and capabilities have been discussed by researchers and scientists, as well as random smart people, often more with a focus on what the future will look like, what safety considerations can be put in place - if at all any? \n\nIt's hard to really pin down one place where these discussions take place, but as someone who has made this topic a... Hobby, I would in my (probably very bias) opinion say that the vibe is that everyone is thinking we are 3-5 years away from AI that can do anything on a computer a human can do, better. Everything from software development, to video editing, to AI research. \n\nNot 100% of the researchers, but I would say the majority, and that shift from minority to majority was sudden and recent. \n\nI think if you want to see what those particular researchers would probably say is how the next few years look like -\n\nwww.situational-awareness.ai\n\nI keep sharing this to people who are interested enough to want a place to start researching the topic. It was written by an AI safety researcher who was fired from Openai for purportedly being too loose with his lips. Take note that this was written in June of last year, and its predictions on how much would be earmarked for ai datacenters seemed very out there, even to the enthusiasts with their finger on the pulse.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-01-26 15:17:01",
                    "replies": [
                        {
                            "author": "Downtown-Tomato2552",
                            "body": "Thank you very much for the information and I will check it out. \n\nSeems that unlike historical technology introductions where physical labor was replaced, this is the first time intellectual labor is being replaced. \n\nThe 3 to 5 year number does not sound unrealistic to me. After that another 5 to 10 automation to advance to a point where it can physically do anything a human can. Another number of years for the implementation phase and then what? \n\nThe \"then what\" part is what id like to see discussion around.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-01-26 16:03:25",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "I’ve also seen many technology bubbles in my career (late 50s, electrical engineer).\n\nAI really feels to me like it’s firmly in the hype/bullshit phase of the new technology cycle, with so much invested by so many people that they’re afraid to point out the basic flaws; AI promises to take over many jobs and make people redundant, but it just can’t do that, and won’t.\n\nEventually somebody will notice. I expect a huge crash in the AI sector in a year or 2.\n\nThat’s not to say AI isn’t useful; it definitely has potential as a force multiplier for some tasks, but I just don’t see it as the apocalyptic technology being projected.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-01-26 18:02:23",
                    "replies": [
                        {
                            "author": "Otterswannahavefun",
                            "body": "So far the only real commercial use they’ve found is helping customer service agents draft responses faster - but a real agent still needs to read and edit / approve before hitting send.  No industry has yet replaced humans with it.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-01-26 19:40:27",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "5TP1090G_FC",
                    "body": "When, was the last time you killed a cow, you did eat a hamburger within the past 30 day's yes. Just asking",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-26 20:05:42",
                    "replies": []
                },
                {
                    "author": "Pretend_Health_563",
                    "body": "Never thought about it like that. Very interesting",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-26 21:22:52",
                    "replies": []
                },
                {
                    "author": "PumpJack_McGee",
                    "body": "If the companies that employ AI still have some shred of sense, there will be at least a few years where  people verify and vouch for the results that AI spews out.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-27 02:14:35",
                    "replies": []
                },
                {
                    "author": "Clear-Inevitable-414",
                    "body": "Idk. Have you seen how social media has decreased the collective productivity of our society?  Not to mention I hate being my own damn secretary now because of PCs",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-27 05:23:33",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "I worked on a project that reduced analyst headcount by 25% by implementing - you guessed it - AI",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-27 06:45:07",
                    "replies": []
                },
                {
                    "author": "nitros99",
                    "body": "The only jobs that will be created are for professional Luddites to go around and smash the computers running AI. Joking, not joking.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-28 09:27:40",
                    "replies": []
                }
            ]
        },
        {
            "author": "circ-u-la-ted",
            "body": "Sure, just like motor vehicles removed the ability to access wealth from horse breeders and carriage drivers.  How is AI supposed to be different from every other technological advance ever?",
            "score": 11,
            "depth": 0,
            "timestamp": "2025-01-26 17:48:08",
            "replies": [
                {
                    "author": "Defiant_Homework4577",
                    "body": "Because people still needed to manufacture motor vehicles. With every new invention, you needed people to maintain and produce the said invention and then use that invention to do produce other things. IF (big IF) AI can automate everything, as in maintaining it self, producing it self, and producing new things with inputs directly from the wealth creators, that effectively takes out everything in the middle.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-01-26 18:25:59",
                    "replies": [
                        {
                            "author": "Infinite-Gate6674",
                            "body": "That’s the same short sightedness that caused the us government to go to war with the automakers. “It will put all the horse and buggy people out of business!” Like for serious, that was the argument against cars.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-01-27 06:34:58",
                            "replies": [
                                {
                                    "author": "Admirable-Leopard272",
                                    "body": "What you don't get is....WE are now the horses",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-01-27 10:43:55",
                                    "replies": []
                                },
                                {
                                    "author": "bulet13",
                                    "body": "You're thinking of the analogy wrong.\n\nHumans are the horses. If AI reaches the level the tech companies share trying to get it to, then humans will be the ones being replaced. \n\nOnly those with compute power will survive",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-21 13:38:22",
                                    "replies": [
                                        {
                                            "author": "Infinite-Gate6674",
                                            "body": "And then what? Mass death and panic? Seems unlikely",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-21 14:42:39",
                                            "replies": [
                                                {
                                                    "author": "bulet13",
                                                    "body": "What happened to horses after the car was invented?",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-21 14:47:04",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Embarrassed_Emotion7",
                                                    "body": "world becomes a computer. merge or go back to indigenous life. yes",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-05 18:35:27",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "icnoevil",
            "body": "The primary objective of capitalism is to transfer wealth from those with the least of it to those who already have more than they know what to do with it.",
            "score": 27,
            "depth": 0,
            "timestamp": "2025-01-26 13:07:47",
            "replies": [
                {
                    "author": "tommytucker7182",
                    "body": "The Matthew principle",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-01-26 17:47:58",
                    "replies": []
                },
                {
                    "author": "interwebzdotnet",
                    "body": "Lol. 🤡",
                    "score": -17,
                    "depth": 1,
                    "timestamp": "2025-01-26 13:22:30",
                    "replies": []
                }
            ]
        },
        {
            "author": "3rdtimes-the-charm",
            "body": "Tax AI and while we’re ur at it Tax robots. \n\nAutomation has been for many companies a huge tax break for decades. But it only destroyed blue collar jobs. Now it’s the professional jobs that are disappearing. We won’t retrain our way out of this revolution.",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-01-26 18:03:22",
            "replies": []
        },
        {
            "author": "Rivercitybruin",
            "body": "How close are they to AI mimicking talking a knowledgible real person?\n\n  \nLike talking to your stockbroker and thinking it is real person.. NOT \"wow, that computer almost sounds like a human",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-01-26 13:15:39",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Think about it. When the rich can automate everything that they consume to no longer require workers, why would they still give us any money at all instead of just letting our population die out and having their fully automated little island. They won't just keep giving us money and selling things to us once they don't need us. The only people who will be able to live are those who can afford to buy the capital that builds things. Invest invest invest if you can.",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-01-26 14:17:25",
            "replies": []
        },
        {
            "author": "notwyntonmarsalis",
            "body": "Jobs are going to change.  Jobs will be created.  The OP is an idiot for posting this.",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-01-26 17:11:57",
            "replies": [
                {
                    "author": "Cuore_Lesa",
                    "body": "I mean, I agree automation has been a thing since humans started making tools. No shit AI would be used for automation too and new jobs will inevitably be created due to that.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-01-26 19:24:58",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "The downfall started with the printing press.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-01-26 16:22:42",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "This is so clearly the purpose that they even say it. You do not get the kind of investment and continuous investor hype - especially so early in a technology's overall lifespan, if they don't clearly understand that the purpose here is something that phenomenally benefits the wealthy. \n\nIt is an incredible shame that, through rampant IP theft, lack of regulation, and pure greed we are eliminating outlets for human creativity and effectively deleting the best pathways for upward mobility in our society.\n\nAll so some rich guys can avoid paying people to do work",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-01-26 11:43:43",
            "replies": [
                {
                    "author": "Embarrassed_Emotion7",
                    "body": "there is the argument to turn the world into a computer before the sun burns it up. very esoteric but in theory its logically the best use of resources on the planet. counters human instinct tho which is why only the sort of sociopathic level autistics are pushing for it",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-05 18:46:01",
                    "replies": []
                },
                {
                    "author": "interwebzdotnet",
                    "body": ">All so some rich guys can avoid paying people to do work\n\nIn the 1000s of years of human civilization, we have continually advanced out capabilities. This is just one more of those steps with many more to come. It's not some global conspiracy, it's how humans evolve.\n\nRich people will get richer from it, yes. But so will non rich people like myself who have seen their retirement best eggs grow.\n\nSome jobs and businesses will go away, and other jobs and businesses that we literally can't fathom today will come from it. People will need to learn and grow with the technology, so it's not without effort.\n\nThis is not unlike the buggy whip manufacturers opining that cars are bad 100+ years ago. I don't want to live in a world where we live in fear of advancing for the greater good just because a few rich people will get more wealthy because of it.\n\nAnd yes, there is an entire conversation to be had about security and privacy with AI, but that doesn't change the core of what I'm saying.",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2025-01-26 12:24:08",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Do you really not think that creating a technology which is explicitly designed to be able to replace human thinking is different from introducing a new method of transportation? That creating a tool which is meant to do all the things humans can do, better, cheaper and faster, is actually very much different than anything that has ever happened before?\n\nUntil now, no technology has disrupted one fundamental truth - the rich depend on the poor to survive. Every bite of food they eat, every article of clothing they wear, the homes they live in, the people who keep them safe from angry mobs - all working people.\n\nThe future of AI is that all of these people are replaced my machines that are owned by the rich and for the first time the fundamental power relationship is changed and ordinary working people no longer have any power, even en masse.\n\nI'm not sure how you can possibly both champion the possibility of this technology to replace all current skilled and creative labor in one breath, and in the next say that somehow humans will be able to find some other way to survive when every avenue to do so has a machine who will work longer, faster, harder, with no breaks, for no salary.\n\nIt does not advance the greater good to eliminate the means that people use to support themselves. If you want to introduce this specific technology you must first create a world where people do not need jobs to survive.",
                            "score": 7,
                            "depth": 2,
                            "timestamp": "2025-01-26 12:29:25",
                            "replies": [
                                {
                                    "author": "JacobLovesCrypto",
                                    "body": "Blue collar jobs pay well and aren't easily replaced by AI,its great time to be a blue collar worker",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-01-26 12:56:27",
                                    "replies": [
                                        {
                                            "author": "justaguywithadream",
                                            "body": "I feel like this is a naive take.\n\n\nWhere do you think white collar workers are going to go?\n\n\n\n\nAlmost anybody doing a white collar job can be trained to do a blue collar job.\n\n\nWhat happens when 3 or 10 or 20 million white collar jobs are lost? Do you think the next generation of kids are going to go get STEM or accounting or business degrees instead of going straight in to the trades?\n\n\nWhat happens when there are 5000 applications for every trade job? When there are 6 year long waiting list to enter trade school because that's all there is?\n\n\nWages drop to minimum wage. Unpaid internships become common. Every Tom and Harry starts a plumbing business and will come and unclog your drain for $19.99. Mandatory unpaid overtime because if you don't, there are 160 guys waiting to take your job.\n\n\nThere is no barrier to entry in the trades. And I'm not saying the trades aren't skilled. I'm saying the majority of white collar workers, and people in general, can learn the trades via relative short trade schools and OJT. \n\n\nThe trades will be flooded and suddenly it's not going to be so great anymore.\n\n\n\n\nEditing to add:\nThe same is going to happen to nursing and other medical fields jobs that don't have strong moats. Similar to what happened to software jobs in the last 10 years, but on a waaaaay bigger scale.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-01-26 22:28:58",
                                            "replies": [
                                                {
                                                    "author": "JacobLovesCrypto",
                                                    "body": "No,  most people can't quickly learn a trade or other technical blue collar, there's a reason apprenticeships and licenses are usually 4 year programs.\n\nAnd with more laborers comes more production of goods, maybe we'd finally end the housing shortage.\n\nBlue collar jobs would eventually be replaced by AI too, just blue collar work is a bit safer than a lot of white collar jobs",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-01-26 22:36:36",
                                                    "replies": [
                                                        {
                                                            "author": "justaguywithadream",
                                                            "body": "I don't think it's about how quicky you can learn a trade. It's about it being the only game in town.\n\n\nTrades becomes oversaturated when there is no white collar work left. \n\n\nOversaturated means wages go down to the bottom and working conditions go with them.\n\n\nThere is no way around this.\n\n\nAsk yourself what happens when college degrees and white collar work becomes worthless? People stop going to college and seeking white collar work, and instead start seeking trade schools and blue collar work. And what happens when you have an over supply of labor? Nothing good for the working man.\n\n\nMy only point is that any blue collar worker that feels safe because AI is going to take white collar work first is being naive. Because once white collar work is gone, EVERYONE will be competing for blue collar work.\n\n\nIt's like the whole \"learn to code\" thing that's been thrown around for the last 15 years, except now it's \"learn a trade, and oh yeah, you don't have any other option  and neither does anybody else so good luck!\".",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-01-26 23:41:26",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Deleted",
                                            "body": "A lot of the people who work in tech used to work in blue collar jobs. Then their bodies gave out or they needed more money. If AI can replace doctors, lawyers, and engineers it's also going to replace everyone else. There's a similar race for humanoid robots as there is for AGI. \n\nThey already have the boston dynamic robots doing parts of a fireman's qualification test. \n\nThis technology, if left unregulated, will come for everyone.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-01-26 12:58:45",
                                            "replies": [
                                                {
                                                    "author": "JacobLovesCrypto",
                                                    "body": "Blue collar is a lot further out tho, most all the robotics can only do basic stuff",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2025-01-26 13:51:16",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DarkExecutor",
                                    "body": "Computers replaced human thinking.  Why would AI be different",
                                    "score": -1,
                                    "depth": 3,
                                    "timestamp": "2025-01-26 13:19:35",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "Computers did not replace human thinking. That is not a thing that has occurred. If you think that computers have replaced human thinking, you do not know enough about computers, human thinking, or both.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-01-26 13:38:49",
                                            "replies": [
                                                {
                                                    "author": "DarkExecutor",
                                                    "body": "Calculators are a very simple form of thinking.",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2025-01-26 14:37:26",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "justaguywithadream",
                            "body": "I think this is 100% unlike the buggy and whip.\n\n\nThis is closer to the effect the discovery and harnessing of fire had on mankind than transitioning from one mode of transportation to another.\n\n\nThis is a not a simple evolution of technology, but an entire paradigm shift of which humans have never seen before (with the exception of maybe fire).\n\n\nAnd I'm not talking about today's AI (which I love and use). I'm talking about tomorrow's AI that is inevitable and will be here sooner rather than later.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-01-26 22:16:12",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "I mean clearly if u own a company you’d rather save on labor 🤣",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-01-26 13:09:07",
            "replies": [
                {
                    "author": "justaguywithadream",
                    "body": "And clearly if you own a company you'd rather rely on AI than using the services of another company. How many B2B companies are going to be made obsolete?\n\n\nThink of all the SaaS companies that can be replaced with AI now. Salesforce talks about how they are not hiring any engineers anymore because AI can do it. But guess what Salesforce, an AI that can replace your engineers (which doesn't exist yet outside of hype) can also replace your entire product and render you obsolete.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-26 22:09:15",
                    "replies": []
                }
            ]
        },
        {
            "author": "-__-zero-__-",
            "body": "I hope a solar flare knocks us back to the Stone Age, then see what your shitty a.i. will do for you then.",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-01-26 13:29:19",
            "replies": [
                {
                    "author": "interwebzdotnet",
                    "body": "Lol you hope millions of people die just so you prove a point?",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-01-26 13:31:00",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Yes",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-01-26 13:42:02",
                            "replies": [
                                {
                                    "author": "interwebzdotnet",
                                    "body": "There are some really shitty people out there if this is a common or acceptable thought.",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2025-01-26 13:43:36",
                                    "replies": [
                                        {
                                            "author": "RuinAngel42",
                                            "body": "I saw a post a few months back of some woman saying she hopes anyone who voted for Trump has their children die and suffer through miscarriages.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-01-27 12:47:14",
                                            "replies": [
                                                {
                                                    "author": "interwebzdotnet",
                                                    "body": "Yeah, it's sickening. As much as I dislike Trump, it's amazing to see that some of his detractors are even more ignorant and evil than even he isn't. It's a race to the bottom and we are coming up to the finish line.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-01-27 12:55:32",
                                                    "replies": [
                                                        {
                                                            "author": "RuinAngel42",
                                                            "body": "Worst part about that post is, almost everyone in the comments were praising her for \"Saying it how it is.\"",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2025-01-27 12:57:36",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Deleted",
                                            "body": "Yes",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-01-26 13:45:02",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Raise_A_Thoth",
            "body": "This is just capitalism. It's all about how the tech is owned and used, and in our case, it's used for owners of capital to benefit over workers. Simple.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-26 21:20:08",
            "replies": []
        },
        {
            "author": "-Snowturtle13",
            "body": "You mean like those jobs that illegal immigrants  will be leaving vacant?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-26 21:55:14",
            "replies": []
        },
        {
            "author": "IGnuGnat",
            "body": "In the same way that even third world workers have a cell phone (compared to a few decades ago it's like having a cloud connected supercomputer at your fingertips) the third world will soon have a swarm of intelligent AI specialists at their fingertips.\n\nAs a cloud engineer, current AI has helped me to learn faster and learn new skills faster, increasing my reach. yes it will replace many of my current job functions. Hopefully it will open up new paths forward and extend the reach of all humanity, not just the wealthy.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-26 22:20:53",
            "replies": []
        },
        {
            "author": "SomethingWrong2016",
            "body": "Mars! I mean Greenland,",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-26 22:44:55",
            "replies": []
        },
        {
            "author": "hotdogtuesday1999",
            "body": "We are the crowdsourcing troubleshooters perfecting our own demise, and paying for the right to do it in the matter of subscription services. \nAfter years of dystopian fiction, this was not the one I had on my bingo card.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-26 23:19:37",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "The newest \"immigrant\"",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-27 01:19:34",
            "replies": []
        },
        {
            "author": "LittleBeastXL",
            "body": "At least they're not going to exploit workers by employing them without paying a living wage, so it's a win-win situation.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-27 05:09:10",
            "replies": []
        },
        {
            "author": "Ok_Post667",
            "body": "I feel like I've been screaming this for years.\n\nHowever, I believe it's white-collar jobs at risk most. \n\nIt would benefit everyone to look into picking up a trade skill, because it'll be a little bit until we have robots making house calls to fix plumbing or electrical issues, fixing machinery, etc.\n\nI'm in advanced tech, and while I'm heavy into the AI realm, I'm also interested in getting involved with things like woodworking and blacksmithing.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-27 17:15:13",
            "replies": []
        },
        {
            "author": "Savings-Alarm-9297",
            "body": "Labor is the cost of everything",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-27 21:58:54",
            "replies": []
        },
        {
            "author": "DiscontinuTheLithium",
            "body": "All this is going to do is speed up the run to socialism and eventually communism. We need a hyper-capitalistic society to motivate people to build the tools needed to sustain the population. Capitalism is a necessary step to economic freedom. It's a necessary step to a stateless society or how else are the infinite feeding machines going to be built? You can hate capitalism but it's very effective at innovation and productivity. \n\nMany think we can skip this step but it's prudent we don't. Money becomes worthless when hoarded and not spent. If only 6 guys have all the money, what even is money? If only 6 guys own all of the infinite feeding machines, who are they gonna pay once the money to hoard is worthless?\n\nNot to say it won't get worse before it gets better. But currently, all directions lie towards that economic singularity. It's inevitable.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-26 13:30:01",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "All those 6 figure white collar jobs are gonna go bye bye",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-26 18:41:57",
            "replies": [
                {
                    "author": "justaguywithadream",
                    "body": "Yep, which in turn is going to make all the blue collar jobs ultra competitive as millions of  displaced white collar workers enter trade school and apply for entry level positions and apprenticeships.\n\n\nIt all trickles downs.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-26 22:32:44",
                    "replies": []
                }
            ]
        },
        {
            "author": "Rivercitybruin",
            "body": "Yes i agree",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-01-26 13:13:45",
            "replies": []
        },
        {
            "author": "jirote",
            "body": "Dumbest take from people who refuse to adapt to an evolving world. Darwinism at its best.",
            "score": -7,
            "depth": 0,
            "timestamp": "2025-01-26 12:41:29",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Using Darwinism to reflect human social aspects…like the fucking Nazis did?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-26 13:41:52",
                    "replies": []
                }
            ]
        }
    ]
}