{
    "post_title": "Google tells employees why it’s ending diversity, equity, and inclusion (DEI) hiring goals",
    "post_timestamp": "2025-02-06 10:12:49",
    "last_comment_timestamp": "2025-03-11 19:46:32",
    "time_difference": "33 days, 9:33:43",
    "comments": [
        {
            "author": "n0neOfConsequence",
            "body": "They also abandoned their, \"do no evil\" pledge by changing their position on the use of Google technology  for mass surveillance and military applications. Also, money.",
            "score": 389,
            "depth": 0,
            "timestamp": "2025-02-06 11:37:58",
            "replies": [
                {
                    "author": "Hoopy223",
                    "body": "I bet they’ve cooperated forever they are just more honest now.",
                    "score": 75,
                    "depth": 1,
                    "timestamp": "2025-02-06 12:19:43",
                    "replies": []
                },
                {
                    "author": "Naoki38",
                    "body": "They abandoned that many years ago.",
                    "score": 10,
                    "depth": 1,
                    "timestamp": "2025-02-07 07:06:45",
                    "replies": []
                },
                {
                    "author": "LilPonyBoy69",
                    "body": "I think I remember them officially changing it years back from \"Don't be evil\" to \"do the right thing\" lol",
                    "score": 20,
                    "depth": 1,
                    "timestamp": "2025-02-06 20:50:15",
                    "replies": []
                }
            ]
        },
        {
            "author": "Aggressive_Staff_982",
            "body": "That's a long way of saying \"money\".",
            "score": 789,
            "depth": 0,
            "timestamp": "2025-02-06 10:14:55",
            "replies": [
                {
                    "author": "Dragonfly-Adventurer",
                    "body": "Now go back, why did they start the DEI initiative?  \n\nOh right also money.  \n\nMaybe corporations aren't interested in the right thing.  Just money.  Crazy.",
                    "score": 402,
                    "depth": 1,
                    "timestamp": "2025-02-06 11:40:17",
                    "replies": [
                        {
                            "author": "Van-garde",
                            "body": "It’s crazy that everyone knows this, but it doesn’t hurt commercialism or brand loyalty. \n\nSoon babies will be born with knowledge of ‘the bottom line,’ and they’ll still be captured by advertising.",
                            "score": 68,
                            "depth": 2,
                            "timestamp": "2025-02-06 11:57:02",
                            "replies": [
                                {
                                    "author": "Gingrpenguin",
                                    "body": "Even worse if you pointed out a few months ago that this was skin deep you'd be at best down voted, or called a racist bigot and in many cases banned from subs for saying it.\n\nAnd it took them what? 3 days of it being unpopular to completely undo and reverse.",
                                    "score": 16,
                                    "depth": 3,
                                    "timestamp": "2025-02-06 15:45:11",
                                    "replies": [
                                        {
                                            "author": "Van-garde",
                                            "body": "To be clear of my own position, I find strategies of inclusion to be the way forward. Necessary to build social capital, accurate demographic representation in government, which are both prerequisites to equitable distribution, which is my preference for our direction. \n\nBut you're right about the superficial nature, in many (probably most) cases of \"corporate sociopolitical activism;\" it's social justice, twisted to serve as a means of profitability:\n\n[https://en.wikipedia.org/wiki/Corporate\\_sociopolitical\\_activism](https://en.wikipedia.org/wiki/Corporate_sociopolitical_activism)\n\n[https://en.wikipedia.org/wiki/Social\\_capital](https://en.wikipedia.org/wiki/Social_capital)\n\n[https://en.wikipedia.org/wiki/Distributive\\_justice](https://en.wikipedia.org/wiki/Distributive_justice)",
                                            "score": 19,
                                            "depth": 4,
                                            "timestamp": "2025-02-06 15:53:04",
                                            "replies": [
                                                {
                                                    "author": "HermitJem",
                                                    "body": "I first encountered Corporate Social Responsibility ...22? years ago. Mom's company went to paint a home for spastic children\n\nI immediately queried the sincerity of the concept/application. Really? Paint? Of all things, you felt they needed new paint?",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-07 03:11:18",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "dustindubya",
                                                    "body": "Social capital, accurate demographic representation, Equitable distribution. Otherwise known as judging people based on characteristics they have no controll over (racism and sexism). Sounds like utopia.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-07 08:54:51",
                                                    "replies": [
                                                        {
                                                            "author": "Van-garde",
                                                            "body": "You’re crazy manipulative.\n\n“The unrealistic sound of these propositions is indicative, not of their utopian character, but of the strength of the forces which prevent their realization.”",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-07 10:10:47",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "arandomstringofkeys",
                            "body": "Even politicians and any institution. I work at a public university in a swampy red state. In 2020 the governor and board of governors wanted us all to embrace and flaunt DEI initiatives because it was the politically popular thing to do. Two years later they wanted to erase it all because it was the politically popular thing to do. They don’t actually care if we implement it or not, they just don’t want us to talk about it because that’s what could cost them moneys.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2025-02-06 14:49:40",
                            "replies": []
                        },
                        {
                            "author": "Hertock",
                            "body": "Pssst, you’re getting on a blacklist for this. Musky man is gonna getcha",
                            "score": 14,
                            "depth": 2,
                            "timestamp": "2025-02-06 11:46:25",
                            "replies": [
                                {
                                    "author": "Van-garde",
                                    "body": "I’m trying to ensure I’m on the blacklist. All my homies are on the blacklist.",
                                    "score": 19,
                                    "depth": 3,
                                    "timestamp": "2025-02-06 11:57:47",
                                    "replies": [
                                        {
                                            "author": "guppie365",
                                            "body": "All the cool kids are on the blacklist.",
                                            "score": 12,
                                            "depth": 4,
                                            "timestamp": "2025-02-06 12:12:39",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "COSMO3170",
                            "body": "We all Need to be honest with ourselves, The Enture thing with DEi Is The \"The Good Ole Anglo Saxton Boys Club\" at the Office Only! No Women Send them back home, No Black or brown women, Nk Lgbtqia reguardless if their Qualified and No Persons with Disabilities, that they would have to spend money to make accommodations for. This is the Handmaiden Tail starting all over again. It's BS. ",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-13 17:26:32",
                            "replies": []
                        },
                        {
                            "author": "tlopez14",
                            "body": "What is exactly is DEI? Why are we mad it’s gone and what does it do?\n\nEdit: love how I’m just getting downvoted without anyone actually responding. Is DEI that hard to defend? Surely someone out there has a good answer.",
                            "score": -6,
                            "depth": 2,
                            "timestamp": "2025-02-06 17:49:05",
                            "replies": [
                                {
                                    "author": "Sabin_Stargem",
                                    "body": "Diversity, equity, inclusiveness.\n\nTraditional hiring practices tends to be subconsciously rigged to favor the culture and identity of the person who is evaluating hires.  By adding a bit of extra red tape to the process, a broader range of candidates can be considered for the position.\n\nWhile less efficient, it also allows an organization to get a better pick of people to join their ranks.  Traditional hiring practices tend to overlook the more capable candidates, since cultural blinders tend to favor certain styles of name, background, or ethnicity.  DEI mitigates the issue.",
                                    "score": 12,
                                    "depth": 3,
                                    "timestamp": "2025-02-06 20:41:41",
                                    "replies": [
                                        {
                                            "author": "tlopez14",
                                            "body": "So sorta like a hiring quota? How does this benefit poor and middle class white folks?",
                                            "score": -12,
                                            "depth": 4,
                                            "timestamp": "2025-02-06 20:50:26",
                                            "replies": [
                                                {
                                                    "author": "optimisticollie",
                                                    "body": "The thing is, it isn't meant to be a quota and people who interpret it as such are misunderstanding the purpose. DEI initiatives are meant to help get qualified minorities (people of color, people with disabilities, women) who historically have faced hiring discrimination and bias to the table. That's it. And it still ends up with skewed hiring ratios against minorities, but not as bad as before. People in DEI positions actually tend to be OVERQUALIFIED, because of the ridiculous high standards placed upon them.",
                                                    "score": 11,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-06 21:29:01",
                                                    "replies": [
                                                        {
                                                            "author": "becomejvg",
                                                            "body": "It absolutely is meant to be a quota. \n\nHow would any company know whether or not their DEI \"program\" is effective without a number before in comparison to a number after?\n\nThe mental gymnastics people go through to defend the indefensible is amusing to watch. \n\nSad, too.",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-07 10:47:53",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "tlopez14",
                                                            "body": "That might sound nice in theory, but it doesn’t line up with reality. I work in government, and I’ve seen firsthand how minority candidates get extra points on things like firefighter and police exams just for being a minority. This isn’t some made-up conspiracy, it’s literally how the system actually works. \n\nIf DEI is supposed to help qualified people, why does it give an automatic leg up to someone based on their race or gender instead of their actual ability or need? That’s not fixing discrimination. It’s just creating a different kind of unfairness. A poor white kid doesn’t get those extra points, even if they’re struggling just as much or more. How is that fair?",
                                                            "score": -13,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-06 21:35:33",
                                                            "replies": [
                                                                {
                                                                    "author": "optimisticollie",
                                                                    "body": "You seem to already have a very specific view about what DEI is, so why ask what it is in the first place if you apparently already knew? I feel as if you entered into this in bad faith with the hope of being able to 'hah! Gotcha, lib!' someone with an example that is not actually representative of the whole.",
                                                                    "score": 8,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-02-07 02:44:03",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sabin_Stargem",
                                                                            "body": "This is my impression as well.  \n\nStill, there are people other than Tlopez who read the comments.  They will judge our words.  Here's hoping that we have made clear that DEI is a moral and good thing.",
                                                                            "score": 4,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-02-07 07:41:37",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Sabin_Stargem",
                                                    "body": "I didn't mention a quota.  Where the heck did you get that from?\n\nDEI is intended to include disabled people and whites as part of the candidate pool.   Without DEI, a white person could have lower chances at being hired, despite being equally qualified.\n\nA white Canadian hiring manager could be biased in favor of people who have a French name, for example.  DEI removes that factor.",
                                                    "score": 5,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-06 21:23:25",
                                                    "replies": [
                                                        {
                                                            "author": "tlopez14",
                                                            "body": "I brought up quotas because that’s basically what DEI feels like in practice. Maybe it’s not an official quota, but when hiring decisions are based on race or gender instead of actual qualifications or need, how is that any different?\n\nTake a poor white kid from Appalachia who’s barely getting by. He’s probably not getting any priority, but a wealthy Black kid from the suburbs might, just because of race. How does that make sense? If the goal is fairness, it should be about helping the people who need it the most, not ticking diversity boxes. It’s hard to see how DEI actually helps working class folks across the board.",
                                                            "score": -3,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-06 21:30:37",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Individual-Fee-5639",
                                                    "body": "Why specifically \"poor\" and \"middle class white folks\"? Are they more important than anyone else? Your comment is lame.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-07 06:15:36",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Individual-Fee-5639",
                                    "body": "You're being downvoted because you come across as privileged or ignorant. Mostly ignorant, I think.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2025-02-07 06:17:10",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Critical-Long2341",
                            "body": "Maybe DEI isn't the right thing. Crazy.",
                            "score": -13,
                            "depth": 2,
                            "timestamp": "2025-02-06 14:45:55",
                            "replies": []
                        },
                        {
                            "author": "jakeofheart",
                            "body": "DEI is about attracting investors but ticking customers off.",
                            "score": -19,
                            "depth": 2,
                            "timestamp": "2025-02-06 14:54:36",
                            "replies": [
                                {
                                    "author": "NtheLegend",
                                    "body": "What customers are ticked off about DEI except racists and shitheads?",
                                    "score": 17,
                                    "depth": 3,
                                    "timestamp": "2025-02-06 15:36:30",
                                    "replies": [
                                        {
                                            "author": "jakeofheart",
                                            "body": "So… how do you explain that all those mega corporations are rolling back on DEI?",
                                            "score": -4,
                                            "depth": 4,
                                            "timestamp": "2025-02-06 20:05:30",
                                            "replies": [
                                                {
                                                    "author": "NtheLegend",
                                                    "body": "Because they're pandering to racists and shitheads.",
                                                    "score": 13,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-06 20:19:10",
                                                    "replies": [
                                                        {
                                                            "author": "jakeofheart",
                                                            "body": "DEI has never really been an end to itself. It was just some form of lip service to virtue signalling by corporations. You should be angry at them instead, for having been hypocritical.\n\nThe main purpose was to look like “*ethical*” businesses to attract investor’s money.\n\nBut businesses were already doing a good job of hiring top performers. You can’t hire top performers if you need to meet quotas.\n\nJust look at the American NBA ([Richard, 2023](https://www.tidesport.org/_files/ugd/c01324_abb94cf8275d49499e89fa14f0777901.pdf)):\n\n* 70.4 percent black players\n* 17.5 percent white players\n* 2.2 percent Latino players of any race\n* 0.2 percent Asian players.\n\nThere would not be as much money in it if they had to apply DEI and have a proportional representation of the population ([US Census Bureau](https://www.census.gov/quickfacts/fact/table/US/PST045224)):\n\n* 75.3% White alone\n* 13.7% Black alone\n* 6.4% Asian alone, percent\n* 1.3% American Indian and Alaska Native alone \n\nWhat we should definitely address is the inequality of opportunities, but it starts from childhood. A kid from a single parent household will have a harder time to fit academically than a kid from a double parent household.\n\nThat’s where it all begins.",
                                                            "score": -2,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-06 20:36:27",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CoastPuzzleheaded513",
                    "body": "Vote with your service choices. They are only as useful and powerfull as you make them. Stop using them. YeH Google is a tough one to stop using. But we do have choices, they may not be as convenient, but they work. Just use their free stuff. But I'd stop using Gmail for anything private. Maybe find a foreign secure data protected service abroad. Check European providers,  their Data Protection Laws are muuuuch better than US ones.",
                    "score": 10,
                    "depth": 1,
                    "timestamp": "2025-02-06 14:44:05",
                    "replies": [
                        {
                            "author": "dustindubya",
                            "body": "That’s how capitalism works. Moral hazard is the way to corporate refinement.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-07 08:56:26",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Hoopy223",
                    "body": "Their stock price is currently 200$ a share iirc\n\nIt’s crazy to me how much money these virtual companies are worth\n\nMeanwhile Ford which has made automobiles for 100+ years is 10$ a share",
                    "score": 19,
                    "depth": 1,
                    "timestamp": "2025-02-06 12:14:27",
                    "replies": [
                        {
                            "author": "Bloodcloud079",
                            "body": "Just a heads up, price per share is a very poor indicator of a company value. Because number of share is not fixed, and companies can merge or split share.",
                            "score": 30,
                            "depth": 2,
                            "timestamp": "2025-02-06 13:13:55",
                            "replies": [
                                {
                                    "author": "Hoopy223",
                                    "body": "I know that but just look at market cap for example, google is like 2trillion, it’s mind boggling.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2025-02-06 13:46:36",
                                    "replies": [
                                        {
                                            "author": "LUHG_HANI",
                                            "body": "Ford have to compete. Microsoft, Google and Meta wiped the web to suit themselves.",
                                            "score": 5,
                                            "depth": 4,
                                            "timestamp": "2025-02-06 15:00:17",
                                            "replies": []
                                        },
                                        {
                                            "author": "Bloodcloud079",
                                            "body": "I mean, yeah in this case it still works. Still, poor comparison basis",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-02-06 21:17:39",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PuzzleheadedSlide904",
                            "body": "Working class people don't care about shares",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-02-06 12:34:15",
                            "replies": [
                                {
                                    "author": "Analyzer9",
                                    "body": "It's like there are two kinds of people. One kind hears a song, and says, \"That was lovely\", or \"I did not like that.\" Things along those lines. The other hears it, and wonders, \"How do I take this for myself?\" \n\n\n\nI wonder if it's a condition of birth or environment. Because I feel like as apes, we would have beaten the living shit out of those ones, long before they were able to infect the rest of us with their awfulness.",
                                    "score": 7,
                                    "depth": 3,
                                    "timestamp": "2025-02-06 12:42:15",
                                    "replies": []
                                },
                                {
                                    "author": "Nice_Category",
                                    "body": "That's why they remain working class their whole lives.",
                                    "score": -8,
                                    "depth": 3,
                                    "timestamp": "2025-02-06 12:56:43",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CoastPuzzleheaded513",
                    "body": "Vote with your service choices. They are only as useful and powerfull as you make them. Stop using them. YeH Google is a tough one to stop using. But we do have choices, they may not be as convenient, but they work. Just use their free stuff. But I'd stop using Gmail for anything private. Maybe find a foreign secure data protected service abroad. Check European providers,  their Data Protection Laws are muuuuch better than US ones.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-06 14:44:19",
                    "replies": []
                }
            ]
        },
        {
            "author": "fsactual",
            "body": "Hopefully this will be remembered a few years from now when they try and switch back.",
            "score": 142,
            "depth": 0,
            "timestamp": "2025-02-06 10:39:29",
            "replies": []
        },
        {
            "author": "DragonflyMean1224",
            "body": "I'm happy Costco has a spine and has announced its not\nEnding its policies.  Again doesn't mean Costco is the best but they actually do pay their employees better than most comparable companies.",
            "score": 34,
            "depth": 0,
            "timestamp": "2025-02-06 12:21:01",
            "replies": [
                {
                    "author": "patrad",
                    "body": "DOJ just said they are going after them now because of that",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-02-06 21:33:40",
                    "replies": [
                        {
                            "author": "DragonflyMean1224",
                            "body": "Fruitless. There is nothing wrong with doing what they are doing.",
                            "score": 9,
                            "depth": 2,
                            "timestamp": "2025-02-06 21:44:43",
                            "replies": [
                                {
                                    "author": "lampstax",
                                    "body": "Depends on the policy .. if there's some quota like 20% of workers needs to be a certain race .. or half of the workers must be female .. then I can see them in violation of discrimination laws.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-08 15:38:55",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kendall_Raine",
                            "body": "So much for the free market.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-02-12 13:44:11",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Major-Examination941",
                    "body": "Snapchat as well",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-07 00:59:03",
                    "replies": []
                }
            ]
        },
        {
            "author": "Zealousideal-Math50",
            "body": "It’s honestly pathetic how quickly these companies caved, and I hope ppl don’t forget.\n\nI’ve been involved in hiring and no company I’ve worked for was ever rejecting white men or whatever to fill a diversity quota.\n\nThis DEI panic/hysteria is perpetuated when companies cave because it lends legitimacy to the conservative grievances with it.\n\nPeople are also comfortable throwing DEI around as a substitute for actual slurs now so that’s super cool. 💀",
            "score": 459,
            "depth": 0,
            "timestamp": "2025-02-06 11:01:05",
            "replies": [
                {
                    "author": "wet_nib811",
                    "body": "I think they were just waiting for a opening to cancel it. It was a response to a moment that Corporate America doesn’t want to deal with.  They just want subservient, mindless drones",
                    "score": 67,
                    "depth": 1,
                    "timestamp": "2025-02-06 11:04:30",
                    "replies": []
                },
                {
                    "author": "Dantai",
                    "body": "It's straw man arguments. \n\nFear of trans and the other.\n\nSeriously. The media, social media, politics - focused TOO much on it. And on extremely outlier cases. My reality is simply this. I've met very few trans people and they are just living their lives and don't bother me at the club or work. Same with people who aren't white where I work, they're very smart and hard working and deserve the job based off of merit! I work for a huge employer too.\n\n\nI swear we are getting psyoped. I could put a trans person in the same room as the most right far right construction person I know and they'd end up being friends reaching common ground. But the hysteria in the news cycle - all it does is enrage people about a non exist problem.\n\nMeanwhile Elon is gonna become the Omni-Messiah (or control him) and we are fighting for eggs at Costco...and blaming Canada",
                    "score": 52,
                    "depth": 1,
                    "timestamp": "2025-02-06 12:10:31",
                    "replies": [
                        {
                            "author": "Steve_the_Samurai",
                            "body": "For context, all the uproar about college sports allowing trans athletes to play.\n\nNCAA said 10 people were athletes and trans. 10 out of 500,000",
                            "score": 22,
                            "depth": 2,
                            "timestamp": "2025-02-06 13:08:26",
                            "replies": [
                                {
                                    "author": "Dantai",
                                    "body": "Enraged about 10 people, which leads to start a policy displacing 2 million people who just were bombed for over a year - which is going to butterfly effect into more international terrorisim probably.",
                                    "score": 10,
                                    "depth": 3,
                                    "timestamp": "2025-02-06 17:35:44",
                                    "replies": []
                                },
                                {
                                    "author": "lampstax",
                                    "body": "10 trans player .. how many have to share locker rooms and private spaces with those trans player who are not comfortable with doing so ?   how many have to play against those trans player who might not be comfortable with doing so ?",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-02-08 15:43:06",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "lampstax",
                            "body": "Both sides focuses too much on outlier cases.   For example abortion.   One side focus on late term abortion and one side focus on incest rape cases.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-08 15:40:47",
                            "replies": []
                        },
                        {
                            "author": "Ivanow",
                            "body": "To be honest, “trans activists” were absolutely insufferable. It is such a marginal minority, and around a decade ago, it “felt” like most of population (outside of some religious nutjobs) really had no problem with them. Then they somehow tried to insert themselves into every conversation, or pushing for things like something as simple as misgendering someone (maybe I am a simple man, but if I see someone with a beard, I will default to “he”. No hate intended. If i know someone, I will use their preferred pronouns, out of simple respect, but I find “It’s ma’am” situation completely cringeworthy) getting labeled as a hate crime. Nowadays, it seems like it created massive backlash, which will actually rewind trans people’s situation/rights back at least a few decades.",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2025-02-07 04:19:51",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sharp_Iodine",
                    "body": "I hope people know they’re not caving into anything. \n\nThe government used to incentivise fair hiring practices and so these companies did it. \n\nThe new government incentivises hiring your nephew. So they do that instead. \n\nIt’s always been about money, it’s never been about principles.  \n\nIn 4 years if there is an election and a democrat wins and incentivises fair hiring again they will all do that and blame their earlier actions on the harsh political climate.",
                    "score": 23,
                    "depth": 1,
                    "timestamp": "2025-02-06 12:18:05",
                    "replies": [
                        {
                            "author": "NeonWarcry",
                            "body": "I’m not caving. I have a handwritten list.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-02-06 13:23:25",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "basketcase18",
                    "body": "Is there a way to boycott google?",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-02-06 16:30:33",
                    "replies": [
                        {
                            "author": "dustindubya",
                            "body": "You should cancel google for triggering you.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-02-07 09:00:35",
                            "replies": [
                                {
                                    "author": "basketcase18",
                                    "body": "Anyone who disagrees with someone’s business practices is triggered? And not wanting to use someone’s products is “canceling” them? Grow up.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-07 10:43:56",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "benjaminbjacobsen",
                    "body": "Your last part hits the nail on the head. Anyone against DEI should have to say the words diversity equity and inclusion then say what they’re going to say. Tell us which part you don’t like so we can see which flavor of jerk you are.",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2025-02-06 12:22:38",
                    "replies": [
                        {
                            "author": "lampstax",
                            "body": "Equity is what most people are against.   Equality means everyone is on an even playing field.   Equity means someone is putting their thumb on the scale to determine who wins the oppression olympic.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-08 15:45:42",
                            "replies": []
                        },
                        {
                            "author": "Zykium",
                            "body": "Same with the people who are against The Democratic People's Republic of Korea.",
                            "score": -2,
                            "depth": 2,
                            "timestamp": "2025-02-06 13:10:58",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Pour_Me_Another_",
                    "body": "There are so many people with massive chips on their shoulders for literally no reason than nothing better going on for them.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-06 23:16:20",
                    "replies": []
                },
                {
                    "author": "Mujichael",
                    "body": "It’s not caving if its what you wanted to do the entire time and just wore liberal veneers",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-06 23:33:17",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "Corporate DEI was always bullshit, and the chuds know this.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-06 13:45:25",
                    "replies": []
                },
                {
                    "author": "slykethephoxenix",
                    "body": "You're a fool if you ever thought they cared. I don't do brand loyalty. They only care about money. Not your gay rights, your worker rights, or your right as a human being.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-06 18:55:17",
                    "replies": []
                },
                {
                    "author": "dustindubya",
                    "body": "People on both sides have issues with DEI lunacy.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-02-07 08:58:04",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "A family of mine works in medicine and the hiring committee for a local medical education program purposefully stated they were trying to hire a black doctor to run a part of the program. Two more qualified white doctor applications (they attended better ranked medical schools and had more experience) were tossed out so the hiring board could hire a black doctor to run that program who graduated from a lower ranked medical school and had less experience. Instead of judging each candidate equally on their credentials, racial discrimination was used to hire the black doctor. One of the people on the hiring committee said they wanted to get a black doctor for cultural fit and ignored the hard data showing the other two were more qualified. If someone had done the reverse and neglected two black doctors for a lesser quality white doctor due to \"cultural fit\", there would be justifiable cries of racism. Same should apply to what happened. \n\nNo company you may have been involved in has done it but the factual reality for the American economy is these acts do happen. \n\nI work in government contracting and there are definite minority set asides for small businesses. White business owners are rejected from competing on certain government contracts (funded with their tax dollars) so certain jobs are denied to white business owners through such racism (if race is being used as a factor to exclude certain people, it's racism)\n\nThe solution should be government supported well paying jobs for all so there is no need to fight over crumbs like this",
                    "score": -14,
                    "depth": 1,
                    "timestamp": "2025-02-06 12:51:56",
                    "replies": []
                },
                {
                    "author": "asianboydonli",
                    "body": "So then what’s the point? If DEI didn’t change anything when it was implemented then what’s the difference if it’s removed?",
                    "score": -4,
                    "depth": 1,
                    "timestamp": "2025-02-06 14:44:25",
                    "replies": []
                }
            ]
        },
        {
            "author": "Hoopy223",
            "body": "What, you mean whenever Google turned their search engine logo into a rainbow or silhouettes of various races of people holding hands they weren’t serious? And it’s all about $$$$?",
            "score": 26,
            "depth": 0,
            "timestamp": "2025-02-06 12:12:31",
            "replies": [
                {
                    "author": "dustindubya",
                    "body": "Maybe at Costco when you interview for a job you can talk about your sexual preferences to garner favor. That makes sense right?",
                    "score": -6,
                    "depth": 1,
                    "timestamp": "2025-02-07 09:03:40",
                    "replies": []
                }
            ]
        },
        {
            "author": "devious_204",
            "body": "So is Sundar going to be the first to go?",
            "score": 22,
            "depth": 0,
            "timestamp": "2025-02-06 11:43:50",
            "replies": []
        },
        {
            "author": "MD_FunkoMa",
            "body": "Google should just go out of business. I know that it won't happen, but a man can dream.",
            "score": 68,
            "depth": 0,
            "timestamp": "2025-02-06 10:16:03",
            "replies": [
                {
                    "author": "RollOverSoul",
                    "body": "Them, Facebook, Amazon ect.",
                    "score": 21,
                    "depth": 1,
                    "timestamp": "2025-02-06 12:32:29",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "[deleted]",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2025-02-06 17:34:52",
                            "replies": [
                                {
                                    "author": "patrad",
                                    "body": "I'm de-big teching as well.  Got to give it to them . . google is the hardest.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-02-06 21:33:12",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "[deleted]",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-02-06 21:46:01",
                                            "replies": [
                                                {
                                                    "author": "patrad",
                                                    "body": "I have email covered.  But Android TV, Google Maps, YouTube and my Pixel . . IDK.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-06 22:04:14",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Deleted",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-07 02:49:27",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-02-07 07:48:12",
                                            "replies": [
                                                {
                                                    "author": "shreder856",
                                                    "body": "Lol",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-07 09:16:18",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ZrinyiPeter",
                    "body": "Firefox on all devices, uBlock, block all advertising, use a VPN, block all advertising cookies, never accept cookies, never give out any remotely identifying information if it is not of absolute necessity. \n\nThey've not earned shit off me in years.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-02-07 08:27:13",
                    "replies": [
                        {
                            "author": "DexClem",
                            "body": "You realize one of the biggest revenue source of mozilla is google ? One of the biggest fears of chrome selloff scare was firefox losing that. I'm not saying firefox is bad or google is needed, I'm saying they're so deeply integrated into web that while you can pretend you don't use google services, you still do.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-02-08 09:44:50",
                            "replies": [
                                {
                                    "author": "ZrinyiPeter",
                                    "body": "I don't use shit from Google. Startpage search engine, all cookies from Google blocked, all telemetry and everything Firefox could collect, blocked. \n\nThat's the browser side. Next I'll be eliminating YouTube ReVanced, the final place I have a Google account on. Then Reddit, I'm done with social media. Goodbye.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-08 11:10:13",
                                    "replies": [
                                        {
                                            "author": "DexClem",
                                            "body": "Unfortunately, Besides browser, there's a good chance your VPN rents servers from Google Cloud or even worse AWS. \n\nReddit also uses Google cloud / AWS to host its servers. Literally anything that runs on cloud there's like a 30%  chance its AWS, 15% its google by market share (more for bigger companies like reddit). Again, I'm not here to discourage you but saying one way or the other if you're using the web, the money is reaching google.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-02-08 11:19:37",
                                            "replies": [
                                                {
                                                    "author": "ZrinyiPeter",
                                                    "body": "I use Mullvad VPN. Pretty much the only truly private VPN provider, that isn't a bunch of sellouts and is entirely transparent. They host their own servers or rent them from third parties, specifying them all. No Google and no Amazon anywhere in sight. \n\nAnd yes, I'm aware of Reddit being a privacy nightmare. But they can steal all the data they want, all they will be getting is fake info and gibberish.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-08 13:38:19",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "demiourgos0",
            "body": "\"Don't be evil\"",
            "score": 74,
            "depth": 0,
            "timestamp": "2025-02-06 10:36:53",
            "replies": [
                {
                    "author": "carl84",
                    "body": "\"We're not being evil, we're just following orders\"",
                    "score": 49,
                    "depth": 1,
                    "timestamp": "2025-02-06 11:30:16",
                    "replies": [
                        {
                            "author": "three-one-seven",
                            "body": "💀",
                            "score": 12,
                            "depth": 2,
                            "timestamp": "2025-02-06 11:32:29",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jdstrike11",
            "body": "It’s insane how people are reacting to this. Obviously they are gonna follow the money, just like how they got into DEI in the first place, money. This isn’t a person with feelings, it’s a fucking company trying to make as much profit as possible. Whatever color of sweat it takes to achieve, it matters not",
            "score": 11,
            "depth": 0,
            "timestamp": "2025-02-06 20:11:18",
            "replies": [
                {
                    "author": "Xtrachromo21",
                    "body": "Just like McMahhon when they asked him why he did dumb shit. You have to be ruthless and think about nothing but what profits the company. It seemed insincere and strange how he would say he would never personally make a  decision to do something, but he had to do it for the company. Wild.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-02-07 11:21:31",
                    "replies": []
                }
            ]
        },
        {
            "author": "Staalone",
            "body": "Because now that a fascist government is in place they don't need to virtue signal and pretend they care about anything other than money",
            "score": 74,
            "depth": 0,
            "timestamp": "2025-02-06 10:18:11",
            "replies": []
        },
        {
            "author": "eggs_erroneous",
            "body": "It's okay though because their corporate mission statement is (or was) \"Don't be evil.\"  So, you know, they're honor-bound to do the right thing.  Right?",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-02-06 17:11:47",
            "replies": []
        },
        {
            "author": "ragepanda1960",
            "body": "I feel like they're just going to hire people the same way as before, but now they're just not going to publicly advertise DEI because it will earn the ire of the republicans who are going to be regulating them. A diverse workplace is more performant than a homogeneous one, according to the research on this topic. \n\nGoogle isn't about to hire more white guys. They're going to keep hiring the cheapest coders, which is Indians.",
            "score": 14,
            "depth": 0,
            "timestamp": "2025-02-06 11:35:03",
            "replies": [
                {
                    "author": "lampstax",
                    "body": "Yes but when it is 90% Indian / Asian in tech roles, that doesn't meet DEI objectives either.",
                    "score": 12,
                    "depth": 1,
                    "timestamp": "2025-02-06 11:42:02",
                    "replies": [
                        {
                            "author": "ragepanda1960",
                            "body": "It's almost as if DEI actually protects white people when there are legions of competent and better educated model minorities like Asians and Indians applying to jobs.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-06 13:04:40",
                            "replies": [
                                {
                                    "author": "lampstax",
                                    "body": "Then really even less reason to keep it.  There's no reason any group should get a leg up because of their skin color.   White, black, brown or green.",
                                    "score": -4,
                                    "depth": 3,
                                    "timestamp": "2025-02-06 13:24:25",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NeuroticKnight",
                            "body": "Yeah poor white women, without DEI theyll have to compete with people who grew up in a 3rd world country.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-02-07 04:44:14",
                            "replies": [
                                {
                                    "author": "lampstax",
                                    "body": "No one can help where they are born or who their parents are.   Everyone has different struggles.   Who's going to judge the oppression Olympics?",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-02-07 11:09:49",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AlsoCommiePuddin",
                    "body": "> I feel like they're just going to hire people the same way as before,\n\nExcept now the default US position is that the straight white male candidate is always the most qualified, and any other hire will be investigated as \"DEI.\"",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2025-02-06 23:26:47",
                    "replies": []
                },
                {
                    "author": "Due_Unit5743",
                    "body": "people are also more productive when you dont make them work overly long hours, but capitalists do it anyway, because when you are a king you dont have to listen to reason",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-08 23:22:41",
                    "replies": []
                }
            ]
        },
        {
            "author": "scaredalpaca",
            "body": "I’ve said it soooo many times, but people seem to downvote this hard truth. All these DEI associated stuffs in corporates are just acts, In practice, they don’t care, but they need to appear that they care and therefore all of those “initiatives”.",
            "score": 9,
            "depth": 0,
            "timestamp": "2025-02-06 12:35:01",
            "replies": [
                {
                    "author": "omggold",
                    "body": "Yup. Google has the supposedly brightest minds and has spent millions on DEI, but their numbers have barely changed over time – they’ve even had numerous lawsuits internally by underrepresented groups because many of their policies were ineffective. They never actually cared (in a structural or systematic sense) they just built a brand around it.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-06 15:00:17",
                    "replies": []
                }
            ]
        },
        {
            "author": "ssmtransgirl",
            "body": "honestly..it sounds like publicly they are ending the initiatives but they are not actually ending them... They just can't be seen promoting it. That's my take on what they said.",
            "score": 13,
            "depth": 0,
            "timestamp": "2025-02-06 10:20:00",
            "replies": [
                {
                    "author": "Short_Cream_2370",
                    "body": "Sure but this is exactly the wrong time to back down in this obvious, public way. There are managers who want to discriminate - they will take this opportunity to do so. Our structure of legal protections against racial and gender discrimination has not been eliminated, no matter how much Donald Trump wants wishing to make it so. Today, every person of color and every woman and every disabled person who doesn’t get hired or promoted at Google should start suing, because they’re going to have great, public evidence to make their cases.    \n    \nIt’s so deeply stupid, and I hope employees who have made their excuses about improving the world through tech leave these companies, and the Silicon Valley that hasn’t managed to make a new product people actually want in years (hence, trying to get the government to force adoption of crypto and AI) crumbles to the ground and all the execs lose their shirts with it.",
                    "score": 14,
                    "depth": 1,
                    "timestamp": "2025-02-06 11:05:43",
                    "replies": [
                        {
                            "author": "dustindubya",
                            "body": "How about be the best you can be to get a job. Prepare for the interview and be confident and direct. Don’t play to any political master keep it focused on what you can do not what group you bow to. If you’re great you won’t have to worry about the color of your skin or what hole you like penetrated.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-02-07 09:08:01",
                            "replies": [
                                {
                                    "author": "Short_Cream_2370",
                                    "body": "You’re very gross in many ways, but to be absolutely clear - that is what everyone does. Everyone works hard and presents their best selves. Talent is equally distributed across all races and genders, because obviously it is, and if you have even a beginners understanding of biology and genetics you understand why it has to be given what we know about the human species. And then some people get rejected more often in more interviews because some of the bosses who got their jobs in a segregated or sexist time and grew up in a segregated or sexist community just “can’t see the fit.” This happens every day. The point of workplace recruitment and anti-discrimination plans is to ensure everyone gets a fair shake, because the standard is to not get a fair shake and without addressing it most jobs would go to someone who went to school with the boss or knows the boss’s Dad. My beloved husband, my Dad, my brothers, and some my best friends are all straight white dudes, and none of them mind this at all because they too work hard, know that they won’t get everything they ever want, but they can get far by being their wonderful, talented selves. There is more than enough in the world for everyone to have a piece of the pie. The only people in the world to whom workplace fairness and anti-discrimination is threatening are the rich segregationists who have temporary control of our government, because they know they didn’t get where they are on their merits, and if we move towards fairness at all they might lose what they have to people with more talent and effort than they possess. It would be sad, if it didn’t hurt so many people so needlessly.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-02-07 09:58:49",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MagiaLila",
                    "body": "That's cute, you think we're going back?",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-02-06 11:15:51",
                    "replies": []
                },
                {
                    "author": "Slight-Inevitable161",
                    "body": "They essentially have to. There are a lot of opinions here from people who clearly don’t know what’s at stake if a company that holds government contracts doesn’t comply.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-03-11 19:46:32",
                    "replies": []
                },
                {
                    "author": "vmsrii",
                    "body": "Low key I think that’s what’s happening in 99% of companies. \n\nDEI actually resulted in higher profits and better business. It’s also probably *more* money to actually go through and edit policy. Much cheaper to just take the letters DEI off of official postage and simply not change anything. \n\nReverse Rainbow Capitalism",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-02-06 10:58:00",
                    "replies": [
                        {
                            "author": "dustindubya",
                            "body": "Bud light, Nike, Ben and Jerrie’s, united airlines, Levi’s jeans, Victoria secret, Disney, Starbucks, jack daniels, target, Coca Cola, Gillette, Pepsi, gap. Now you list the companies that have profited from Marxist propaganda.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-07 09:15:06",
                            "replies": [
                                {
                                    "author": "vmsrii",
                                    "body": "What exactly do you think “Marxist Propaganda” is?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-07 11:30:58",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NeuroticKnight",
                    "body": "Google already exceeded its previous goal of having at least 1/3 employee be a woman. They have  higher percentage of asians  too, though these days they're seen as honorary whites. Overall, I don't think it is much a worry.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-07 04:43:21",
                    "replies": []
                }
            ]
        },
        {
            "author": "Circusssssssssssssss",
            "body": "To please Elon Musk and Donald Trump!",
            "score": 8,
            "depth": 0,
            "timestamp": "2025-02-06 10:49:50",
            "replies": []
        },
        {
            "author": "DevilsPlaything42",
            "body": "Sundar is just another enabler of Trump's fascist agenda.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-06 13:13:19",
            "replies": []
        },
        {
            "author": "Mammoth-Percentage84",
            "body": "It seems a rather long-winded way of saying \"Yeah, gunna suck Trump's dick now.\"",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-06 13:20:51",
            "replies": []
        },
        {
            "author": "chibinoi",
            "body": "But wouldn’t that mean that Google should avoid H1B visa candidates, since they’re often from *ethnically diverse groups*?",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-06 14:04:33",
            "replies": []
        },
        {
            "author": "DeepSubmerge",
            "body": "Corporations don’t care about anyone or anything except their bottom line. I really hope people get it this time.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-06 14:19:26",
            "replies": []
        },
        {
            "author": "eggs_erroneous",
            "body": "It's okay though because their corporate mission statement is (or was) \"Don't be evil.\"  So, you know, they're honor-bound to do the right thing.  Right?",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-06 17:11:53",
            "replies": []
        },
        {
            "author": "rg3930",
            "body": "I am very curious on two questions. \nDEI seems to be the focus of this new administration, how did this come about? \n1. Who decided that the DEI initiative is the biggest threat to America ? Something that warrants destruction of institutions that have been working well (for the most part)\n2. What forum and When was this decided?",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-06 18:18:39",
            "replies": []
        },
        {
            "author": "ShameAffectionate15",
            "body": "VERY good news!!!  All the airhead women from my company got hired but the men who interviewed got rejected.  These tech companies billions of people rely on should run on meritocracy not \"girl boss\" energy.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-07 14:49:33",
            "replies": []
        },
        {
            "author": "electricalkitten",
            "body": "Next they will sack all the women employees, and have an all male workforce. Trump will love this. \n\nI am going back to public protesting.\n\nI moved my data of Google Drive yesterday, and am looking for a different cloud based solution.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-08 02:02:36",
            "replies": []
        },
        {
            "author": "MotanulScotishFold",
            "body": "I find kinda funny that many companies removed DEI, it only proves that they never cared in the first place, same goes for other things that they says the care, such as environment, or wellbeing or whatever else.\n\nIt's just crap PR for low iq people who fall for that.\n\nToday in my company I had a training about ESG (Environmental, social, and governance) bullshit that I don't care at all and 'teach' us how to not destroy de planet or create a better environment while the ultrarich destroy it all for us. \n\nBet they also don't care of ESG but had to comply with some agenda or whatever for extra $ somehow and showing the world how truly they care.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-06 13:33:00",
            "replies": []
        },
        {
            "author": "angrybats",
            "body": "DEI will be replaced by MEI in all places controlled by big CEOs very soon. (Merit, Excellence and Intelligence). It's all part of a big plan the billionaires have.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-06 14:20:27",
            "replies": [
                {
                    "author": "Cunari",
                    "body": "I’m sure they’ll hire highly intelligent people with left wing or even centrists views and not hang up on them during the interview process…",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-08 14:27:20",
                    "replies": [
                        {
                            "author": "angrybats",
                            "body": "Honestly, idk. You don't normally talk about politics in interviews",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-08 17:53:25",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gamestonkape",
            "body": "Because we never ever cared about it in the first place.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-06 15:00:59",
            "replies": []
        },
        {
            "author": "BicFleetwood",
            "body": "It's almost as if they never believed in these things in the first place.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-06 20:05:58",
            "replies": [
                {
                    "author": "electricalkitten",
                    "body": "They believed in money.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-08 02:07:08",
                    "replies": []
                }
            ]
        },
        {
            "author": "Eydrien",
            "body": "I hope people don't forget, and in 4 years, if US is still alive and not in a dictatorship, when you guys actually get a good leader and these companies have to go back to \"yeah we actually care about all of you\", everyone will do their thing and don't forgive any of these stupid companies.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-06 22:25:38",
            "replies": [
                {
                    "author": "electricalkitten",
                    "body": "It has the hallmarks of the 1930's Germany, but on steriods.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-08 02:06:34",
                    "replies": []
                }
            ]
        },
        {
            "author": "HarbingerDe",
            "body": "Essentially, fascists have complete power at the federal level and corporations will always collaborate with fascists over doing the right thing.\n\nThat and they're worried that \"wokeness\" is becoming unprofitable branding.",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-02-06 11:39:30",
            "replies": [
                {
                    "author": "krazygreekguy",
                    "body": "Corporations will always go whichever way the wind blows lol. They have never and will never care about anyone or anything other than profits. Idk why so many people were in lala land thinking otherwise. It’s just the cold, hard truth of reality unfortunately",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-06 17:40:45",
                    "replies": []
                }
            ]
        },
        {
            "author": "Malicious_blu3",
            "body": "Well, shit.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 11:32:00",
            "replies": []
        },
        {
            "author": "FrankaGrimes",
            "body": "That was a statement that said literally nothing.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 13:25:57",
            "replies": []
        },
        {
            "author": "MorgrainX",
            "body": "What they don't tell you \n\nReason 1: money. It's cheaper not to give a shit about minorities.\n\nReason 2: they are afraid of Trump targeting them.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 13:52:50",
            "replies": []
        },
        {
            "author": "TredHed",
            "body": "Remember when they lost in court re: age bias?\n\n[https://www.shrm.org/topics-tools/news/inclusion-diversity/google-ends-age-discrimination-suit-11-million-settlement](https://www.shrm.org/topics-tools/news/inclusion-diversity/google-ends-age-discrimination-suit-11-million-settlement)",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 14:56:18",
            "replies": []
        },
        {
            "author": "tharnadar",
            "body": "Frankly I'm speechless how the things are changing... For years we have been bombarded by claims that diversity is the most important thing, there should be more diversity in management positions and so on.......",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 15:10:50",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Time to move to proton mail and go duck go",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 15:28:17",
            "replies": []
        },
        {
            "author": "0gtcalor",
            "body": "r/degoogle",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 15:45:32",
            "replies": []
        },
        {
            "author": "WinstonPeters31",
            "body": "\"Because we are kiss-arse c**ts\"",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 15:59:44",
            "replies": []
        },
        {
            "author": "LesserValkyrie",
            "body": "That's interesting to know how easily Blackrock can influence the world",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 16:17:27",
            "replies": []
        },
        {
            "author": "JudasWasJesus",
            "body": "Bout to import a boatload of foreigners",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 16:24:53",
            "replies": []
        },
        {
            "author": "fasole99",
            "body": "Funny how as the administration ended so sid the tech giants rethoric.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 16:28:52",
            "replies": []
        },
        {
            "author": "pathf1nder00",
            "body": "I was told I wouldn't get a manager job b/c U didn't have a vagina...\n\nSo, there is that part of DEI at Google.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 21:52:40",
            "replies": []
        },
        {
            "author": "Individual-Fee-5639",
            "body": "Fucking Google. Aren't many of those geeks of various ethnicities anyway??? *smdh*",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-07 06:13:55",
            "replies": []
        },
        {
            "author": "homelaberator",
            "body": "Because fascism rewards loyalty over competence and they need to show that to the new regime.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-07 07:45:56",
            "replies": []
        },
        {
            "author": "Confident-Bug4210",
            "body": "This was not a order this was a chance and they took because there is something to shift blame onto",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-07 08:26:18",
            "replies": []
        },
        {
            "author": "PhotonOfSandyPlanet",
            "body": "Gotta love how these companies act like they have to do this to avoid legal issues or because the gov is looking at them. Like they don't have to do any of these back peddling on DEI. It's so performative and I hope they lose any public trust they had. Meanwhile they break laws all the goddamn time for profit. I mean this whole AI super race is breaking laws left and right. But those are lawsuits they don't care to take on because it's peanuts to settle.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-07 09:55:35",
            "replies": []
        },
        {
            "author": "Slight-Inevitable161",
            "body": "It’s absolutely reasonable if you know anything about government contracting. \nSanctions against companies/prohibiting them from participating in government contracts is the government’s best tool for compliance. Biden did it with the COVID vaccine mandate. Every president does. The US government is the #1 consumer of goods and services in the world. Being barred from government contracts is a death knell for businesses in sectors where public funds are a measurable portion of revenue, because it also means a lot of other companies will flatly refuse to do business with that company, to protect their own status. \nBecause if the EOs Trump has signed, continuing to factor DEI into hiring decisions would actively put a company’s status as a federal contractor at risk. \nThe EO is bullshit. The president is disgusting. But they really didn’t have a choice here.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-03-11 19:43:52",
            "replies": []
        },
        {
            "author": "daniiboy1",
            "body": "That's easy. It's because they're tripping over themselves to kiss a certain someone's as... \"ring\". \n\nWell, that, and money. It's always about the money.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 11:24:57",
            "replies": []
        },
        {
            "author": "acroix2020",
            "body": "Gosh…this one will be hard to boycott",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-06 12:11:29",
            "replies": []
        },
        {
            "author": "8ardock",
            "body": "Are you guys going backwards as a country?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-07 08:21:41",
            "replies": []
        },
        {
            "author": "MahoganyBean",
            "body": "So do we all start using Bing now?",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-02-06 11:14:35",
            "replies": [
                {
                    "author": "AdministrativeBee525",
                    "body": "Been using DuckDuckGo for a while now… Googles business model is based on selling your personal data, you are the product",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2025-02-06 11:57:56",
                    "replies": [
                        {
                            "author": "pcdelgado",
                            "body": "If the service is free, you are the product",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-02-06 15:22:34",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sea_Dawgz",
            "body": "Stop saying DEI why accept trump framing. \n\nSay “ending civil rights.”",
            "score": -4,
            "depth": 0,
            "timestamp": "2025-02-06 12:21:38",
            "replies": [
                {
                    "author": "JaguarRodrigo",
                    "body": "Exactly",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-03-01 13:32:19",
                    "replies": []
                }
            ]
        },
        {
            "author": "eidisjan1tns",
            "body": "DEI usually implies discrimination against whites and males. Especially in tech. They are pulling back to reduce risk of lawsuits.",
            "score": -2,
            "depth": 0,
            "timestamp": "2025-02-07 02:22:55",
            "replies": [
                {
                    "author": "electricalkitten",
                    "body": "No, DEI promotes equality, fair pay, and gives every applicant a fair change regardless the colour of their skin, sex, gender, whether they are white, black, man, or women.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-02-08 02:05:09",
                    "replies": []
                },
                {
                    "author": "PandaXXL",
                    "body": "🤡",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-07 07:22:43",
                    "replies": []
                },
                {
                    "author": "Cunari",
                    "body": "DEI should be tweaked not eliminated",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-08 14:24:27",
                    "replies": [
                        {
                            "author": "eidisjan1tns",
                            "body": "How would you tweak it?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-08 14:51:37",
                            "replies": [
                                {
                                    "author": "Cunari",
                                    "body": "More intellectual diversity.  Hire people who are pro union or left leaning.\n\nHire people for roles totally at random.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-08 14:53:23",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JaguarRodrigo",
                    "body": "This a ridiculous and incorrect comment. Go take a class in corporate psychology",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-03-01 13:33:24",
                    "replies": [
                        {
                            "author": "eidisjan1tns",
                            "body": "I see it with my own eyes. No class needed.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-03-01 14:19:12",
                            "replies": [
                                {
                                    "author": "JaguarRodrigo",
                                    "body": "That’s my point. DEI os an aspect of civil rights that prevents both explicit AND implicit bias from hirers. Its not about what you see, it’s about math and implicit bias (psychology). Because of our country’s history, EVERYTHING favors proximity to whiteness",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-03-01 15:23:48",
                                    "replies": [
                                        {
                                            "author": "eidisjan1tns",
                                            "body": "Discrimination against whites and Asians is still discrimination. You look at disparity numbers and contribute it to bias and racism. I contribute it to culture and choice of life.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-03-01 16:53:33",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "assesonfire7369",
            "body": "Now they want to go back to before and \"hire the best people.\"   \nSorry Google, you don't get to \"hire the best people\", you should be trying to get more minorities. Thank you for your understanding.\n\n\\#DEI #quotas",
            "score": -2,
            "depth": 0,
            "timestamp": "2025-02-07 03:24:51",
            "replies": []
        }
    ]
}