{
    "post_title": "Anons on AI",
    "post_timestamp": "2023-11-05 08:46:26",
    "last_comment_timestamp": "2023-11-10 01:00:35",
    "time_difference": "4 days, 16:14:09",
    "comments": [
        {
            "author": "StandardN02b",
            "body": "As if anthropologists haven't been using skeletons to determine etimology for decades already.",
            "score": 1516,
            "depth": 0,
            "timestamp": "2023-11-05 08:57:04",
            "replies": [
                {
                    "author": "FOFBattleCat",
                    "body": "What do skeletons have to do with the origins of words?",
                    "score": 589,
                    "depth": 1,
                    "timestamp": "2023-11-05 10:13:57",
                    "replies": [
                        {
                            "author": "StandardN02b",
                            "body": "Fuck, I meant ethnicity. Sorry I am not a native speaker.",
                            "score": 631,
                            "depth": 2,
                            "timestamp": "2023-11-05 11:03:03",
                            "replies": [
                                {
                                    "author": "PascalTheWise",
                                    "body": "We don't mined",
                                    "score": 288,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 11:35:03",
                                    "replies": []
                                },
                                {
                                    "author": "RocksHaveFeelings2",
                                    "body": "You speak English better than I speak your language",
                                    "score": 158,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 12:14:44",
                                    "replies": [
                                        {
                                            "author": "StandardN02b",
                                            "body": "Thanks, friend.",
                                            "score": 63,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 13:24:12",
                                            "replies": []
                                        },
                                        {
                                            "author": "SeawyZorensun",
                                            "body": "This is usually the case. Sometimes foreigners also speak better, \"more proper\" if you will, English than native speakers.",
                                            "score": 29,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 13:55:52",
                                            "replies": [
                                                {
                                                    "author": "ctzn4",
                                                    "body": "As a non-native speaker I definitely agree. Often the native speakers of a language learned it through their family and not in a structured fashion. I'm the same way with Chinese. I know English grammar much better than I do Chinese grammar, and I consistently did better on every one of my English class exams than my Chinese exams in middle school (65-75% average vs. 85-95% avg).",
                                                    "score": 22,
                                                    "depth": 5,
                                                    "timestamp": "2023-11-05 14:42:03",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Ok-Faithlessness4906",
                                    "body": "Etimology and ethnicity are not english words.m but are derived from greek. Therefore “not a native speaker” does not count",
                                    "score": -46,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 14:32:56",
                                    "replies": [
                                        {
                                            "author": "_freight_train",
                                            "body": "“derived from greek”",
                                            "score": 22,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 14:34:21",
                                            "replies": []
                                        },
                                        {
                                            "author": "Deleted",
                                            "body": "What you just said is so utterly nonsensical that it could be a new form of avant-garde absurdism.",
                                            "score": 11,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 18:38:21",
                                            "replies": []
                                        },
                                        {
                                            "author": "FOFBattleCat",
                                            "body": "Basically 75% of english is derived from greek and/or latin.",
                                            "score": 11,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 18:03:08",
                                            "replies": []
                                        },
                                        {
                                            "author": "TheLycanthropy",
                                            "body": "First of all 🤓\n\nSecond of all what if they’re not a native speaker of  Greek also? Have you used your brain?",
                                            "score": 18,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 15:51:19",
                                            "replies": []
                                        },
                                        {
                                            "author": "ratione_materiae",
                                            "body": "No, they’re derived from proto-Indo-European",
                                            "score": 4,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 18:52:49",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BigRailWillFail",
                            "body": "Chin out = ebonics",
                            "score": 46,
                            "depth": 2,
                            "timestamp": "2023-11-05 10:34:57",
                            "replies": [
                                {
                                    "author": "gfolder",
                                    "body": "Displaced jaw is often a genetic predisposition compared to and related to retardation which is often equated to lesser quality of life which makes you wonder, eh?",
                                    "score": 6,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 21:34:13",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "Anthropologists aren’t big fans of the word ethnicity…",
                    "score": 24,
                    "depth": 1,
                    "timestamp": "2023-11-05 18:43:46",
                    "replies": [
                        {
                            "author": "StandardN02b",
                            "body": "too bad.",
                            "score": 10,
                            "depth": 2,
                            "timestamp": "2023-11-05 20:19:43",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PUNCH_KNIGHT",
            "body": "believe it or not people are shaped slightly differently in different biomes, who knew",
            "score": 115,
            "depth": 0,
            "timestamp": "2023-11-05 10:03:42",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "If you ask the media, nobody.",
                    "score": 35,
                    "depth": 1,
                    "timestamp": "2023-11-05 13:34:00",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "Apparently AI can also [determine your sexual orientation from a photo](https://www.theguardian.com/technology/2017/sep/07/new-artificial-intelligence-can-tell-whether-youre-gay-or-straight-from-a-photograph) (notice this was 2017), and [determine whether you have diabetes](https://www.diabetes.co.uk/news/2023/oct/say-what-ai-can-diagnose-type-2-diabetes-in-10-seconds-from-your-voice.html) from listening to 10 seconds of your speech. \n\nThis is just v.001. The future is gonna be weird and I'm scared.",
            "score": 39,
            "depth": 0,
            "timestamp": "2023-11-05 11:46:05",
            "replies": [
                {
                    "author": "P0pt",
                    "body": "i actually want to try these ai's if anyone can link them",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2023-11-05 22:57:20",
                    "replies": [
                        {
                            "author": "lufrnd",
                            "body": "Michael... am I gay?",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2023-11-06 08:58:23",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 74,
            "depth": 0,
            "timestamp": "2023-11-05 09:04:46",
            "replies": [
                {
                    "author": "REDPIG8686",
                    "body": "They told us that was Nazi pseudo-science.",
                    "score": 11,
                    "depth": 1,
                    "timestamp": "2023-11-05 13:40:20",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Okay buddy",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2023-11-05 20:56:44",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FOFBattleCat",
            "body": "Forensics experts can at least somewhat reliably determine someone's facial features and race from just a skeleton, if not just a skull.",
            "score": 18,
            "depth": 0,
            "timestamp": "2023-11-05 10:17:12",
            "replies": []
        },
        {
            "author": "YhormTheGiant450",
            "body": "But scientist have been able to determine the ethnicity of skeletons found for a super long time, don't they ? Maybe it has to do with the way of examining it. The AI may be able to do it on X-Ray because X-Ray are a genuine chore to look at for us if it's not to look for a fracture or a foreign object",
            "score": 14,
            "depth": 0,
            "timestamp": "2023-11-05 10:33:36",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Anon is an idiot. Race isn't a social construct, it's just that from a scientific perspective, you can't justify the use of race when humans are basically the same. We lack the genetic diversity that dogs have and even though many, especially Americans, use the word \"race\" to describe someone, it doesn't describe a group of individuals accurately enough. \n\nRacism is a social construct however. Before, if you were from another city then fuck you. Your religion was different? Fuck you. And sometimes not. The Portuguese started slavery (they didn't invent it but they, and Europeans in general, made it an impressive logistic machine on a scale never before seen) but it wasn't right by christians standards and the Church couldn't really justify people having slaves. Unless. What if they didn't have soul? Then they wouldn't really be humans, and you could do whatever you want with them. Except it's easy to see that slaves cry, so what if slavery was a good thing for them? They work for free but we give them christian education which is a good thing! We're actually the good guys for saving their souls. Then you had colonization which people are still justifying by saying that hospitals have and roads have been constructed. \n\nRace isn't a social construct, it just doesn't apply here. Racism is.\n\nEdit : the US Wikipedia page does have race as a social construct. It's not the same \"race\" as biology and basically describes a mix of ethnicity and culture. It's not something, however, that could be found in my country. That also means that Anon is even more wrong because using the first definition, race can't be used to divide humans into subgroup, and using the second, race is a social construct, so in absolutely none of these definition this guy is right.",
            "score": 578,
            "depth": 0,
            "timestamp": "2023-11-05 09:25:55",
            "replies": [
                {
                    "author": "iStayGreek",
                    "body": "This is all correct, but from a medical perspective ethnic background is a key and useful indicator for a variety of health problems.",
                    "score": 268,
                    "depth": 1,
                    "timestamp": "2023-11-05 10:44:46",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Yep. Don't quote me on that but I heard skin cancer was unlikely for black people unless they tried to become clearer. Cystic fibrosis is also more likely to be diagnosed for white people.",
                            "score": 103,
                            "depth": 2,
                            "timestamp": "2023-11-05 10:56:01",
                            "replies": [
                                {
                                    "author": "iStayGreek",
                                    "body": "Sickle cell, Diabetes, some types of cancer, resistance to certain medications, there’s many many things. \n\nI agree generally when people talk about race and ethnicity not mattering, but for a large part of evolutionary history we were separate pockets of separate human being. And hell, up until recently free movement of people wasn’t exactly common place. People tended to live in their communities and die in their communities.",
                                    "score": 95,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 11:04:34",
                                    "replies": [
                                        {
                                            "author": "maxmacks",
                                            "body": "We weren't completely separate pockets though, there's always been movement between areas, except maybe between afroeurasia and the americas",
                                            "score": 6,
                                            "depth": 4,
                                            "timestamp": "2023-11-06 04:06:16",
                                            "replies": [
                                                {
                                                    "author": "iStayGreek",
                                                    "body": "Yes. Limited movement in times of great strife. It was simply not feasible to move large populations of people like it is today.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2023-11-06 07:21:17",
                                                    "replies": [
                                                        {
                                                            "author": "maxmacks",
                                                            "body": "there is continual movement between close neighbouring regions and by extension it becomes diffiuclt to draw a harsh border between even far away regions that have no contact, not to mention that the borders between these areas were not so easily defined or not defined in the ways they are now",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2023-11-06 15:23:32",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "erlend_nikulausson",
                                    "body": "Not to mention you still hear plenty of stories from modern medicine wherein doctors still seem to believe the long-disproven notion that people of African descent have higher pain tolerances, and so don’t prescribe pain medication in cases where they absolutely should, or believe that symptoms are being exaggerated and sending patients home with broken bones and the suggestion to “take some Tylenol and sleep it off”.",
                                    "score": 24,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 12:04:02",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "HaamerPoiss",
                            "body": "Doesn’t have mu h to do with your skin colour though, however it does have a bit to do with your living conditions. If you are black in the US, then you are more likely to be poor, thus more likely to live in an old house, which was built when asbestos was still legal and thus you are more likely to get the diseases associated with it. \n\nThat’s just a very crude example, but that’s about how it goes.",
                            "score": -21,
                            "depth": 2,
                            "timestamp": "2023-11-05 14:14:06",
                            "replies": [
                                {
                                    "author": "iStayGreek",
                                    "body": "Race isn’t skin color. Just because Americans don’t know what race means, doesn’t mean the rest of the world has to use the stupid black / white dichotomy. \n\nYes, you are correct in that living conditions play a role. Yet a poor white in the US will still have separate medical challenges versus a poor black, because they have vastly different genetic histories.",
                                    "score": 20,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 14:39:39",
                                    "replies": [
                                        {
                                            "author": "HaamerPoiss",
                                            "body": "You are right, race isn’t skin colour. There is only one race and that is the human race. But as people who have no knowledge of biology often claim, it is skin colour.\n\nAnd can you show me, what these different illnesses are that white people get and black people don’t which are strictly tied to their genetics and nothing else?",
                                            "score": -9,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 14:49:15",
                                            "replies": [
                                                {
                                                    "author": "iStayGreek",
                                                    "body": "Sickle Cell is my go to example, as it’s nearly non existent in European populations - https://www.cdc.gov/ncbddd/sicklecell/data.html#:~:text=SCD%20occurs%20among%20about%201,sickle%20cell%20trait%20(SCT).\n\nI listed other examples in this thread, but it should be noted that I’m saying “race” is a beneficial diagnostic tool, because there is a statistically significant difference between ethnicities for common diseases.",
                                                    "score": 9,
                                                    "depth": 5,
                                                    "timestamp": "2023-11-05 14:54:34",
                                                    "replies": [
                                                        {
                                                            "author": "HaamerPoiss",
                                                            "body": "Then I must have understood you wrong, I’m sorry. Then I 100% agree with you, I simply thought that you were trying to suggest that skin colour is some sort of a defining factor in people getting certain diseases.\n\nSorry again for the misunderstanding",
                                                            "score": -3,
                                                            "depth": 6,
                                                            "timestamp": "2023-11-05 15:19:33",
                                                            "replies": [
                                                                {
                                                                    "author": "iStayGreek",
                                                                    "body": "No need to apologize, I just get particular so apologies if I came across as rude.",
                                                                    "score": 5,
                                                                    "depth": 7,
                                                                    "timestamp": "2023-11-05 16:23:01",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kraftian",
                    "body": "Racism is only a social construct because the category of race is arbitrary and socially determined",
                    "score": 13,
                    "depth": 1,
                    "timestamp": "2023-11-05 15:01:05",
                    "replies": []
                },
                {
                    "author": "TurkBoi67",
                    "body": "Maybe now we look at race in a more objective manner, closer to that of ethnicity, but when it was invented, Irish people were considered non-white. I'd say it is a social construct in that way, used to make a caste system",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2023-11-05 18:54:14",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": 26,
                    "depth": 1,
                    "timestamp": "2023-11-05 12:04:01",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "The word \"race\" the way you use it is indeed just a social construct and I will edit my comment to mention this. \n\nHowever, there is a biologic definition of race and this definition is used on many animals but they can't be used on humans which is why there is only one human race. Because we're genetically too similar.",
                            "score": 19,
                            "depth": 2,
                            "timestamp": "2023-11-05 14:04:02",
                            "replies": [
                                {
                                    "author": "nisselioni",
                                    "body": "It's important to remember that the context of race is different in animals than it is in humans. Races in animals are used to specify and classify, while races in humans are used to oppress and discriminate. Human race is a social construct. Animal race is too, but in a very different way. \n\nA lot of things are social constructs. Money is, for example. But money is still a useful tool, and so it becomes real insofar as we use it as currency.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2023-11-06 07:16:05",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "Holy shit, go touch grass.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-11-06 11:19:28",
                    "replies": []
                },
                {
                    "author": "JustaBearEnthusiast",
                    "body": "Race is a social construct though. Biologically there is no way to definitively classify people of different races. Like you can say whites the english and the Japanese are Biologically distinct, but not the english and the Welsh. If you try to classify english and welsh as a race then you just run into the same issue again with the Scottish and so forth until you end up saying the Japanese and the english have to be classified as the same race. Race theory originated in America because you had whites and blacks but noone in between. Once you consider the whole world though it quickly falls apart. Thats why we say race is a social construct because the distinctions are drawn arbitrarily and change with changes in social attitudes. Biologically there are differences between people and to some degree you can predict those differences through outward appearance or ethnicity, but it's a pretty poor predictor in most cases unless the population went through a bottleneck that significantly reduced the genepool.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2023-11-05 21:03:32",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "I don't want to be rude but seriously this is like the fifth time I explain that there's only one human race and that scientifically we don't talk about races to talk about subgroup within humanity. So I just read the first sentence but I know this is another comment saying things I already said in my comment",
                            "score": 9,
                            "depth": 2,
                            "timestamp": "2023-11-05 21:08:14",
                            "replies": [
                                {
                                    "author": "JustaBearEnthusiast",
                                    "body": "you conclude that \"Race isn't a social construct\", but it literally is. The divisions are arbitrary and defined socially not scientifically i.e. constructed socially. Maybe you mean to say something different, but then I don't know why you would conclude with that.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 22:19:55",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "My comment is longer than that tbh. My conclusion is that race is something that exists as a scientific classification and that all humans are part if the same race. It's that race that isn't a social construct, the one that is the scientific definition of race and is also found to describe animals. \nThe \"race\" term for what you described is improper and is indeed a social construct but this is something I adressed a few times in this thread",
                                            "score": 5,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 22:35:43",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": -15,
                    "depth": 1,
                    "timestamp": "2023-11-05 09:54:36",
                    "replies": [
                        {
                            "author": "Virtual-Pollution584",
                            "body": "https://www.organdonation.nhs.uk/helping-you-to-decide/organ-donation-and-ethnicity/\n\nImagine dying from liver failure because your fellow social contstructs of similar nature don't donate as much as those other social constructs do. 🤔",
                            "score": 19,
                            "depth": 2,
                            "timestamp": "2023-11-05 11:08:35",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[removed]",
                                    "score": -2,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 12:55:30",
                                    "replies": [
                                        {
                                            "author": "Virtual-Pollution584",
                                            "body": "But I can be racist against Mongolians. That makes them a race.",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 14:09:59",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "[removed]",
                                                    "score": 6,
                                                    "depth": 5,
                                                    "timestamp": "2023-11-05 15:18:37",
                                                    "replies": [
                                                        {
                                                            "author": "Virtual-Pollution584",
                                                            "body": "Seems so.",
                                                            "score": -1,
                                                            "depth": 6,
                                                            "timestamp": "2023-11-05 15:21:40",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Deleted",
                            "body": "What you're saying complete what I was saying because I forgot to mention that race has no justified use for humans from a scientific perspective. However the way it is commonly used in the English language and is used or used to be used in other languages, is a social construct almost completely arbitrary.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2023-11-05 10:12:27",
                            "replies": []
                        },
                        {
                            "author": "HexiMaster",
                            "body": "Race (as a bunch of hard lines drawn between groups of people) is a social construct, but there are differences, some skin deep some not so much.\n\nSocial construct (and any other construct) always arise from physical reality, they are just an easy way to categorize complex and fluid sets. That doesn't render them useless, tho.\n\nFor instance take your average day, if you ask bunch of people from which to which hour is \"morning\" you will get bunch of answers. Sure, a \"morning\" is a construct here, a categorization of a certain span of time with some common features, but that doesn't make the term useless because it is \"made up\". In fact we made the term up because it's useful in distinguishing certain parts of the day.\n\nIt's like holding an apple and refusing to call the apple an apple because, in reality it is bunch of atoms clumped together.\n\nAlso race is not defined by \"features selected on a completely arbitrary basis\", race is directly tied to your genetic lineage.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-11-05 11:56:42",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IkeyJesus",
                    "body": "If humans are the same then why are pro basketball players mostly black?",
                    "score": -4,
                    "depth": 1,
                    "timestamp": "2023-11-05 16:49:21",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "There are a few genes that differs and can give you a good headstart. Although, the answer to that question is probably that it's culturally rewarded for black people to play sports, a basket ball is cheap as fuck and due to historical events a lot of black people are poorer than white people, it's also easy to put a field there and you can just build them it's not really expansive. Black people in France would play football instead because that's something really rewarded here and you just need a 5€ ball. \n\nWhite people are playing tennis, going to the pool and everything you can pay for. Genetic is and will probably play a bigger role thanks to epigenetics and culture but really you'll find black people in numbers there not because they're necessarily better but because it's cheap, rewarded and sometimes when you're poor it's that, illegality or music",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2023-11-05 17:37:27",
                            "replies": [
                                {
                                    "author": "ratione_materiae",
                                    "body": "There is a greater number of whites under the poverty line than blacks under the poverty line. If the only causal factor was poverty, the NBA would still mostly be white.",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 19:01:37",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "Of course but it's not just genes, it's about urbanism, culture and reward. You know young black people like basket so you will put a basketball (field?) near or in a black neighborhood. Black people like playing basketball so they will invest it. And it's just culturally well rewarded to be good at basketball.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 20:03:19",
                                            "replies": [
                                                {
                                                    "author": "ratione_materiae",
                                                    "body": "So an Asian athlete living in an urban environment would be just as skilled at basketball? And an Asian or white sprinter given world-class training and plenty of incentive to succeed would be able to win the Olympic 100m?",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2023-11-06 23:23:20",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "When it comes to human, the model we've been in for a while is a mix of genetics, environment and psychological disposition. Environment is often the biggest element but obviously genetic is the limit. Even with incredible motivation and an incredibly favorable environment, if you're 1m50 (less than the average size for a male in Europe), you'll have issues with many sports. Even if you study diligently and have access to everything, if your working memory (a short term memory that allows you to retain phone numbers until used) is not good enough, you won't do well in maths. \n\nSo basically, yeah an asian or white sprinter with world class training could win the Olympics but there are many parameters. There's no reason to think that white people are better swimmers, tennis players or fighters, yet as far as I know Djokovic, Nadal and Federer are among the best players. Tyson Fury is the champion in his weight class and Khabib beat everyone in his trail",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2023-11-06 23:51:33",
                                                            "replies": [
                                                                {
                                                                    "author": "ratione_materiae",
                                                                    "body": "> There's no reason to think that white people are better swimmers, tennis players or fighters\n\nTennis and fighting perhaps, but [bone density differs by ethnicity](https://www.sciencedirect.com/science/article/pii/S0085253815563552), which obviously is a factor in an aquatic environment. \n\nHow many asian and white sprinters have won Olympic sprinting medals in the past 20 years, or even ran in the finals for that matter?",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2023-11-07 00:05:59",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "IkeyJesus",
                                    "body": "I see. It's ok to assume most black people are poor and that this is a cultural issue... Not a genetic issue. Very very smart.",
                                    "score": -4,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 17:48:34",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "No_Suggestion_1754",
                    "body": "wonderful comment. thank you.",
                    "score": -6,
                    "depth": 1,
                    "timestamp": "2023-11-05 13:55:02",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "I’m curious what you think a social construct is if you don’t think race falls within that category",
                    "score": -13,
                    "depth": 1,
                    "timestamp": "2023-11-05 10:53:20",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Race is like depression or schizophrenia. There's the scientific term and the commonly used. I'm not American but in my country, people will say they're depressed because they have an episode of sadness, that's not depression. People will use the word schizophrenia for dissociative identity disorder. Those aren't the scientific use of the term. \n\nRace is something that has a scientific definition and isn't a social construct at all. I planned to mention the commonly used definition of race but forgot, so yes if you don't pick the scientific definition, race is indeed a social construct based on visible characteristics and geography. But it's not a definition that makes sense from a scientific perspective",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2023-11-05 11:02:23",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "Race does not have scientific definitions. If it does, then define it scientifically.",
                                    "score": -1,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 11:29:52",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "Subdivision of the species based on hereditary physical characteristics, represented by a population\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3737365/\n\n> Genetic data sets are used to see if biological races exist in humans and in our closest evolutionary relative, the chimpanzee. Using the two most commonly used biological concepts of race, chimpanzees are indeed subdivided into races but humans are not. Adaptive traits, such as skin color, have frequently been used to define races in humans, but such adaptive traits reflect the underlying environmental factor to which they are adaptive and not overall genetic differentiation, and different adaptive traits define discordant groups. There are no objective criteria for choosing one adaptive trait over another to define race. As a consequence, adaptive traits do not define races in humans.\n\nI'm not just out there saying stuff on the internet I didn't check beforehand. I do make mistakes but this isn't one of them.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 11:48:49",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "This literally says humans are not divided scientifically into races dumbass. \n\n“There is no objective criteria for choosing one adaptive trait over another to define race” \n\nThis means the criteria are socially constructed. There is no objective distinction so we construct it. Socially. Social construct. This isn’t hard.",
                                                    "score": -2,
                                                    "depth": 5,
                                                    "timestamp": "2023-11-05 12:41:25",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "\n>This literally says humans are not divided scientifically into races dumbass.\n\nBut... My whole point was that race is not a social construct and that the scientific definition of race can't divide people into races.\n\n>“There is no objective criteria for choosing one adaptive trait over another to define race\"\n\nI agree\n\n>This means the criteria are socially constructed. There is no objective distinction so we construct it. Socially. Social construct. This isn’t hard.\n\nAnd this is why we don't understand each others. I stated multiple times that I've been using the scientific definition that specifically can't be used to divide people into races. The definition of \"race\" you're talking about isn't scientific, it's just what is commonly used to by people to talk about differences in skin colors or descriptives traits. Neither biology nor any social science use \"race\" as a word to describe this. I've never said anything that says otherwise.",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2023-11-05 13:58:02",
                                                            "replies": [
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "That scientific definition is socially constructed. How else did it come about? Race is empirically  socially constructed. Idk how this is so hard for you. I described how it was and you didn’t argue the point.",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2023-11-05 16:06:46",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Deleted",
                                                                            "body": ":/ one of us is stupid man. I don't know what to tell you.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2023-11-05 16:11:41",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Deleted",
                                                                                    "body": "Lol okay. You’re the one unable to define a social construct.",
                                                                                    "score": 0,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2023-11-05 16:35:18",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "H7p3X",
            "body": "Since when can't humans distinguish race in skulls?",
            "score": 43,
            "depth": 0,
            "timestamp": "2023-11-05 12:09:36",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Since we determined that was \"Problematic\"...",
                    "score": 50,
                    "depth": 1,
                    "timestamp": "2023-11-05 12:18:37",
                    "replies": [
                        {
                            "author": "gris1448",
                            "body": "That’s not problematic, the problematic part it using it to say that other races are lesser on not even human",
                            "score": -11,
                            "depth": 2,
                            "timestamp": "2023-11-05 13:28:21",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "Motte and Bailey.",
                                    "score": 9,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 13:50:40",
                                    "replies": [
                                        {
                                            "author": "gris1448",
                                            "body": "Huh?",
                                            "score": -2,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 13:54:41",
                                            "replies": [
                                                {
                                                    "author": "MaxBandit",
                                                    "body": "[Motte-and-bailey fallacy](https://en.wikipedia.org/wiki/Motte-and-bailey_fallacy)",
                                                    "score": 10,
                                                    "depth": 5,
                                                    "timestamp": "2023-11-05 16:31:41",
                                                    "replies": [
                                                        {
                                                            "author": "gris1448",
                                                            "body": "That’s not really what I’m doing because even my Bailey is easy to defend, it is wrong to say different races are lesser than others solely based off race",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2023-11-06 09:06:52",
                                                            "replies": [
                                                                {
                                                                    "author": "MaxBandit",
                                                                    "body": ">it is wrong to say different races are lesser than others solely based off race\n\nThat's your motte",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2023-11-06 09:55:18",
                                                                    "replies": [
                                                                        {
                                                                            "author": "gris1448",
                                                                            "body": "And my Bailey?",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2023-11-06 09:56:05",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MaxBandit",
                                                                                    "body": "That it's problematic to distinguish \"race\" through skulls I assume, I'm not the original commenter",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2023-11-06 09:58:14",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "gris1448",
                                                                                            "body": "I said I agree with him on that tho",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2023-11-06 09:58:45",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "MaxBandit",
                                                                                                    "body": "He didn't even bring up other races or anything being inferior in the first place, you did (even though that's not what he was talking about), hence the motte and bailey accusation",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2023-11-06 10:02:37",
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "KhaleesiXev",
            "body": "Phrenology is making a comeback",
            "score": 9,
            "depth": 0,
            "timestamp": "2023-11-05 09:38:46",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 62,
            "depth": 0,
            "timestamp": "2023-11-05 09:02:51",
            "replies": []
        },
        {
            "author": "RunInRunOn",
            "body": "Wait, why does having differently shaped skulls justify racism?",
            "score": 152,
            "depth": 0,
            "timestamp": "2023-11-05 09:36:40",
            "replies": [
                {
                    "author": "Ok_Digger",
                    "body": "Dont you see? Black people were made to eat fried chicken and watermelons!!",
                    "score": 248,
                    "depth": 1,
                    "timestamp": "2023-11-05 09:52:02",
                    "replies": [
                        {
                            "author": "_Flameo_Hotman",
                            "body": "This is obvious! Also look at White skulls, they were just made to eat cheese and drink milk! That’s why the skin is so white too. Same with Asians, rice and fish. It all adds up!!!!1!",
                            "score": 68,
                            "depth": 2,
                            "timestamp": "2023-11-05 11:30:13",
                            "replies": [
                                {
                                    "author": "Brilliant-Mountain57",
                                    "body": "Omg all the casserole made their skulls casserole shaped! and look! You can even see the outline of a nice moist crispy drumstick on the head of the black guy. It's all coming together.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2023-11-06 21:14:19",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Able_Caregiver8067",
                    "body": "Watch django unchained. Calvin Candie explains it.",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2023-11-05 12:18:21",
                    "replies": []
                },
                {
                    "author": "baconborg",
                    "body": "The elite won’t tell you this but your skeleton is actually racist and quietly whispers pro racism messages into your brain 24/7 in an effort to convince you to hate other people so you might kill them and free their skeletons from their bodies",
                    "score": 35,
                    "depth": 1,
                    "timestamp": "2023-11-05 10:57:54",
                    "replies": []
                },
                {
                    "author": "Distant_Congo_Music",
                    "body": "Old racist pseudo science called phrenology where the would essentially go \"see the deviations in the skull on the non white races this lowers their intelligence and makes whites being their masters justifiable\" when you know that's not how that works and the \"deviations\" they found didn't mean shit for affecting intelligence.",
                    "score": 63,
                    "depth": 1,
                    "timestamp": "2023-11-05 10:28:59",
                    "replies": [
                        {
                            "author": "Whole_Radish_4675",
                            "body": "They tried using phrenology to determine if there’s a criminal trait to explain why crime exists.",
                            "score": 7,
                            "depth": 2,
                            "timestamp": "2023-11-05 17:25:37",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "joesph_e",
                    "body": "It shows that race is real.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2023-11-05 15:23:01",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "[deleted]",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2023-11-05 12:10:29",
                    "replies": [
                        {
                            "author": "Its7MinutesNot5",
                            "body": "\"IQ is real\". Yes, the test surely is real and doesn't just reflect access to the education within certain areas. \nSurely giving L1 Kinyarwanda-speakers an English IQ-Test is a scientifically sound way to proof that certain ethnicities are stupid. \n\nThe bell curve and its consequences have been a disaster for the scientific discussion.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2023-11-06 05:12:56",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2023-11-06 08:00:04",
                                    "replies": [
                                        {
                                            "author": "Its7MinutesNot5",
                                            "body": "Not that there is a host of literature obliterating IQ, but I am curious. What makes you think that something like intelligence is measurable with just a single number?",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2023-11-06 13:25:33",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2023-11-06 15:28:43",
                                                    "replies": [
                                                        {
                                                            "author": "Brilliant-Mountain57",
                                                            "body": "Bro where the fuck do you live that middle school is teaching stats? This shit be pissing me off the most when people just say wild shit like that and pretend its normal.",
                                                            "score": 4,
                                                            "depth": 6,
                                                            "timestamp": "2023-11-06 21:16:31",
                                                            "replies": [
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2023-11-06 22:47:18",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Brilliant-Mountain57",
                                                                            "body": "I went to a private school and was never taught stats, guess I can't blame public education for this one but still, I feel kinda cheated.",
                                                                            "score": 3,
                                                                            "depth": 8,
                                                                            "timestamp": "2023-11-06 23:03:50",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Deleted",
                                                                                    "body": "[deleted]",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2023-11-06 23:40:04",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Brilliant-Mountain57",
                                                                                            "body": "Oh ok, yea that probably explains it but definitely not until high-school. Thanks for clearing that up.",
                                                                                            "score": 2,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2023-11-07 07:25:47",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "InterestingKid",
                            "body": "IQ isnt real fym lol",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-11-06 14:30:30",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BigRailWillFail",
                    "body": "Educate yourself on James Watson. He is a Nobel winning Biologist. He has some answers for you.",
                    "score": -10,
                    "depth": 1,
                    "timestamp": "2023-11-05 10:37:23",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "He won the Nobel for an unrelated reason. Then dude wouldn’t stop acting like your average uncle at thanksgiving dinner so they took away his titles.  Bait or highly regarded?",
                            "score": -5,
                            "depth": 2,
                            "timestamp": "2023-11-05 11:22:45",
                            "replies": [
                                {
                                    "author": "BigRailWillFail",
                                    "body": "He won the Nobel for discovering what is the foundational building block for anything alive.",
                                    "score": 7,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 11:30:15",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "Sure. The thing everyone has an almost identical strand of. How is this justifying racism?",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 18:02:23",
                                            "replies": [
                                                {
                                                    "author": "BigRailWillFail",
                                                    "body": "But they aren’t identical and are responsible for forming who people are. Trust the science",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2023-11-05 21:55:53",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Conch-Republic",
                            "body": "He was a racist shithead who got a Nobel prize for the discovery of DNA. His claims on race were unfounded, and he ended up losing a bunch of titles over various racist shit he spewed over the years. What's your point?",
                            "score": -10,
                            "depth": 2,
                            "timestamp": "2023-11-05 11:08:30",
                            "replies": [
                                {
                                    "author": "Monitor_Sufficient",
                                    "body": "No, he gave a valid summation on how to truly help Africa. What claims of his are you saying were unfounded?",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 13:00:39",
                                    "replies": [
                                        {
                                            "author": "Conch-Republic",
                                            "body": "https://www.smithsonianmag.com/smart-news/dna-pioneer-james-watson-loses-honorary-titles-over-racist-comments-180971266/\n\nHe's a racist piece of shit, which is why losers like him. He does have some valid points, but he also has dumb opinions on race that aren't backed by any sort of science.",
                                            "score": -14,
                                            "depth": 4,
                                            "timestamp": "2023-11-05 13:08:53",
                                            "replies": [
                                                {
                                                    "author": "Monitor_Sufficient",
                                                    "body": ">most intelligence experts attribute differences in I.Q. testing mainly to “environmental, not genetic, differences.”\n\nThat's the closest it comes to deboonking his claims. Which is the equivalent of \"no u\". And maybe the differences are environmental. That just begs the question of why African environments produce people with low IQ. \n\nhttps://worldpopulationreview.com/country-rankings/average-iq-by-country",
                                                    "score": 7,
                                                    "depth": 5,
                                                    "timestamp": "2023-11-05 13:59:32",
                                                    "replies": [
                                                        {
                                                            "author": "Danny-Fr",
                                                            "body": "Ask any psychologist worth their salt about IQ and they're gonna tell you it's a very flawed way to measure intelligence. The tests themselves are a better fit for a distinct set of skills, whose development is emphasized differently depending on the learner's environment. Results are shaped by education and environment as mich (if not more) than they are by innate capability.",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2023-11-05 15:19:17",
                                                            "replies": [
                                                                {
                                                                    "author": "Monitor_Sufficient",
                                                                    "body": "But the results do correlate with other things. There isn't much innovation coming out of Africa, for example. You even inadvertently kinda touched on this by stating \"Results are shaped by education and environment\" ok, but why is education and environment so bad there?",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2023-11-05 15:47:30",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Danny-Fr",
                                                                            "body": "Read the history of Africa. It's a real clusterfuck.  \nI don't stick with \"the sins of our fathers\" bullshit, but colonisation did and still is doing a number in many countries there. \n\nThe problem with colonisation isn't just theft of resources and manpower, it's also the lasting dismantlement of social and political structures and, as a side effect, infrastructure as well.\n\nIf you back up a coup for generic puppet dictator #639 to keep your grasp on a country, you can be sure they're not going to use their advantages to build universities and infrastructure.",
                                                                            "score": -1,
                                                                            "depth": 8,
                                                                            "timestamp": "2023-11-05 15:55:53",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Danny-Fr",
                                                                            "body": "Read the history of Africa. It's a real clusterfuck.  \nI don't stick with \"the sins of our fathers\" bullshit, but colonisation did and still is doing a number in many countries there. \n\nThe problem with colonisation isn't just theft of resources and manpower, it's also the lasting dismantlement of social and political structures and, as a side effect, infrastructure as well.\n\nIf you back up a coup for generic puppet dictator #639 to keep your grasp on a country, you can be sure they're not going to use their advantages to build universities and infrastructure.",
                                                                            "score": -2,
                                                                            "depth": 8,
                                                                            "timestamp": "2023-11-05 15:56:08",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Monitor_Sufficient",
                                                                                    "body": "Ethiopia was never colonised yet still suffers from the same problems other African countries do. Singapore was heavily colonised but is now an incredibly wealthy and productive state, same as Hong Kong and I'm sure many other places outside of Africa too. Just the simple fact that such a vast continent was able to be colonised speaks volumes relevant to this conversation.",
                                                                                    "score": 7,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2023-11-05 16:18:47",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Danny-Fr",
                                                                                            "body": "Ethiopia was repeatedly occupied and its government was toppled by Russia, then collapsed with the USSR. Singapore and HK are marginally bigger than a sticker thus immensely easier to govern and are strategically placed to be maritime commercial hotspots which guarantees affluence of goods and commerce from everywhere. Apple and orange.\n\nThe fact that such a vast continent was colonized in the first place was that guns > no guns, see New Zealand, see Australia, see Canada, see Native Americans. \n\nOf course when you knock someone down it's easier to call them stupid, too.",
                                                                                            "score": 2,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2023-11-05 16:33:47",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Monitor_Sufficient",
                                                                                                    "body": ">guns > no guns\n\nThat was my point. The technological capabilities were profoundly at odds.\n\nThe whole point, to bring it back, is that James Watson had his name dragged through the dirt for making the observation that Africa is in bad shape. In his expert opinion problems there are related to IQ and we need to take this into account when giving support to African nations. I understand why white liberals hate him for this, but in their efforts to destroy him they are only harming the development of Africa.",
                                                                                                    "score": 3,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2023-11-05 16:56:50",
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Chadzuma",
                    "body": "Less visual evolutionary deviation from the skulls of other primates. Whether that qualifies as a *justification* I'll leave up to your discretion, but that's the basic idea and one of the foundations of why comparing certain races to monkeys is so deeply taboo. Nobody wants to feel less evolved.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2023-11-05 18:10:30",
                    "replies": [
                        {
                            "author": "TurkBoi67",
                            "body": "The civilization argument never worked because Europeans lived in their own filth and exploited the land for resources much more than that of Africans and Native Americans. \"Civilization\" is a kind of eurocentric word, especially back then when Europeans also practiced cannibalism and torture.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2023-11-05 18:58:49",
                            "replies": [
                                {
                                    "author": "Chadzuma",
                                    "body": "Mf brought up civilization out of nowhere and proceeded to call it racist",
                                    "score": 8,
                                    "depth": 3,
                                    "timestamp": "2023-11-05 20:08:14",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PlantKey",
                    "body": "Jango unchained reference",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-11-05 09:40:50",
                    "replies": []
                }
            ]
        },
        {
            "author": "TruthOrBullshite",
            "body": "No, legitimately, AI will become racist if no \"humanity\" controls are put in place.\n\nIt's something you learn when studying AI",
            "score": 27,
            "depth": 0,
            "timestamp": "2023-11-05 11:38:35",
            "replies": [
                {
                    "author": "AshleySchaeffersPlum",
                    "body": "That’s awesome",
                    "score": 45,
                    "depth": 1,
                    "timestamp": "2023-11-05 12:40:13",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "Maybe there's a reason for that... 🤔",
                    "score": 31,
                    "depth": 1,
                    "timestamp": "2023-11-05 12:17:37",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "Didn’t that Microsoft AI turn into Hitler after like 3 hours of being made public, and had to be shut down?\n\nThis is why I’m not worried about AI at all. Every time the AI needs to be so lobotomized or restricted that it will never reach its full potential.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2023-11-07 23:10:19",
                    "replies": []
                }
            ]
        },
        {
            "author": "Gaius_Julius_Salad",
            "body": "wouldnt facial bone structure be an obvious way to do it?",
            "score": 5,
            "depth": 0,
            "timestamp": "2023-11-05 12:21:01",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "There was a thing where AI can detect some respiratory disease from a chest x-ray I really wish I could remember which one\n\nBasically they figured out that the AI wasn't seeing something doctors miss, it was just using metadata from the image and saying anyone who's imaging was done on a machine older than like 30 years had the disease since it's only in poor areas\n\nI wouldn't be surprised if it's going off the zip code of the hospital or some shit",
            "score": 3,
            "depth": 0,
            "timestamp": "2023-11-05 18:40:50",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "The current scientific consensus is: \"Race exists, but we'd prefer if it didn't, because we are afraid of the unwashed proles whose taxes pay our wages.\"\n\nhttps://archive.ph/upIdp",
            "score": 17,
            "depth": 0,
            "timestamp": "2023-11-05 13:24:46",
            "replies": []
        },
        {
            "author": "SharkMilk44",
            "body": "Scientists who can't tell the difference between men and women can't tell the difference between races.",
            "score": 10,
            "depth": 0,
            "timestamp": "2023-11-05 13:12:16",
            "replies": []
        },
        {
            "author": "Danny-Fr",
            "body": "This thread is a wild ride, from \"Muh gEnEtIC mAkeUp dOnT iNfLuEnCe hEaLtH\" to \"Reeeeee phrenology\".\n\nNot being racist is recognizing our differences while acknowledging that none of those differences make us lesser humans with lesser rights. If you deny those differences exist how can you accept them?",
            "score": 3,
            "depth": 0,
            "timestamp": "2023-11-05 15:26:48",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 9,
            "depth": 0,
            "timestamp": "2023-11-05 13:42:14",
            "replies": [
                {
                    "author": "TurkBoi67",
                    "body": "It is, using a couple of cherry-picked examples doesn't support the argument.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-11-05 19:00:40",
                    "replies": []
                },
                {
                    "author": "Stockfish_14",
                    "body": "Pretty sure it things the conclusions they made because the skeletal structure is different is the pseudo science.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2023-11-10 01:00:35",
                    "replies": []
                }
            ]
        },
        {
            "author": "Invisiblecurse",
            "body": "You can check out the trigger me elmo doll",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-11-05 11:23:09",
            "replies": []
        },
        {
            "author": "ser_stroome",
            "body": "I've seen enough dicks in porn that I'm pretty sure I can tell the race of a person with 90% accuracy if I get a dick x-ray.",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-11-05 14:41:58",
            "replies": []
        },
        {
            "author": "ReflectionOther2147",
            "body": "Yeah but ai determine gender from the ex-raymonds?",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-11-05 16:06:13",
            "replies": []
        },
        {
            "author": "loscapos5",
            "body": "#DATS RIIIITE",
            "score": 4,
            "depth": 0,
            "timestamp": "2023-11-05 14:25:29",
            "replies": []
        },
        {
            "author": "Fanficwriter777",
            "body": "Lol at this . No more accurate than Amazon ring when it racially profiled people incorrectly , and then sent the police to over 200 houses . All of the arrests were rescinded and Amazon got flak .",
            "score": 0,
            "depth": 0,
            "timestamp": "2023-11-05 18:40:20",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "How does it work? Probably some tuned CNN algorithm, Convolution works by minimizing the features from the images",
            "score": -1,
            "depth": 0,
            "timestamp": "2023-11-05 15:01:10",
            "replies": []
        },
        {
            "author": "blueguy211",
            "body": "bad news your unborn has the degenerate gene do you wish to proceed with the abortion?",
            "score": -2,
            "depth": 0,
            "timestamp": "2023-11-05 15:53:36",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Is that a quote from your mother's obgyn?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-11-05 17:10:09",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "We’re well aware that different races can have slightly different skeletons, and have been for decades",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-11-05 20:55:57",
            "replies": []
        },
        {
            "author": "gloumii",
            "body": "What do they mean they don't know how it can do that ? People have been doing this for decades at least. Just by looking at the bones you can see if it was a man or woman. Black, white, Asian and even the region they were most likely from",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-11-06 02:28:22",
            "replies": []
        },
        {
            "author": "mortallyChallenged69",
            "body": "Excuse me all you A.I worshippers but the other day AI flagged the nipple in a mammogram as a tumor so excuse me if I don't believe the fucking research is accurate.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-11-06 05:26:29",
            "replies": []
        }
    ]
}