{
    "post_title": "How do CBP officers check phones at port of entry",
    "post_timestamp": "2025-04-10 11:38:59",
    "last_comment_timestamp": "2025-04-17 19:29:55",
    "time_difference": "7 days, 7:50:56",
    "comments": [
        {
            "author": "OpeningOstrich6635",
            "body": "A basic search generally entails an officer reviewing the contents of the device manually without the assistance of any external equipment.\n\nAn advanced search is any search in which an officer connects external equipment to an electronic device not merely to gain access to the device, but to review, copy, and/or analyze its contents. Under CBP policy, advanced searches require reasonable suspicion of a violation of law enforced or administered by CBP or a national security concern and require the approval of a senior manager (at a Grade 14 level or higher, or a manager with comparable responsibilities) prior to conducting the search.",
            "score": 46,
            "depth": 0,
            "timestamp": "2025-04-10 11:43:21",
            "replies": [
                {
                    "author": "postbox134",
                    "body": "I've heard that the advance search can only find things locally on the device, not in cloud backups etc.",
                    "score": 14,
                    "depth": 1,
                    "timestamp": "2025-04-10 11:47:50",
                    "replies": [
                        {
                            "author": "WoodyForestt",
                            "body": "CBP's policy says they are not supposed to search anything stored online, they are only supposed to search what is locally on the device.",
                            "score": 16,
                            "depth": 2,
                            "timestamp": "2025-04-10 12:41:00",
                            "replies": [
                                {
                                    "author": "Odd_History4720",
                                    "body": "Keyword “policy” - I’d sell that phone immediately if they took it.",
                                    "score": 12,
                                    "depth": 3,
                                    "timestamp": "2025-04-10 13:52:32",
                                    "replies": []
                                },
                                {
                                    "author": "Specific-Umpire-8199",
                                    "body": "Correct - they are only supposed to search whilst in airplane mode I read recently",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-11 09:03:28",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Altruistic_Reveal_51",
                            "body": "Basic search is local and manual by an Officer. Advanced search includes using forensic\nTools to access and pull data.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2025-04-11 06:35:19",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "textonic",
                    "body": "I have like a hundred messages a day on iMessage and WhatsApp. I’m really wondering how they go thru that",
                    "score": 17,
                    "depth": 1,
                    "timestamp": "2025-04-10 11:47:25",
                    "replies": [
                        {
                            "author": "postbox134",
                            "body": "Search for 'working' 'hours' 'pay' 'paycheck' 'deposit' 'manager' etc. would throw up work related messages quite easily.",
                            "score": 27,
                            "depth": 2,
                            "timestamp": "2025-04-10 11:49:00",
                            "replies": [
                                {
                                    "author": "textonic",
                                    "body": "That makes so much more sense",
                                    "score": 9,
                                    "depth": 3,
                                    "timestamp": "2025-04-10 11:49:50",
                                    "replies": [
                                        {
                                            "author": "winkee01",
                                            "body": "What if messages are in different languages? CBP officials are not expected to know all languages.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-11 06:52:14",
                                            "replies": [
                                                {
                                                    "author": "AlbaMcAlba",
                                                    "body": "The US is the most multi cultural country on the planet they’ll have access locally or via an agency to every language pretty much.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-11 07:22:26",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "vanhalenbr",
                            "body": "Nowadays you can use AI models and look for patterns. I am not sure if they are or not. Just saying it’s technically possible. ",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2025-04-10 17:00:38",
                            "replies": []
                        },
                        {
                            "author": "Letoust",
                            "body": "You’d sit in a little room while they take as much time as needed to go through it 🤷🏻‍♀️",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-04-10 18:29:14",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WoodyForestt",
                    "body": "> A basic search generally entails an officer reviewing the contents of the device manually without the assistance of any external equipment.\n\nWhen CBP says \"less than .1 percent of travelers have their phones searched\" are they including all the times when  an officer takes a quick look through an unlocked phone in secondary inspection?",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2025-04-10 16:35:27",
                    "replies": [
                        {
                            "author": "scotc130lm",
                            "body": "Yes they are required to document every look at a phone.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-04-10 22:07:52",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-10 19:29:27",
                    "replies": [
                        {
                            "author": "AdParticular6193",
                            "body": "From what I’ve seen on this sub, that would probably make things worse. If they found that your phone was encrypted and you refused to unlock it, they would confiscate it and go through all your stuff with a fine tooth comb. They might not be able to break into it unless they had evidence you were some kind of national security threat, but you will still be without your phone for several weeks, if you get it back at all. Best thing is to get that digital footprint cleaned up, and not just for immigration. You never know who might be watching. And make backup copies of all important stuff to keep at home, just in case. From what I have seen on TV, they mostly look at email, photos, and social media. So make sure to get those cleaned up.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-10 19:56:56",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[removed]",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-04-10 20:22:31",
                                    "replies": [
                                        {
                                            "author": "AdParticular6193",
                                            "body": "How about cancelling the Facebook account and starting a new one? Or get a second phone just for traveling, with different Facebook and email accounts. And be sure to delete any inappropriate messages and posts as they come in. Or there might be apps out there you can use to make the cleanup more manageable.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2025-04-10 20:27:46",
                                            "replies": [
                                                {
                                                    "author": "tusant",
                                                    "body": "Does this apply to those of us who are 5-6 generation born American citizens? Like your only foreign relative was from England or Scotland  back in the 1600s?",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-11 10:17:22",
                                                    "replies": [
                                                        {
                                                            "author": "AdParticular6193",
                                                            "body": "Maybe you are being sarcastic? These situations apply to green card holders and people coming in on visas. They can’t bar a citizen from re-entering, but they might question them and look at their phone if they think they are engaging in illegal activity or have an outstanding warrant.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-11 10:24:17",
                                                            "replies": [
                                                                {
                                                                    "author": "tusant",
                                                                    "body": " Not being sarcastic at all. Someone in this post said that they had their phone searched upon reentry and their global entry was canceled. My digital footprint has lots of negative references to the current administration so  that’s what I’m wondering.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-04-11 10:26:07",
                                                                    "replies": [
                                                                        {
                                                                            "author": "AdParticular6193",
                                                                            "body": "My apologies. As long as you’re not doing anything illegal you’re fine.",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-04-11 10:28:19",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "tusant",
                                                                                    "body": "Thx. Still very scary as it seems, they can do anything they want to whomever they want with impunity",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-04-11 10:29:20",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pro_Gamer_Ahsan",
                    "body": "Someone I knew told me once they had their deleted Whatsapp messages (both text and voice) accessed by them. Cbp agent apparently then invented a bogus reason out of those to deny then entry. I wonder how they can access deleted messages (Whatsapp at that being end to end encrypted)",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-17 19:29:55",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "[deleted]",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-10 17:15:06",
                    "replies": [
                        {
                            "author": "redchilipepperr",
                            "body": "If they ask you for your phone and you show them the fake one you never use; I can guarantee you that would be suspicious. They don’t have to have any type of suspension to open all of your luggage to search thru them. All items and person are subject to inspection. When they find that second phone(your actual phone) they would use that as the reasonable suspicion they need to go thru it. \n\nThen cbp will ask you to change the language back. \n\nIf you don’t have any thing to hide, then there’s no need to be paranoid. Anything you can think of, others have too.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2025-04-10 17:21:39",
                            "replies": []
                        },
                        {
                            "author": "Ablomis",
                            "body": "They can deny entry pretty much for any reason if you are on a visa, you know that right?",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2025-04-10 17:24:10",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[removed]",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-04-10 17:25:33",
                                    "replies": [
                                        {
                                            "author": "Ablomis",
                                            "body": "I really doubt they will waste their time on searching your phone. What for? They can’t really deny you entry anyway",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-04-10 17:47:19",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Flat_Shame_2377",
                            "body": "You can do whatever you want to hide your bad faith/illegal purposes but CBP can simply detain you and eventually send you home somehow.\n\nCBP has all the power at your point of entry and they aren’t constrained by many limits on their power.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-10 19:25:57",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dmxcasper2",
            "body": "Can I ask a dumb question? What are they interested in finding by performing these searches?",
            "score": 7,
            "depth": 0,
            "timestamp": "2025-04-10 16:22:59",
            "replies": [
                {
                    "author": "imapilotaz",
                    "body": "Messages on working (when on tourist or student visa). Messages on illegal activity (drugs, prostitution, etc).   Messages on extreme views (terrorism, etc). \n\nLets face it, a huge chunk of \"criminals\" are fucking stupid as hell. They incriminate themselves daily. They are the low hanging fruit CBP is looking for in these searches.",
                    "score": 15,
                    "depth": 1,
                    "timestamp": "2025-04-10 16:35:25",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2025-04-10 18:39:17",
                    "replies": [
                        {
                            "author": "Grim-Sleeper",
                            "body": "That's a great story, but it really doesn't work that way. Europeans usually visit on a visa waiver, and a visit to another North American country doesn't reset their presence in the USA. \n\n\nEven if they genuinely had just spent three months in Mexico, that would still count as time spent in the US, starting from when they first entered.",
                            "score": -2,
                            "depth": 2,
                            "timestamp": "2025-04-10 23:20:07",
                            "replies": [
                                {
                                    "author": "LeagueMoney9561",
                                    "body": "I don’t believe it counts as time spent in US (in the context of it being an overstay), but indeed it does not reset the clock for the VWP time limit.  So re-entry after more than 90 days from initial entry without leaving Canada, Mexico or “adjacent islands” shouldn’t be allowed.  Burden of proof of no overstay with exit by land to Mexico is on the traveler, and so is proof of leaving the zone specified earlier if necessary for re-entry.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-04-12 10:37:50",
                                    "replies": []
                                },
                                {
                                    "author": "Deleted",
                                    "body": "[removed]",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-04-11 00:01:07",
                                    "replies": [
                                        {
                                            "author": "Grim-Sleeper",
                                            "body": "How about the missing passport stamps showing that they left the North American continent? It's on the tourist to prove exit, or their ESTA simply keeps counting the time as never having left he US",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2025-04-11 00:28:21",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-11 06:15:16",
                                                    "replies": [
                                                        {
                                                            "author": "LeagueMoney9561",
                                                            "body": "If living in the US probably not staying under VWP (at least whilst residing there)",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-12 10:19:00",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "postbox134",
            "body": "There's two types of searches.\n\n1) They get you to unlock the phone and just scroll around in common apps/search for certain terms.\n\n2) They can take your phone and forensically inspect it with proper tools etc. That is more rare.\n\nStory time: Last year I was entering the US on an I-551 stamp at JFK which required a short trip to secondary. While I was there, the CBP officers were interrogating a student from Kazakhstan who had tried to enter on his F1 student visa 3 months before classes start (this was June and his classes were starting in September). The officers were a little confused about what to do and the supervisor was minded to enter him as a tourist B2 for 6 months and then he'd have to re-enter before his classes. His stated reason for coming early was to 'hang with his friends'.\n\nThings took a turn for the worse when they looked at his phone, found a photo of him wearing a waiter uniform. They worked out which restaurant that was and they asked him how much he was paid etc. As I left, it looked like they were about to deny him for unauthorized work. I did feel bad for him, as his English was very limited and he was basically self-incriminating with every thing he said. But it did seem that they had him red handed working in the US from a quick search of his Instagram.",
            "score": 24,
            "depth": 0,
            "timestamp": "2025-04-10 11:45:25",
            "replies": [
                {
                    "author": "textonic",
                    "body": "Apple and google needs to make burner accounts like Reddit lol",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2025-04-10 11:46:46",
                    "replies": [
                        {
                            "author": "postbox134",
                            "body": "If I was him, I'd have wiped my phone of that stuff before. They do apparently check deleted items and stuff if you don't full delete things.",
                            "score": 11,
                            "depth": 2,
                            "timestamp": "2025-04-10 11:47:32",
                            "replies": [
                                {
                                    "author": "Murky_Bumblebee1271",
                                    "body": "Other posts have recommended to wipe your phone and set it up fresh if you are worried. Then recover from backup afterwards.\n\nIf you watch any of the border security TV shows, it shows the officer manually scrolling through the phone.",
                                    "score": 7,
                                    "depth": 3,
                                    "timestamp": "2025-04-10 14:16:46",
                                    "replies": [
                                        {
                                            "author": "postbox134",
                                            "body": "That would be quite suspicious though - have a totally blank phone",
                                            "score": 10,
                                            "depth": 4,
                                            "timestamp": "2025-04-10 14:18:19",
                                            "replies": [
                                                {
                                                    "author": "curiousengineer601",
                                                    "body": "I would think so also. No contacts or texts ever? Why did you wipe your phone?",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-10 18:33:22",
                                                    "replies": [
                                                        {
                                                            "author": "Alert_Special_7059",
                                                            "body": "If they're at the point of wanting to search your phone then they're probably suspicious of something anyway and looking for a reason to send you back. Better to have a blank phone than give them access to data that they potentially may send you home for - please note I'm not referring to anything illegal, but for example comments about the current administration, and don't we have a case where someone whose phone was searched got sent back because of a comment their *friend* had made in a chat found on the phone?",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-10 19:49:49",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "apokrif1",
                                                            "body": "Use a dedicated, new (unwiped, with a few innocuous things) phone for travel?",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-10 22:57:33",
                                                            "replies": [
                                                                {
                                                                    "author": "curiousengineer601",
                                                                    "body": "I mean it might be a story you have to sell. Show up with the airline app, latest earbuds and the only app is facebook with mom your only friend?\n\nWhat is your response when they ask you why you wiped your phone? Even if you didn’t? \n\nI don’t know the answer. I have several emails and might delete all but the business one. Erase the trash. Erase messaging apps and reinstall later.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-04-10 23:11:19",
                                                                    "replies": [
                                                                        {
                                                                            "author": "apokrif1",
                                                                            "body": "Officer, I lost/broke/my son ate/my dog stole the previous one :-(\n\n\nFor many things like Facebook, there is a website so you don't need to waste storage to store an app (which might be not well designed, present a  security risk because not protected by password, and not be adblockable).",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-04-11 04:13:04",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "scotc130lm",
                                    "body": "Forensic search can also review overwrites on the phone where someone has brought it back to original",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-10 22:11:55",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "Wow, that's quite impressive of them.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-10 12:30:00",
                    "replies": []
                }
            ]
        },
        {
            "author": "Joenair85",
            "body": "They probably type keywords like ‘Trump’ and/or ‘Israel/Palestine’ into your message search and see if you’re on their team…",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-04-10 18:17:21",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-04-10 19:34:25",
                    "replies": [
                        {
                            "author": "Joenair85",
                            "body": "They can’t keep you out though. Just the immigrants.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-10 19:35:21",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jewboy916",
            "body": "Are they expecting to see tons of messages in English on the phones of people coming in from countries that don't typically speak English? Or do they call an interpreter to look through the messages?",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-04-10 15:52:47",
            "replies": [
                {
                    "author": "curiousengineer601",
                    "body": "Many of the cases are people looking to work on the wrong visa. Those conversations are often in English.\n\nCBP has a bunch of people who can read and write various languages. Its not that hard to cover the big ones",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-04-10 18:35:24",
                    "replies": []
                }
            ]
        },
        {
            "author": "BigDSAT",
            "body": "Someone who recently went through this explained on Reddit that he was putting a room alone they asked for the password to his devices. They took the devices out of the room were gone for about an hour, then came back, gave him the devices back and told him he was free to go. A short time later he got notification that his global entry was canceled.",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-04-10 18:08:32",
            "replies": [
                {
                    "author": "Feeling-Fill-5233",
                    "body": "Do you have link to the original post?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-11 02:55:54",
                    "replies": []
                }
            ]
        },
        {
            "author": "A-to-fucking-Z",
            "body": "Just a basic search. They even confronted me about having a text from Shopify asking what was the code about. Told them, I don’t know—spam?",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-04-10 15:20:35",
            "replies": [
                {
                    "author": "Alert_Special_7059",
                    "body": "LOL. Where do they do the search, in secondary? Any idea what made them search it in the first place?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-10 19:51:43",
                    "replies": [
                        {
                            "author": "A-to-fucking-Z",
                            "body": "In secondary. I got detained for 2nd inspection because they think i wouldn’t go back to my home country when they find out i’m staying for 3 months with my parents (with a valid return ticket) and having just 2 dollars in my pocket (told them I only use credit cards for most of my transactions). Told them the truth that i’m really just visiting and they let me go after 2 hours. They gave me 180 days to stay according to the passport stamp and of course I up and left after 3 months.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-12 03:56:37",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wild_Guard_5729",
            "body": "I’ve had an officer in front of me check my phone manually and as well I’ve been asked to put my phone, passport and visa into a bag.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-11 15:24:26",
            "replies": []
        },
        {
            "author": "mostlylegalalien",
            "body": "Most people aren’t that smart and probably have their job offers front and center in GMail.\n\nFOr some examples, watch the Australian Border Security on YT, people just leave their offer letters right on top of their suitcases to be discovered!",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-11 16:34:12",
            "replies": []
        },
        {
            "author": "Zealousideal-You6712",
            "body": "They would have many a happy hour searching through my digital footprint. The hundreds of gigabytes of data on the iPhone, iPad and MacBook, and the multiple hundreds of gigabytes of stuff they would find on my iCloud and GoogleDrive. They just won't be able to help themselves looking, I know.\n\nAs an old and disturbingly polite US citizen they can keep me for as long as they wan't. I'm retired and I'm in no hurry, I don't have anything better to do.\n\nThey'll have a field day with all my dirty bomb detonation and disaster recovery PhD research, thousands of papers and research materials. When they get to the pictures of my extensive gun collection, that will about do it for them, they'll be foaming at the mouth with anticipation.\n\nI think they'll likely be providing me with a bed and meals before they get too bored to continue. And that's without the thousands of deeply suspicious cat pictures and videos.\n\nI'm sure I'm probably on a government watch list for my views and comments about that nice Mr. Trump. /s",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-10 20:13:12",
            "replies": []
        },
        {
            "author": "ItaliaEyez",
            "body": "Nothing is ever truly deleted off your phone. They know how and where to look.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-10 19:07:28",
            "replies": []
        },
        {
            "author": "Ok_Excitement725",
            "body": "People give underpaid over worked federal government workers wayyyy too much credit. A \"search\" is a very generous term, they usually will take a device...do a basic keyword search of messages and to a lesser extent, emails, such as \"work\" or \"fraud\" or \"Israel\" or whatever it is they suspect the person may be hiding that could make them inadmissible...probably spend a couple of minutes and move on if nothing is immediately found to warrant more in depth investigation.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-10 21:09:21",
            "replies": []
        },
        {
            "author": "CumgPot_chickling",
            "body": "What if you use a flip phone and not a smart one ?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-11 23:07:39",
            "replies": []
        },
        {
            "author": "yogurt2020",
            "body": "Does this apply to domestic flights too?",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-04-11 16:34:54",
            "replies": [
                {
                    "author": "_brokenshadow",
                    "body": "No",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-11 23:36:17",
                    "replies": []
                }
            ]
        }
    ]
}