{
    "post_title": "WorldCon backs down on using AI after massive backlash.",
    "post_timestamp": "2025-05-09 15:37:43",
    "last_comment_timestamp": "2025-05-12 15:18:22",
    "time_difference": "2 days, 23:40:39",
    "comments": [
        {
            "author": "EmilyMalkieri",
            "body": "Bit out of context but what's up with that font in the headline? Especially in the embed image here on reddit. That just looks like the mocking Spongebob text. Perhaps not what you want your public announcements to remind people of.",
            "score": 13,
            "depth": 0,
            "timestamp": "2025-05-09 19:12:32",
            "replies": [
                {
                    "author": "Smooth-Review-2614",
                    "body": "That has been the official font of the con since Seattle won the bid. It’s a consistent design choice all over their website. They are going for a retro future vibe kind of like the Jetsons. ",
                    "score": 10,
                    "depth": 1,
                    "timestamp": "2025-05-10 17:26:43",
                    "replies": []
                },
                {
                    "author": "BooksInBrooks",
                    "body": "It's yet another way to confirm, \"we are neither serious nor competent people.\"\n\nAt this point, I have no confidence that \"Hugo Winner\" means \"good read\", and more than a little suspicion that it means \"avoid reading.\"",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-05-10 23:16:09",
                    "replies": []
                },
                {
                    "author": "iMooch",
                    "body": "Yeah the cutesy font is certainly an odd choice.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-05-10 02:12:08",
                    "replies": []
                }
            ]
        },
        {
            "author": "kern3three",
            "body": "Maybe I just need to read more about this latest controversy, but honestly a little sick of the WorldCon community needing to self flagellate itself. Isn't it just a bunch of people trying their best, volunteering their time? The level of hate within the own community is getting exhausting.",
            "score": 59,
            "depth": 0,
            "timestamp": "2025-05-09 17:13:31",
            "replies": [
                {
                    "author": "rattynewbie",
                    "body": "Sure, this is arguably less worse than the Chengdu WorldCon self-censoring award winners when chances are the government wouldn't have cared, but it is still shit considering how AI tech companies stealing the work of writers and artists is a pretty hot topic. You can't claim ignorance as a defense here.",
                    "score": 22,
                    "depth": 1,
                    "timestamp": "2025-05-09 20:50:36",
                    "replies": []
                },
                {
                    "author": "iMooch",
                    "body": "The way a community gets and stays good is by holding its members accountable. When someone in the community does something that harms the community, it's brought to their attention so they can rectify it.\n\nEven people who are trying their best can make mistakes and hurt people. It's not hate to hold them accountable.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-05-10 02:04:08",
                    "replies": [
                        {
                            "author": "thegroundbelowme",
                            "body": "How did this harm the community? Be specific.",
                            "score": 9,
                            "depth": 2,
                            "timestamp": "2025-05-10 12:11:01",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WaytoomanyUIDs",
                    "body": "Every other con apart from Chengdu managed to do this with volunteers without fucking up spectacularly. And it was the permanent staff that fucked up Chengdu",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-11 09:45:17",
                    "replies": [
                        {
                            "author": "Wheres_my_warg",
                            "body": "There is no permanent staff with Worldcon.  The closest it comes to that are members of the Marks Committee which tend to be pretty stable, but certainly aren't permanent.    \n\nAnd as he himself has stated, the fuck ups for the Hugos at Chengdu lie with one specific person, Dave McCarty.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-05-11 23:19:38",
                            "replies": [
                                {
                                    "author": "WaytoomanyUIDs",
                                    "body": "And he was on that committee.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-12 05:54:03",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "UpbeatEquipment8832",
                            "body": "There's never been a WorldCon without drama.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-05-12 12:45:07",
                            "replies": [
                                {
                                    "author": "WaytoomanyUIDs",
                                    "body": "True",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-12 15:18:22",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HandsomeRuss",
                    "body": "Yep. The outrage here is fucking stupid. Crybabies crying over things that volunteers are trying to accomplish which ultimately don't matter. WolrdCon sucks and the Hugo is a worthless award nowadays.",
                    "score": -17,
                    "depth": 1,
                    "timestamp": "2025-05-09 21:03:00",
                    "replies": []
                }
            ]
        },
        {
            "author": "iMooch",
            "body": "**tl;dr They're going to redo the panel vetting process without using ChatGPT, have released the exact prompt they used in the first place, and have promised not to use ai again.**\n\nIt's a decent first step, but the tone of the article is still very defensive, very \"no you don't understand, it was only a very minor use of the plagiarism machine,\" and there's still a lack of transparency with regards to who actually used and approved the use of ChatGPT. The Program Division Head has taken responsibility, but it's clear they're covering for other people.\n\nAdditionally, there have been no resignations thus far.\n\nThey said they'll update with further information about their path going forward next week.",
            "score": 47,
            "depth": 0,
            "timestamp": "2025-05-09 15:43:15",
            "replies": [
                {
                    "author": "dgeiser13",
                    "body": "I believe 3 people resigned.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2025-05-09 18:08:05",
                    "replies": [
                        {
                            "author": "NoPhone4571",
                            "body": "The three people that resigned did so in protest of the fact that ChatGPT was used. They had nothing to do with its use.",
                            "score": 28,
                            "depth": 2,
                            "timestamp": "2025-05-09 20:05:15",
                            "replies": [
                                {
                                    "author": "dgeiser13",
                                    "body": "Correct.  They are part of the Hugo Awards at World Con and resigned in protest.  Most likely because the people who should resign, did not.  I think it's disingenuous to say that no one has resigned.  Because people have.",
                                    "score": 11,
                                    "depth": 3,
                                    "timestamp": "2025-05-09 21:12:25",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "iMooch",
                            "body": "Not any of the responsible parties. The people who resigned were innocent and did so in protest.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2025-05-10 02:10:36",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "overzealous_dentist",
                    "body": "It's wild that people are still claiming using AI is plagiarism, especially for something purely administrative like this (googling people and flagging anything sus). Every other field is adopting AI for  (with obvious fact-checking), this one should too. It saves a lot of Googling.",
                    "score": -53,
                    "depth": 1,
                    "timestamp": "2025-05-09 15:59:39",
                    "replies": [
                        {
                            "author": "SherbertFinal5581",
                            "body": "Even if it is not plagiarism, it is a) absolutely flawed and inaccurate, try any single ai search engine. And since it's functioning as a black box, without any hint of ability to retrace its inner workings, it lacks the accountability which a person doing the job would provide . \n\nB) It's unethical to waste the ridiculous amount of resources ai requires just to take away a person's job. There is zero upsides to this, we are not living in some utopia where the person who would do the fact checking would dedicate themselves to some more meaningful and creative endeavour without repercussions. In this real world the use of Ai cuts down on  some freelancer's wages, replacing it with a technology which is flawed, wasteful and commodifies and monopolizes knowledge in the hands of companies whose track record can be euphemistically described as suspect.",
                            "score": 32,
                            "depth": 2,
                            "timestamp": "2025-05-09 16:12:21",
                            "replies": [
                                {
                                    "author": "FeydSeswatha982",
                                    "body": "> Even if it is not plagiarism, it is a) absolutely flawed and inaccurate, try any single ai search engine.\n\nAI is revolutionizing the world, whether we like it or not, and nitpicking about it not being perfect is a waste of time. It's getting better and better whether we like it or not. Nothing is flaw-proof.\n\n> B) It's unethical to waste the ridiculous amount of resources ai requires just to take away a person's job.\n\nWhose jobs are being eliminated? It's an administrative, time-saving method, not the advent of Skynet.\n\n> There is zero upsides to this, we are not living in some utopia where the person who would do the fact checking would dedicate themselves to some more meaningful and creative endeavour without repercussions. In this real world the use of Ai cuts down on  some freelancer's wages, replacing it with a technology which is flawed, wasteful and commodifies and monopolizes knowledge in the hands of companies whose track record can be euphemistically described as suspect.\n\nSo should we revert back to a pre-industrial, agrarian society? Get rid of assembly line machinery/PCs/(insert modern-day technology), since they can do the work of many people?",
                                    "score": -25,
                                    "depth": 3,
                                    "timestamp": "2025-05-09 16:57:42",
                                    "replies": [
                                        {
                                            "author": "NoPhone4571",
                                            "body": "There was mention in the comments of one applicant being flagged because the scrape mistook him for a rapist in Eastern Europe.",
                                            "score": 6,
                                            "depth": 4,
                                            "timestamp": "2025-05-09 20:06:48",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "[deleted]",
                                                    "score": 8,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-10 15:28:10",
                                                    "replies": [
                                                        {
                                                            "author": "NoPhone4571",
                                                            "body": "Thank you. I wasn’t sure about the specifics.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2025-05-10 15:28:50",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "thegroundbelowme",
                                                    "body": "And did the humans who were reviewing the actual links it provided catch that?",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-10 12:09:28",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Zestyclose_Wrangler9",
                                            "body": "> AI is revolutionizing the world\n\nAt the cost of exponential water and energy usage which both have better applications.",
                                            "score": 11,
                                            "depth": 4,
                                            "timestamp": "2025-05-09 17:14:12",
                                            "replies": [
                                                {
                                                    "author": "FeydSeswatha982",
                                                    "body": "AI is in its infancy. One can imagine that will change with time, just like the resources needed for computing power. But this can be said of computers in general. \n\nEdit: grammar",
                                                    "score": -17,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-09 17:19:56",
                                                    "replies": [
                                                        {
                                                            "author": "CritterThatIs",
                                                            "body": "> AI is in its infancy.\n\nIt's not.",
                                                            "score": 5,
                                                            "depth": 6,
                                                            "timestamp": "2025-05-09 17:45:46",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Zestyclose_Wrangler9",
                                                            "body": "> AI is in its infancy.\n\nThings in their infancy should not be displacing this level of energy and water costs.  If its in its infancy, then it should use infantile amounts of water and power, it doesn't, so it's objectively a waste of those resources that could be better used.",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2025-05-09 18:30:06",
                                                            "replies": [
                                                                {
                                                                    "author": "FeydSeswatha982",
                                                                    "body": "For most technologies, resource utilization almost always starts out grossly inefficient and steadily improves. Just look at automobiles.\n\nAnd there's no possible way the world will decide AI just isn't worth it/inefficient. We're on an irreversible path now.",
                                                                    "score": -11,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-05-09 18:35:31",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Zestyclose_Wrangler9",
                                                                            "body": "> Just look at automobiles.\n\nBad comparison, we are better able to know the negative environmental impacts now by compared to the late 1800s and early 1900s when cars were introduced. \n\n> resource utilization almost always starts out grossly inefficient and steadily improves\n\nI'm not talking about efficient use of resources, I'm talking about total usage, but nice try moving the goal posts.\n\n> And there's no possible way the world will decide AI just isn't worth it/inefficient.\n\nWhen your fresh water source is hijacked or contaminated to cool a data centre, I'm sure you'll think that's super efficient.  Or when your job/industry is devastated and you're out of a job, again, super efficient!\n\nYou're fully ignoring the human and environmental costs of our current mode of use of AI.",
                                                                            "score": 3,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-05-09 18:43:28",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "FeydSeswatha982",
                                                                                    "body": "> Bad comparison, we are better able to know the negative environmental impacts now by compared to the late 1800s and early 1900s when cars were introduced. \n\nHindsight is 20/20 with all technology \n\n> When your fresh water source is hijacked or contaminated to cool a data centre, I'm sure you'll think that's super efficient.  Or when your job/industry is devastated and you're out of a job, again, super efficient!\n\nOkay, John Connor.\n\n> You're fully ignoring the human and environmental costs of our current mode of use of AI.\n\nCurrent mode of use of AI? Explain, with examples of the catastrophic effects laying waste to the planet.\nEdit: and provide sources.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-05-09 19:10:01",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Zephyr256k",
                                                                                            "body": "> Explain, with examples of the catastrophic effects laying waste to the planet.\n\nhttps://www.politico.com/news/2025/05/06/elon-musk-xai-memphis-gas-turbines-air-pollution-permits-00317582",
                                                                                            "score": 3,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2025-05-10 11:15:19",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "NoPhone4571",
                                                                                                    "body": "I came here with this exact same link to post. Funny how the “AI is the future suck it up” guy hasn’t responded to proof of actual harm.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2025-05-10 13:56:39",
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "Zestyclose_Wrangler9",
                                                                                            "body": "You first buddy.",
                                                                                            "score": 0,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2025-05-09 19:34:43",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Mejiro84",
                                                                            "body": ">And there's no possible way the world will decide AI just isn't worth it/inefficient. We're on an irreversible path now.\n\nPeople are very literally already deciding that, by not using it. Like turning it off in products that try and use it, because it's kinda junky and doesn't really do much that's useful. Or by skipping past googles AI search results, because they're often wrong and not useful. We can _always_ stop using things - I know a lot of weirdo tech bros are deeply invested in it, both financially and mentally, but it's no more 'inevitable' than the metaverse or any other tech hype",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-05-12 04:09:21",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "FeydSeswatha982",
                                                                                    "body": "People can also chose not to ride in automobiles, own cell phones, or use the internet. Everything I've read and seen firsthand at work indicates it is indeed inevitable because of its applicablity across many domains. Acknowledging this doesn't mean I like it; I don't (because of its ability to gut creativity). I am a speculative fiction writer. I'm just not going to pretend it's not a reality we'll have to live with because of my biases.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-05-12 08:43:24",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Zestyclose_Wrangler9",
                            "body": "> It saves a lot of Googling.\n\nIf a human still has to vet the answers the LLM gives then while it may save some Googling, it doesn't save time or energy costs.",
                            "score": 16,
                            "depth": 2,
                            "timestamp": "2025-05-09 16:45:03",
                            "replies": []
                        },
                        {
                            "author": "Frari",
                            "body": ">  Every other field is adopting AI for (with obvious fact-checking), this one should too. It saves a lot of Googling.\n\nworldcon has a lot of authors attend (or people that want to be authors), they are shitting bricks over AI taking all their jobs.  So in that case I can understand their response.  But I still think most of this is an overreaction.",
                            "score": -5,
                            "depth": 2,
                            "timestamp": "2025-05-09 18:37:04",
                            "replies": [
                                {
                                    "author": "LoopEverything",
                                    "body": "Yeah am I missing something? Given the reaction, I assumed it would be something horrible, but it’s just… aggregating links?",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-05-09 19:41:01",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FaceDeer",
                    "body": "Calling it a \"plagiarism machine\" shows that you *don't* understand.\n\nEdit: /u/iMooch blocked me so I can't respond to /u/currough directly, thanks to Reddit's brain-dead implimentation of blocking. But I would suggest that currough doesn't understand what \"plagiarism\" means, in that case.",
                    "score": -42,
                    "depth": 1,
                    "timestamp": "2025-05-09 15:55:00",
                    "replies": [
                        {
                            "author": "currough",
                            "body": "I have a PhD in machine learning and I think \"plagiarism machine\" is entirely accurate.",
                            "score": 34,
                            "depth": 2,
                            "timestamp": "2025-05-09 16:15:23",
                            "replies": [
                                {
                                    "author": "SetentaeBolg",
                                    "body": "I have a PhD in machine learning and I think \"plagiarism machine\" is entirely inaccurate.",
                                    "score": -16,
                                    "depth": 3,
                                    "timestamp": "2025-05-09 16:24:28",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "looktowindward",
            "body": "Haven't we had enough of this clown show by now? Its one scandal and rash of resignation after another.",
            "score": 13,
            "depth": 0,
            "timestamp": "2025-05-09 18:58:34",
            "replies": []
        },
        {
            "author": "Amphibologist",
            "body": "Well this was sure a tempest in a teapot. I mean, it was a boneheaded move using (or at least announcing) AI to a group with justifiable grievances about training models with copyrighted works. They could have predicted how triggering that would be. That being said, the way they used the tool is _precisely_ what AI is good at, and should be used for. Taking huge list of data and sorting and classifying for human review. There are a lot of shrieking hot takes that are all emotion, but factually …challenged. \n\nLike I said though: boneheaded move on the part of the committee.\n\nEDIT: typo",
            "score": 32,
            "depth": 0,
            "timestamp": "2025-05-09 17:59:27",
            "replies": [
                {
                    "author": "iMooch",
                    "body": ">That being said, the way they used the tool is precisely what AI is good at, and should be used for.\n\nI don't think asking the racist plagiarism machine whether human beings are problematic to decide whether to invite them to your prestigious convention that could make or break their career \"should\" be done, to be perfectly honest.",
                    "score": -10,
                    "depth": 1,
                    "timestamp": "2025-05-10 02:15:16",
                    "replies": [
                        {
                            "author": "Amphibologist",
                            "body": "Thank you for helping make my point.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-05-10 10:33:14",
                            "replies": []
                        },
                        {
                            "author": "MrJohz",
                            "body": "The \"racist plagiarism machine\" did not decide anything, though.  It made a recommendation, but it had to justify that recommendation with sources, and a human then evaluated the sources themselves to determine whether that recommendation made sense.\n\nEssentially, it is the rough equivalent of asking an intern to do a Google search for someone's name and \"scandal\", and then evaluate the results and find anything that seems important.  They'll do the more time-consuming work of finding and collating the data, and then you can make the more important decision based on that data.  And importantly: you have the original sources to look up, so you can determine yourself whether any particular claim is factual or just a hallucination.\n\nTo quote the previous comment, this is exactly that sort of \"shrieking hot take\" that is addressing completely the wrong issue.  It's one thing to criticise the use of tools built by companies that have no respect for IP or authorship; or to be concerned about low-skill, entry-level jobs being the most likely to be replaced by these tools.  Those would be useful criticisms of what's going on.  But talking about these LLMs making their own decisions is simply incorrect.",
                            "score": 12,
                            "depth": 2,
                            "timestamp": "2025-05-10 05:06:53",
                            "replies": []
                        },
                        {
                            "author": "gaue_phat",
                            "body": "> racist plagiarism machine \n\ni get why it's a plagiarism machine. Don't understand the racist bit",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-05-10 08:56:47",
                            "replies": [
                                {
                                    "author": "Smooth-Review-2614",
                                    "body": "It’s the garbage in garbage out problem. It’s the same issue as why face recognition still has problems with Black people. The training data did not have enough Black faces to properly train on. \nIt’s why the early hiring algorithms had strong bias problems because the same size was small. You tell a machine that these 100 people are good software developers and most happen to be of the same race, gender, and from 4 college then the software assumes you want more of the same. ",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 17:31:39",
                                    "replies": []
                                },
                                {
                                    "author": "Zephyr256k",
                                    "body": "LLMs are very good at inheriting biases from training data which is often racially biased.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 14:13:23",
                                    "replies": []
                                },
                                {
                                    "author": "Mejiro84",
                                    "body": "It's based off, broadly speaking, 'the internet'. Which has a general tendency to be white, middle-class, and at least mildly racist. This is more obvious on the art ones, where something like 'asian woman' will come out kinda porn-y, because that's what most images marked on the internet as 'asian woman' are",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-12 04:12:07",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WaytoomanyUIDs",
                    "body": "LLMs are terrible at that because thry hallucinate. The sort of AI's you are thinking of, used in science and medical research use a variety of models like Deep Learning but none of them make shit up",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-05-11 19:52:59",
                    "replies": [
                        {
                            "author": "Amphibologist",
                            "body": "I work in the field.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-11 21:15:10",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WaytoomanyUIDs",
            "body": "Jeez took them long enough",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-11 09:41:57",
            "replies": []
        },
        {
            "author": "fjiqrj239",
            "body": "What got me about the whole setup was that they don't appear to understand how to vet applications in general. \n\nYou don't do background checks on 1300 applications. You get yourself a short list of applications that look good, that's maybe two or three time the size of the number of panellists you need. Then you do a google search / social media check of the finalists, weed out the racists, misogynists, trolls and actual Nazis, and then contact people.",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-05-10 21:58:48",
            "replies": []
        },
        {
            "author": "ddttox",
            "body": "A science fiction con doesn’t want to use AI. That’s ironic.",
            "score": -3,
            "depth": 0,
            "timestamp": "2025-05-09 22:10:06",
            "replies": [
                {
                    "author": "iMooch",
                    "body": "ChatGPT et al are not \"AI\" in the sci-fi sense and unquestioned adoption of a harmful technology just because it's new and shiny is, in fact, something SF has actively warned about for centuries.",
                    "score": 21,
                    "depth": 1,
                    "timestamp": "2025-05-10 02:16:32",
                    "replies": []
                },
                {
                    "author": "gaue_phat",
                    "body": "LLMs aren't AI and it would be very useful if people stopped referring to them as such",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2025-05-10 08:57:07",
                    "replies": [
                        {
                            "author": "account312",
                            "body": "They quite unequivocally are. Maybe you're thinking of AGI. Since there's no AGI, that's necessarily a rather tiny part of the field.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-05-10 14:56:59",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cliffy73",
                    "body": "No it isn’t.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-05-10 00:31:22",
                    "replies": []
                },
                {
                    "author": "mladjiraf",
                    "body": "I agree, I bet it will become ubiquitous, if technology improves a little bit more, so only fools wouldn't use tools that make life easier, and will get accepted then",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-10 02:25:16",
                    "replies": []
                }
            ]
        },
        {
            "author": "desantoos",
            "body": "Writers try to create this pretense of being intelligent and progressive and compassionate but this latest episode shows that, really, the only thing that unites writers is a penchant for drama. So many writers trying to cause as much chaos as possible. Every thing people do, even volunteers who are probably not the brightest, is the worst thing ever. Every person needs to be fired, every apology is insufficient, and how dare anyone do anything with current technology to streamline the process.\n\nNot that the organizers did a particularly great job using AI when most writers are flipping out on socials about AI. It might've been better to suggest publicly that one was going to try that with the subtext that these people are stretched thin and if you don't want AI you maybe should pitch in.\n\nI don't even really get the whole panel vetting process in the first place. Maybe it's because I'm a chemist and see how The American Chemical Society, for example, does conventions with no drama. When you register for WorldCon, check a box to answer the question \"Which is your favorite genre?\" and then have subcommittees form with those genres. Let them be loose, make it clear that they are arbitrary, only there to have subcommittees do the organizing. Use the head count to apportion out rooms and find people to lead the discussion of each event in each room. See how you don't need ChatGPT to do any of this? The people in charge of the subcommittee pick the heads of each panel who then pick all of the people on the panel, some database makes sure nobody picks the same person twice if that's not a good thing (which I would think it's fine but whatever). This process is simple and what everybody else does and so it is so weird that authors are so awful at all of this.",
            "score": -15,
            "depth": 0,
            "timestamp": "2025-05-09 16:13:26",
            "replies": [
                {
                    "author": "iMooch",
                    "body": "Writing is not similar to chemistry.\n\nAI is being used by publishers to replace human artists and writers, both groups of whom already generally do not make enough money to support themselves, and rely on day jobs, and the support of family members.\n\nIf you value human creativity, and wish to continue to enjoy art made by humans into the future, you should oppose the use of AI in creative fields.\n\nIf you don't value that, I suppose continue as you are.",
                    "score": 34,
                    "depth": 1,
                    "timestamp": "2025-05-09 16:25:01",
                    "replies": [
                        {
                            "author": "Sparky_Z",
                            "body": "Why is it not possible to draw a distinction between using AI to do the creative work itself (i.e., using the output of the LLM in the finished product) vs. using it as a tool for ancillary tasks (like for research assistance, as a brainstorming soundboard, or automating annoying mechanical computer tasks that have just enough variation to not be straightforwardly scriptable by a non-expert).\n\nThe one major time I used ChatGPT was to help with OCRing a bad scan of an old computer printout of 37 pages of machine code in an octal number format. It turned what would have been days of terrible, manual work, deciphering, typing, and verifying a long list of fuzzy numbers into something that took about an hour to check and verify. It was a pretty specific use case, but it was an incredibly valuable tool in that instance.\n\nThe way it was used here seems have been basically of the latter variety, but people are getting upset as it it were the former.",
                            "score": 16,
                            "depth": 2,
                            "timestamp": "2025-05-09 17:27:44",
                            "replies": [
                                {
                                    "author": "Zestyclose_Wrangler9",
                                    "body": "a) because of the outsized water and energy costs to support AI nonsense.\n\nb) because of how the AI systems were trained.\n\nc) it's stealing work that could be done by a paid living person.\n\nPick whichever you like, using AI cannot be discussed in a vacuum, it's similar to discussing fossil fuel benefits without their environmental impact.",
                                    "score": -3,
                                    "depth": 3,
                                    "timestamp": "2025-05-09 18:34:37",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "[deleted]",
                                            "score": 10,
                                            "depth": 4,
                                            "timestamp": "2025-05-10 00:49:05",
                                            "replies": [
                                                {
                                                    "author": "iMooch",
                                                    "body": ">If you believe training ML models on data available on the internet is stealing sure.\n\nLegally, \"available on the internet\" doesn't mean copyright-free. If you don't believe me, I invite you to go to Disney's website, download an image of Mickey Mouse and use it commercially to sell your own product. See what happens.\n\nThere's also the ethical concern that this scraping was done without knowledge or consent, and many people who've found out about it do not want their original work used in this manner.\n\nIt is unarguably cruel to scrape someone's data against their explicit wishes. Human beings aren't a natural resource to be exploited by whoever can manage to do so. The pro-ai mindset is utterly dehumanizing, cruel and inhumane.",
                                                    "score": 4,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-10 02:24:19",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Amphibologist",
                                    "body": "Careful. You’re being too rational here. Bring on the downvotes!",
                                    "score": -8,
                                    "depth": 3,
                                    "timestamp": "2025-05-09 18:07:35",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Deep-Sentence9893",
                            "body": "But this has nothing to do with replacing writers with AI.",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2025-05-09 16:36:44",
                            "replies": [
                                {
                                    "author": "WateredDown",
                                    "body": "It is using a program trained on data actively stolen from writers, probably most of the very ones it was vetting.",
                                    "score": 14,
                                    "depth": 3,
                                    "timestamp": "2025-05-09 16:44:53",
                                    "replies": [
                                        {
                                            "author": "thegroundbelowme",
                                            "body": "But it's not doing any writing. It's literally just aggregating links.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-10 12:14:01",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DanteInferior",
                                    "body": "It pisses me off that my work has been fed into LLMs to help make their owners billions of dollars. I didn't consent to that.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2025-05-09 18:18:33",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "FeydSeswatha982",
                            "body": "> AI is being used by publishers to replace human artists and writers\n\nDo you have a source for this claim?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-10 10:41:02",
                            "replies": [
                                {
                                    "author": "Zephyr256k",
                                    "body": "https://www.forbes.com/sites/jackkelly/2025/05/04/its-time-to-get-concerned-klarna-ups-duolingo-cisco-and-many-other-companies-are-replacing-workers-with-ai/\n\nhttps://futurism.com/large-publisher-layoffs-openai\n\nhttps://futurism.com/quartz-fires-writers-ai-slop",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 14:04:00",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Zestyclose_Wrangler9",
                    "body": "I think you're really belittling the authors here and using a lot of generalizations which leads me to think this isn't a very well thought out take, and more that you're shooting from the hip (because otherwise you'd list actual names, posts, etc). \n\niMooch above me does a better job of explaining the creativity aspect of this and the message it sends in a creative industry when they use AI tools. As well as the comparison between a technical field vs a creative field, because in a technical field such as chemistry, there's a lot of vetting that happens behind the scenes both officially and unofficially that lead up to these conferences. It's a different system, and as such, it gets different results as you've discussed.",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2025-05-09 16:43:46",
                    "replies": []
                },
                {
                    "author": "Cliffy73",
                    "body": "Or they could just do it right, and if they’re not prepared to do it right, don’t volunteer.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-05-10 00:33:55",
                    "replies": []
                }
            ]
        },
        {
            "author": "Hoyarugby",
            "body": "absolutely embarrassing by the community. Far more of an outrage about using AI to check social media profiles for slurs than the Chengdu con having its nominees approved by the Party, and getting a bunch of Chinese diaspora authors disqualified as a result\n\nI would say that this org needs to be put to bed, but anything that would replace it would see the same bullshit\n\neverybody wants to be the main character of some great story and on a stage as small as this one, they are trying to be",
            "score": -16,
            "depth": 0,
            "timestamp": "2025-05-09 16:28:19",
            "replies": [
                {
                    "author": "iMooch",
                    "body": ">Far more of an outrage about using AI to check social media profiles for slurs than the Chengdu con having its nominees approved by the Party, and getting a bunch of Chinese diaspora authors disqualified as a result\n\nThere was *massive* backlash for months on end over the political censorship in Chengdu. Literally one of the biggest things people are saying about this ai controversy is \"how can they do this after Chengdu? Can't they not screw up for **one** year?\"\n\nBut even if there wasn't, \"because people weren't outraged about X, they cannot or should not be outraged by Y\" is not a logically sound argument.",
                    "score": 39,
                    "depth": 1,
                    "timestamp": "2025-05-09 16:34:55",
                    "replies": [
                        {
                            "author": "Hoyarugby",
                            "body": "there was a fraction of outrage about *authors literally getting blacklisted* compared to this!",
                            "score": -2,
                            "depth": 2,
                            "timestamp": "2025-05-09 21:47:34",
                            "replies": [
                                {
                                    "author": "iMooch",
                                    "body": "That's simply untrue.",
                                    "score": 6,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 02:11:29",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Zephyr256k",
                    "body": "Dude, WTF are you even talking about?  \nYou don't even know what actually happened at Chengdu and the outrage for Chengdu was so massive it made mainstream international news multiple times.  \nThis is nothing compared to that, barely above the background noise for fandom drama.",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2025-05-09 23:39:48",
                    "replies": []
                },
                {
                    "author": "WaytoomanyUIDs",
                    "body": "Did you just ignore the MASSIVE  international outrage about the Chengdu ballsup?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-11 19:57:05",
                    "replies": []
                }
            ]
        },
        {
            "author": "rushmc1",
            "body": "Cowards.",
            "score": -16,
            "depth": 0,
            "timestamp": "2025-05-09 15:53:53",
            "replies": []
        },
        {
            "author": "Bruncvik",
            "body": "A bit late to react, but I think the idea of using a LLM was a good one.  There's a lot of garbage on social media, and sorting through the noise may be too difficult for normal people.  I personally am aware of one former panelist who had been spewing anti-trans tirades on Twitter, and another who engaged in power fantasies about murdering people who refused to have sex with them.  And I am not even on social media, other than Reddit, so imagine how much more problematic content there may be.  Using a LLM for the first pass, to flag panel applicants for further human review, seems like a great use of the technology.",
            "score": -4,
            "depth": 0,
            "timestamp": "2025-05-10 06:11:55",
            "replies": []
        },
        {
            "author": "bluecat2001",
            "body": "Vetting is checking social media for unwanted posts in this context. As in supporting Uighur, Taiwan or Palestine.\n\nIt is wrong whether humans or AI does it. \n\nUsing AI is extra wrong because it automatizes and dehumanizes discrimination.",
            "score": -21,
            "depth": 0,
            "timestamp": "2025-05-09 16:31:05",
            "replies": [
                {
                    "author": "iMooch",
                    "body": "WorldCon is a private organization that has absolutely no legal or moral obligation to host people the event organizers find morally repugnant.\n\nAnd the prompt they provided didn't reference any of those things, it was looking for bigotry (racism, sexism, etc.)",
                    "score": 16,
                    "depth": 1,
                    "timestamp": "2025-05-09 16:36:20",
                    "replies": []
                }
            ]
        }
    ]
}