{
    "post_title": "Once jobs are automated, what will be the point of immigration?",
    "post_timestamp": "2024-03-16 16:50:49",
    "last_comment_timestamp": "2024-04-24 18:09:10",
    "time_difference": "39 days, 1:18:21",
    "comments": [
        {
            "author": "not_a_moogle",
            "body": "War, famine, dictators.\n\nImmigration is not typically looking for just work.",
            "score": 505,
            "depth": 0,
            "timestamp": "2024-03-16 17:03:17",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Don’t forget environmental. I’ve read that much of the Germanic tribes moving south towards Rome did so because of increasing cold northern climate… plus the Huns",
                    "score": 142,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:43:55",
                    "replies": [
                        {
                            "author": "WobbleKing",
                            "body": "This time it will be north",
                            "score": 28,
                            "depth": 2,
                            "timestamp": "2024-03-16 20:18:02",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "It already is essentially",
                                    "score": 18,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 21:07:21",
                                    "replies": [
                                        {
                                            "author": "FrogsArchers",
                                            "body": "Canadian here.. Can confirm. \n\nThe GTA looks like New Delhi",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2024-03-18 15:20:54",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "Meanwhile I’m here figuring where the fuck to move to get away from this mass migration lmao",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-18 15:28:04",
                                                    "replies": [
                                                        {
                                                            "author": "FrogsArchers",
                                                            "body": "You and me both. \n\nBasically we need to create another beautiful country (maybe further North?) and make sure we don't invite the entire 3rd world in.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-18 17:59:20",
                                                            "replies": [
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "Part of me thinks Peter Thiel has the right idea building islands [islands](https://amp.theguardian.com/environment/2020/jun/24/seasteading-a-vanity-project-for-the-rich-or-the-future-of-humanity)",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-03-18 18:24:46",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Bigjoemonger",
                                    "body": "No this time it will be away from sea level.\n\nAbout a third of the world's population lives at sea level.  Within the next 100 years, sea levels are expected to rise at least 3 to 5 feet. That's enough to put entire cities permanently under water. Some major cities will be able to control that rise with levees, pumps and sea walls. But all of the coastal towns will not. Especially in the less developed nations. \n\nIn our life times we will likely see millions of people leaving their homes due to rising sea levels to try to find a better place to live. Some may be able to just move further inland but many will likely have to make more drastic changes.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-03-17 11:09:43",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Shieldheart-",
                            "body": "You're correct, there was a mini ice age at that time that caused mass harvest failure, giving the tribes there a binary choice whether to move or starve.\nAlso the Huns, lets not understate the Huns.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 16:51:34",
                            "replies": []
                        },
                        {
                            "author": "dobrits",
                            "body": "> plus the huns.\n\nWho also probably had to migrate due to climate change. (The winters in the steppe were unbearable)",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 19:16:49",
                            "replies": []
                        },
                        {
                            "author": "NecessaryCelery2",
                            "body": "And the Huns might have migrated west because of drought in Central Asia.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-18 01:09:21",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Anen-o-me",
                    "body": "Better law choice.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2024-03-16 23:53:03",
                    "replies": []
                },
                {
                    "author": "Stimbes",
                    "body": "Crime and to move to better weather/scenery.",
                    "score": 26,
                    "depth": 1,
                    "timestamp": "2024-03-16 18:25:44",
                    "replies": [
                        {
                            "author": "outwest88",
                            "body": "Yeah seriously. This is the only reason I’m considering emigrating. Crime and weather. Also culture and food.",
                            "score": 10,
                            "depth": 2,
                            "timestamp": "2024-03-17 00:25:31",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "anonareyouokay",
                    "body": "Climate change",
                    "score": 36,
                    "depth": 1,
                    "timestamp": "2024-03-16 18:12:57",
                    "replies": []
                },
                {
                    "author": "Thecrazier",
                    "body": "Yea on the immigrants side that's irrelevant because their country might not be advance enough so they still want to migrate to a country with automation and universal income. Makes sense we would want to keep them out",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-03-17 04:56:10",
                    "replies": []
                },
                {
                    "author": "Awkward_moments",
                    "body": "It more to keep house prices high, GDP going up (not GDP per capita) and to keep wages low. \n\n\nIf the government actually wanted certain types of workers they would pay for it or make business pay for it.  \n\n\nBusinesses always look for employees with 5 or 10 years experience so they can get in cheap labour below market rate. They never look for 0 years experience to train them up or pay enough to convince people into that industry.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-17 16:53:43",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "No chance a struggling society is going to let a bunch of immigrants in.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-17 01:09:35",
                    "replies": []
                },
                {
                    "author": "Mediocre-Ebb9862",
                    "body": "Plenty of people looking for better economic opportunities too. This is also what H1b, EB1-3 visas, O-1 etc are for in US. Various programs in other countries.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-03-16 19:07:20",
                    "replies": [
                        {
                            "author": "not_a_moogle",
                            "body": "The point is OP seems dumb posting why would immigrants come here if all the jobs are automated. \n\nAs if that's the only reason we have immigrants...",
                            "score": 9,
                            "depth": 2,
                            "timestamp": "2024-03-16 19:10:44",
                            "replies": [
                                {
                                    "author": "castlebravo15megaton",
                                    "body": "No he is asking why would a country want immigrants if they aren’t needed because those jobs are automated.",
                                    "score": 14,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 19:30:14",
                                    "replies": [
                                        {
                                            "author": "not_a_moogle",
                                            "body": "Well if jobs are automated, whats the point of countries.  Might as well establish a planetary government.",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 19:46:21",
                                            "replies": [
                                                {
                                                    "author": "castlebravo15megaton",
                                                    "body": "To protect and look out for its citizens, the same reason they exist today?",
                                                    "score": 5,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-16 20:59:40",
                                                    "replies": [
                                                        {
                                                            "author": "not_a_moogle",
                                                            "body": "I really don't think my government is looking out for me or protecting",
                                                            "score": 5,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-16 21:17:34",
                                                            "replies": [
                                                                {
                                                                    "author": "AMightyDwarf",
                                                                    "body": "Maybe you should try your luck in Afghanistan or Sudan or Somalia. I’m sure you’ll appreciate the safety that living in the west has brought you once you’ve been somewhere where it’s actually dangerous.",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-03-17 02:32:14",
                                                                    "replies": [
                                                                        {
                                                                            "author": "not_a_moogle",
                                                                            "body": "I don't thinkntheybare actively trying to hurt me, I just think they don't care about. I'm just a cog in the machine.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-03-17 10:49:45",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "FeloniousReverend",
                                                            "body": "Why couldn't a planetary government do that? This isn't really a response to their comment.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-16 23:20:11",
                                                            "replies": [
                                                                {
                                                                    "author": "AMightyDwarf",
                                                                    "body": "We don’t have planetary unity yet for one. How do you propose we get all the different African dictators on board? Colonise them?",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-03-17 02:35:20",
                                                                    "replies": [
                                                                        {
                                                                            "author": "FeloniousReverend",
                                                                            "body": "We also don't have widespread automation of jobs, the idea here being things will have changed a bit and what would change with it. Also maybe it's just me, but other than not being clear on how you're trying to use the word colonize in this context, they could probably be bought off.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-03-17 16:05:53",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "OP is asking what's the point of accepting immigrants not immigrating.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-17 02:16:12",
                    "replies": []
                },
                {
                    "author": "Odd_Photograph_7591",
                    "body": "I think migration will be in reverse, the countries that have the best weather will be the ones more sought after and this will be Mexico, Central America, Colombia, Bolivia, Peru, Brazil, these countries will probably start to put limitations in foreign migration, Mexico has already started this process, obtaining a digital nomad visa, only required earning $2,000 per month, they recently increased it to $4,000 dollars per month, some expect this tendency to continue",
                    "score": -2,
                    "depth": 1,
                    "timestamp": "2024-03-16 19:20:49",
                    "replies": [
                        {
                            "author": "alohadave",
                            "body": "With global warming, people are going to move out of the tropics and subtropics.  North to Canada and south to Argentina.",
                            "score": 8,
                            "depth": 2,
                            "timestamp": "2024-03-16 20:10:47",
                            "replies": []
                        },
                        {
                            "author": "DirtyDan419",
                            "body": "Wouldn't global warming and rising sea levels fuck a lot of these destinations up?",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-03-16 21:33:40",
                            "replies": [
                                {
                                    "author": "markth_wi",
                                    "body": "Some parts of the world are more fucked than others, Amsterdam , the low countries, the Adriatic coast of Italy, The Eastern coast of the United States and China, displacing directly something like 100-150million folks in the US and 250,000,000 people in those two countries alone, While other countries like France will experience limited loss of coastline but an elimination of mountain glaciers, Pakistan, India, Chile, Peru, France Italy, Germany, and a host of other countries will no doubt suffer similarly as a result of waterfall changes / drought and such. \n\nClimate change is problematic but not insoluble , things like AI or weaponized AI, or advanced general intelligence or worse rapid development of advanced superintelligence in a way that does not foster responsible use means where we just have no sense of how to even gauge risk as relates to what's being invented - it's like wondering how craft-farmers will fare when the combination of cotton-gin/combine/nuclear-powered/fertilizer/flying robot-farmer comes along.\n\nThere are still craft farmers but what that looks like is pretty radically different and the smart money would be to be the farmer that employs the flying robot farmer-combine.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 22:23:38",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MrBeforeMyTime",
                    "body": "Better mate selection is also a reason people immigrate.",
                    "score": -5,
                    "depth": 1,
                    "timestamp": "2024-03-16 18:16:43",
                    "replies": []
                },
                {
                    "author": "yepsayorte",
                    "body": "No, most people come for the work/money. It's always been for work. Elites use \"asylum\" as a way of washing the fact that their goal is to drive down their labor costs (read: make you poor).",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-03-17 04:11:09",
                    "replies": []
                },
                {
                    "author": "Diatomack",
                    "body": "Only a fraction of the population ever leave. It hardly makes a dent. The majority are stuck there forevermore",
                    "score": -12,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:09:05",
                    "replies": [
                        {
                            "author": "oneeyedziggy",
                            "body": "Right, but that doesn't seem to have much to do with whether jobs get automated... That's been true for basically ever",
                            "score": 11,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:15:44",
                            "replies": [
                                {
                                    "author": "NorskKiwi",
                                    "body": "Immigrants often work low paying jobs that automation might replace (was maybe their point?).",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 17:52:04",
                                    "replies": [
                                        {
                                            "author": "Mediocre-Ebb9862",
                                            "body": "Immigrants also often work high paying jobs too.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 19:09:46",
                                            "replies": [
                                                {
                                                    "author": "oneeyedziggy",
                                                    "body": "Idk, i figured they meant all the jobs b/c that's what they said",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-16 19:28:19",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrRandomNumber",
            "body": "People will migrate to avoid ugly political situations, resource restrictions and inhospitable climate. If you're of a certain disposition I guess you could close up your border and leave them to die -- at some point that decision may work against you though.",
            "score": 7,
            "depth": 0,
            "timestamp": "2024-03-16 20:46:34",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "Inhospitable countries I *hope* will be made more hospitable with sustainable food trading, cheaper desalination, and cheaper renewable energy production.\n\nIts doable with richer nations in inhospitable countries. Just have to make things cheaper 🤞\n\nImmigration is generally not made up of asylum seekers though. At least not in my country",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:07:29",
                    "replies": [
                        {
                            "author": "MrRandomNumber",
                            "body": "Naaah. Those who have will build walls and hoarde. Those without will invade. Thugs will rampage (some may form governments). The usual human pattern will play out again.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-03-16 21:46:29",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Munkeyman18290",
            "body": "It wont all be automated, but you can bet the jobs left for Americans will be fewer and fewer, driving up competition among labor, driving wages, salaries, and bargaining power into the dirt.\n\nOur kids will take whatever job they can get, for whatever wage their employers are graciously willing to give them.\n\nInfitinite growth on a finite planet is a silly premise to build society on. This way of life was unsustainable from the get go.\n\nWhat kills me is that all we'll have to show for any of this in the end is box stores filled with shit absolutely no one needs, all destined for a landfill, fucking up the vastly superior natural environment we were all entitled to long before humans ever even stepped foot on Earth.",
            "score": 152,
            "depth": 0,
            "timestamp": "2024-03-16 17:11:10",
            "replies": [
                {
                    "author": "calcium",
                    "body": "This is why unions are seeing a resurgence",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-03-17 08:08:41",
                    "replies": [
                        {
                            "author": "fluffy_assassins",
                            "body": "They are?  Got a source for that?",
                            "score": 7,
                            "depth": 2,
                            "timestamp": "2024-03-17 12:50:18",
                            "replies": [
                                {
                                    "author": "calcium",
                                    "body": "There was a reference to unions resurgent in a Washington Post article recently with the Dartmouth Men’s Basketball players signing with a union. It had mentioned that unions were popular with Gen Z and that they were beginning to grow in the US as you get workers wanted more collective bargaining rights. \n\nhttps://www.washingtonpost.com/sports/2024/03/05/dartmouth-mens-basketball-union/",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2024-03-17 15:18:24",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mediocre-Ebb9862",
                    "body": "This is incredibly dooomer post that completely disregards the massive improvements in like over last lets say 150 years on the planet, and in US too.",
                    "score": 29,
                    "depth": 1,
                    "timestamp": "2024-03-16 19:11:31",
                    "replies": [
                        {
                            "author": "POEness",
                            "body": "The rich will never let us have the fruits of our labor",
                            "score": 11,
                            "depth": 2,
                            "timestamp": "2024-03-17 02:18:53",
                            "replies": [
                                {
                                    "author": "brickmaster32000",
                                    "body": "The fact that you are able to type that speaks to the reverse. ",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2024-03-17 16:10:37",
                                    "replies": []
                                },
                                {
                                    "author": "FrogsArchers",
                                    "body": "I promise you, they won't have a choice",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-18 15:24:30",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Icy-Bicycle-Crab",
                            "body": " >that completely disregards the massive improvements in like over last lets say 150 years on the planet,\n\n\nSure, like how we've massively improved fossil fuel infrastructure for pumping carbon into the atmosphere. ",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-03-17 01:17:58",
                            "replies": [
                                {
                                    "author": "Frigoris13",
                                    "body": "You prefer the coal power we used to use?",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2024-03-17 07:16:54",
                                    "replies": []
                                },
                                {
                                    "author": "Mediocre-Ebb9862",
                                    "body": "You want to compare standards of living 150 years ago vs now? In United States, Russia, China, Brazil, somewhere else?",
                                    "score": 10,
                                    "depth": 3,
                                    "timestamp": "2024-03-17 03:48:56",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Deleted",
                            "body": "Problem is that it doesn't matter what improvements we did over 150 years when there are no jobs and we don't have money to buy or afford those improvements in the first place.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 10:07:45",
                            "replies": [
                                {
                                    "author": "FrogsArchers",
                                    "body": "Productivity, incentives and rewards will all change to blockchain well before the economy goes fully automated.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-03-18 15:26:30",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ken-bitsko-macleod",
                    "body": "Once we get source-to-user robot production things should get more efficient. Build on demand, no inventory, and much more likely products will be returned for teardown and recycle.",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:31:32",
                    "replies": [
                        {
                            "author": "ReluctantAvenger",
                            "body": "Nice. How will we pay for these things? Think the factory owners will just send things to us with their compliments?",
                            "score": 23,
                            "depth": 2,
                            "timestamp": "2024-03-16 18:07:57",
                            "replies": [
                                {
                                    "author": "jared555",
                                    "body": "Something like basic income seems inevitable.  Keep those whose work isn't needed alive while rewarding those who do work.\n\nThe question is just if there will be a reenactment of the French revolution first.",
                                    "score": 18,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 19:25:45",
                                    "replies": [
                                        {
                                            "author": "Icy-Bicycle-Crab",
                                            "body": "Americans would rather watch homeless people starve than provide something like basic income. ",
                                            "score": 8,
                                            "depth": 4,
                                            "timestamp": "2024-03-17 01:19:18",
                                            "replies": []
                                        },
                                        {
                                            "author": "chig____bungus",
                                            "body": "Basic income is only inevitable to people who think \"let them starve and if they resist use our robots to kill them\" is a valid option.",
                                            "score": 6,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 22:33:35",
                                            "replies": []
                                        },
                                        {
                                            "author": "Jadty",
                                            "body": "If the government gives you $1,000 for groceries , expect a loaf of bread to be $100 before you know it. It’s always been neofeudalism, and this time it will be for real.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 20:49:18",
                                            "replies": [
                                                {
                                                    "author": "Jasrek",
                                                    "body": "At a certain point, you're going to have automated farming, automated shipping, automated production. What will be the point of money? You're not paying anyone for this labor. Make it a federally run utility for basic needs that's provided to all citizens.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-16 21:12:24",
                                                    "replies": [
                                                        {
                                                            "author": "AMightyDwarf",
                                                            "body": "Money is not a measurement of how much labour went into a thing but its subjective value. Let’s say that a loaf of bread is fully automated from the fields to the factory to the store, 0 direct human labour in that supply chain. You still have energy costs, you have logistic costs and transportation costs. The machines have maintenance costs and will likely have consumables like oil and grease needed. These are just a few value adding variables. If you live in a city, away from the farms then the transport costs will be a lot higher than if you lived very close to the production centres. Supply and demand will still be a factor so if your neighbour is buying double the amount they need that’s going to push prices up, especially in a market that’s focused on Just in Time production. \n\nEssentially what I’m getting at is something that we’ve known for over a century, the labour theory of value is wrong.",
                                                            "score": 7,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-17 02:46:41",
                                                            "replies": [
                                                                {
                                                                    "author": "Jasrek",
                                                                    "body": "But there's no humans in any of those chains. Who is being paid these costs? Where would the money be going?\n\nYou're not paying the robot who transporting the goods. You're not paying the robot who is maintaining the power plant providing the power. You're not paying the machine that producing the oil or grease. It's robots all the way down.\n\nImagine you pay $5 for a loaf of bread. Right now, every cent of that $5 ends with a human being. The people in the store (from the sales clerk to the manager to the owner), the people in transporting it to the store, the people who make the ingredients into bread, the people who grew those ingredients, and so forth.\n\nAssume that all becomes automated at some point. Where does the $5 go?",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-03-17 03:13:46",
                                                                    "replies": [
                                                                        {
                                                                            "author": "AMightyDwarf",
                                                                            "body": "Even on a completely automated supply chain there are consumables that need paying for. Oil and grease for the robots, fertiliser for the soil, seeds etc. Even without human labour these things have a value due to them being finite resources. The electricity the robots use has value even when it comes from a totally sustainable source because energy as usable to us is not finite.\n\nIf we just stick with the power plant section, there are costs in the initial building of the plants. Power plants currently have humans running them so there will be a cost in changing over to robots, setting them up. There’s a cost to creating the software that’s running them and that software is built on top of other bits of software that had a cost and so on all the way back to the first computer.",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-03-17 04:29:30",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Jasrek",
                                                                                    "body": "The consumables have a *value*, but not a *price*. Who are you paying? The robot? What is the robot going to do with the money, pay other robots? \n\nIf the farming robot uses a pound of fertilizer transported to the farm by an automated truck and produced in an automated factory, do you think the farming robot is going to pay the other robots? Is the robot going to pay for the electricity it uses by spending dollars to the automated power plant?",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-03-17 05:10:28",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Jadty",
                                                            "body": "The point will be that those in power and control will want to keep being in power and control. They don’t want us in the country club, and not even within a 5 mile radius. The stench of plebs can ruin the most perfect of afternoons.",
                                                            "score": 6,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-16 21:18:02",
                                                            "replies": [
                                                                {
                                                                    "author": "jared555",
                                                                    "body": "Hence French Revolution 2.0",
                                                                    "score": 6,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-03-16 21:37:03",
                                                                    "replies": [
                                                                        {
                                                                            "author": "FeloniousReverend",
                                                                            "body": "4.0, there already were three major revolutions in France.",
                                                                            "score": 5,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-03-16 23:22:40",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Jasrek",
                                                                    "body": "Those in power - why would they care about money? No one except them would have any, it would be a meaningless number. No one can buy their goods, so someone like Jeff Bezos or Elon Musk would become penniless. There would be no point in investing into the stock market - likely, it would have long crashed, along with the housing market.\n\nWho would be employed, in this situation? No farmers, no drivers, no office workers, no managers, no cooks, no teachers. Did you get rich via real estate? All those office buildings are empty, their leases ended. You're now poor. \n\nWho gets invited to the country club? The rich? How would they make any money and who would pay them?",
                                                                    "score": 3,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-03-16 22:20:12",
                                                                    "replies": [
                                                                        {
                                                                            "author": "ScreamingFly",
                                                                            "body": "The thing is that they don't care. They don't see further ahead that two or three years. They want profit now and fuck anything else.",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-03-16 23:49:46",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Jasrek",
                                                                                    "body": "Yes, I agree.\n\nA lot of the foundations of power that exist right now are built on economic power - wealth and disparity of wealth, because people need to buy things to survive and need to work to buy things.\n\nBut if and when automation becomes widespread and an effective replacement for human labor, that entire foundation collapses. \n\nWhen someone says Elon Musk is wealthy, they mean his companies and the stock he owns is a high value. 90% of his 'net worth' is pieces of paper that says he owns a piece of Telsa or SpaceX or Twitter, and those companies have a stock price of whatever.\n\nSo what happens when all that crashes? He doesn't end up any better than anyone else.",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-03-17 00:14:33",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ken-bitsko-macleod",
                                    "body": "The main point is that when we have robots for source-to-user there are no factory owners. \"Energy credits\" are for balancing larger projects at the university and community and larger.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 19:47:18",
                                    "replies": [
                                        {
                                            "author": "Jadty",
                                            "body": "Oh, sweet child.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 20:49:52",
                                            "replies": [
                                                {
                                                    "author": "ken-bitsko-macleod",
                                                    "body": "Would it be accurate to say you expect a Star Wars future over a Star Trek future? Powerful people being what they are.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-17 14:02:51",
                                                    "replies": [
                                                        {
                                                            "author": "Jadty",
                                                            "body": "I expect more of an Elysium future.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-17 14:15:40",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ken-bitsko-macleod",
                                                            "body": "I believe advanced economies are already post-scarcity. The only problem we have with production using ourselves, people, is our (as a group) inherent laziness and whataboutism. We won't work \"for everyone\" to have a high-middle income lifestyle if we see others working less.  Robots, AI, and automation in general solve that problem. A Star Trek future.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-17 14:18:27",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DrSitson",
                                                    "body": "I was thinking the same about you lol....",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-16 22:23:08",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:51:11",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "[removed]",
                            "score": -6,
                            "depth": 2,
                            "timestamp": "2024-03-16 18:42:23",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SmokingLimone",
                    "body": "What do we have to show for any of this? That billions of people were raised out of absolute poverty, that they won't die from starvation, or a bite wound from a rabid animal, or malaria, or falling onto a rock. Unless we literally start living inside a Matrix-like prison I still think this is better than having no civilization. And as a civilization we can also protect nature from future threats",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-17 05:13:04",
                    "replies": []
                },
                {
                    "author": "FrogsArchers",
                    "body": "You're assuming that this ridiculous economic paradigm will exist in a post-labor economy.\n\nIt won't.\n\nWe will have created blockchain-based rails and tokenize absolutely everything",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-18 15:21:54",
                    "replies": []
                },
                {
                    "author": "wvmtnboy",
                    "body": "After we collectively beat a few dozen of these employers to death in front of their families, we'll begin to regain some of that lost bargaining power.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-16 19:01:44",
                    "replies": []
                },
                {
                    "author": "adfdub",
                    "body": "We are the prequel series to Wall-E",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-17 00:13:28",
                    "replies": [
                        {
                            "author": "mhornberger",
                            "body": "Interesting movie.  They had fusion (or some other plentiful energy source) and strong automation.  So they had the tools at hand to address the problems that were the core plot drivers of the movie.  With AI and good automation you can automate the picking up and recycling of trash, the filtering of water, and the planting of trees.  You can desalinate water and pump it to green arid regions.   Problems can be addressed, particularly when you have cheap/abundant green energy and good automation.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 05:01:16",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "It’s not as dire as that. We’ve automated lots of jobs over the last 50 years and yet unemployment is still pretty low. How did that happen ?",
                    "score": -2,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:21:24",
                    "replies": [
                        {
                            "author": "SeaHam",
                            "body": "Unemployment is the end goal. We should celebrate when each and every sector is automated away, instead we panic because our moronic system requires people to have a job or die. \n\nWe need to shift our thinking. People have intrinsic value outside of what value they can produce for a capitalist to gobble up. \n\nOtherwise what was all the centuries of innovation even for?",
                            "score": 15,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:47:53",
                            "replies": [
                                {
                                    "author": "Bagellllllleetr",
                                    "body": "It’s just a shame no one in government is going to do anything about it until there are tons of unemployed people with no money.",
                                    "score": 11,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 19:01:24",
                                    "replies": [
                                        {
                                            "author": "Retro-Ghost-Dad",
                                            "body": "That is patently UNTRUE. In the US, at the very least, I PROMISE the government will take swift and decisive action.\n\n&#x200B;\n\nThey'll continue to make homelessness illegal so that people who lose their dwellings can be fed into the for-profit prison system.",
                                            "score": 9,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 20:39:44",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Deleted",
                                    "body": "Exactly. Money is only meaningful if it can be circulated which means a large portion of society needs to have a means of acquiring it. If that isn’t possible then money loses all value because too few people are using it for it to be meaningful.",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 19:44:55",
                                    "replies": [
                                        {
                                            "author": "SeaHam",
                                            "body": "Unless you are part of the breakaway elite I'm going to be upset when you hinder UBI. I see no other realistic solution at this time.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-03-17 02:48:55",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "CyberRax",
                                    "body": "Is there intrinsic value in all of us though when we're 8 billion and counting. Even without capitalism, at one point someone somewhere will start asking if it's really neccessary to spend the resources to keep all of us alive. And if they inevitably come up with \"No, not really\", then we're back at the same spot where we are now.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 19:48:39",
                                    "replies": [
                                        {
                                            "author": "SeaHam",
                                            "body": "You're right and that's why you must be wrong.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-03-17 02:44:49",
                                            "replies": [
                                                {
                                                    "author": "SeaHam",
                                                    "body": "Because the alternative is slaughter.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-17 02:45:21",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Jadty",
                                    "body": "Cool it with the [REDACTED BY CURRENT YEAR SENSITIVITY FILTER] remarks.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 20:51:13",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CrazyCoKids",
                            "body": "They simply shifted jobs over.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-16 20:37:35",
                            "replies": []
                        },
                        {
                            "author": "damontoo",
                            "body": "What's happened with AI in the last 1-2 years is completely unlike anything that's happened before. You can't expect jobs to exist just because they haven't been automated yet. They'll all be automated soon. ",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:31:45",
                            "replies": [
                                {
                                    "author": "red_vette",
                                    "body": "Big difference between AI and actual automation of labor jobs.  Where are they building all of these robots to do the actual work that will \"soon\" be doing this work?",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 18:08:21",
                                    "replies": [
                                        {
                                            "author": "damontoo",
                                            "body": "There's at least three different companies working on humanoid robots including Boston Dynamics, Tesla, and Figure.",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 22:02:20",
                                            "replies": [
                                                {
                                                    "author": "red_vette",
                                                    "body": "Once again, working on a functional prototype is far different than building enough robots to handle labor jobs.  This isn't even factoring in getting the cost low enough to replace the labor.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-17 14:33:23",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DiscoQuebrado",
                                    "body": "I know never say never but it's highly unlikely we'll ever automate away a large segment of technical work- mechanics, electricians, plumbers, and more are not very replaceable. Even if a bot could somehow do the actual work, the environments the work is performed in and the uh... creativity that is often needed for certain jobs would be prohibitive.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 19:10:10",
                                    "replies": []
                                },
                                {
                                    "author": "bill_gannon",
                                    "body": "Nobody is going to be AI lettuce picking any time soon.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 18:34:52",
                                    "replies": [
                                        {
                                            "author": "damontoo",
                                            "body": "[We definitely can't automate lettuce picking.](https://www.youtube.com/watch?v=VjAXX-PCwjI)",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 22:06:39",
                                            "replies": [
                                                {
                                                    "author": "bill_gannon",
                                                    "body": "This one Europen prototype does not negate the fact that this tech does not exist in widespread use. If it were food would not be rotting in the fields from lack of workers as it is now.\n\n\nFurther a lot of produce will likely never be harvested mechanically. But you keep pearl clutching over AI replacing exploited humans.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-17 07:19:35",
                                                    "replies": [
                                                        {
                                                            "author": "damontoo",
                                                            "body": "It's hardly a prototype. There's many other YouTube videos showing automatic harvesters being used for years. ",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-17 11:29:32",
                                                            "replies": [
                                                                {
                                                                    "author": "bill_gannon",
                                                                    "body": "For some things that's true. For more its not and likely never will be for many reasons. \n\n\nIf it helps you comprehend substitute cherries or asparagus (or peppers or grapes or you get the idea) for lettuce.  Robot pickers simply don't exist and won't due to cost and complexity. Not for a while anyway.\n\n\nSo potatoes yes, apples no. This wont be solved by AI. Not for a long time. It simply makes no sense.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-03-17 12:18:17",
                                                                    "replies": [
                                                                        {
                                                                            "author": "damontoo",
                                                                            "body": "There's automated growing/harvesting for probably every type of produce you can think of ([like apples](https://www.youtube.com/watch?v=Cnc9BizDJh8)). The current limitation is cost. But AI will significantly reduce the cost of robots.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-03-17 14:30:39",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "bill_gannon",
                                                                                    "body": "We can 3D print houses too but the trades are alive and well. I'll let you figure out why.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-03-17 14:35:39",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Spara-Extreme",
                    "body": "This basically. There’s a very bleak path forward for unchecked capitalism.",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:44:52",
                    "replies": [
                        {
                            "author": "terribleD03",
                            "body": "Your are thinking of corporatism, not capitalism.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-16 19:23:50",
                            "replies": [
                                {
                                    "author": "Spara-Extreme",
                                    "body": "And whats the difference?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 20:58:22",
                                    "replies": [
                                        {
                                            "author": "terribleD03",
                                            "body": "Um...everything.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 21:18:24",
                                            "replies": [
                                                {
                                                    "author": "Spara-Extreme",
                                                    "body": "Sure, point it out how Corporatism and Capitalism are different things.  I personally don't know.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-16 21:28:15",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-03-16 20:32:19",
                    "replies": [
                        {
                            "author": "HurryImmediate",
                            "body": "The problem is that many social security programs are built upon continued contribution. If the contributing population declines while all of the previous contributors reach retirement age, then who is keeping the house of cards from crashing down?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 00:17:11",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "Growth is a natural progression for society. society weren't built because it has infinite growth in mind. we build society simply because we are a social animal.\n\nnothing is infinite and we will eventually be interplanetary species unless we nuke each other back to stone age.\n\nThere is no objectively superior natural environment, because we value that based off how human value things. \n\nPlanet earth and the universe don't have a preference for any climate nor lifeform exist or not. \n\nI also would be hard pressed to think ice age is a better climate than what we have now. Plus warmer and more humid climate is where there were lots of rain forest, and pretty complex bio sphere.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-03-16 20:49:50",
                    "replies": []
                },
                {
                    "author": "Past-Cantaloupe-1604",
                    "body": "Then go live in the wilderness as a self sufficient hunter gatherer.  This is an option available to you.  You won’t take it though, because whatever infantile crap you might spout about the evils of consumerism, you know that life would be much worse.",
                    "score": -7,
                    "depth": 1,
                    "timestamp": "2024-03-16 18:10:40",
                    "replies": [
                        {
                            "author": "Munkeyman18290",
                            "body": "Chances are if the land is worth anything, its owned. And then there are hunting, farming, and building regulations, among other roadblocks.\n\nNot only do we not teach or provide people with the skills to unhinge themselves from consumerism, its practically illegal anyway.\n\nAnyway, go blow a CEO while the rest of us work on solutions to glaringly obvious problems.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2024-03-16 18:46:29",
                            "replies": []
                        },
                        {
                            "author": "Jadty",
                            "body": "Try picking fruits, hunting and living from public land and see how many bullets they put in your skull.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-03-16 20:53:33",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Belnak",
            "body": "People still need a place to flee from war, famine, dictatorships, genocide, etc.",
            "score": 30,
            "depth": 0,
            "timestamp": "2024-03-16 17:01:43",
            "replies": [
                {
                    "author": "oneeyedziggy",
                    "body": "So... Just spitballing, but taking OPs premise... ALL... JOBS... soldier, president, congress, ambassadors, power plant operator, environmentalist... \n\n\nI guess the question is does the automation in question just implement the plans of the last human leader for all eternity? Or is it the same rule set and we end up with one world government that's effectively the same everywhere? \n\n\nDepending on the implementation, it could mean that with one global country, there's no-longer a concept of immigration... That'd be like moving across the same city \"immigration\"... \n\n\nSome people might still move (giving the option) b/c of climate (or because of climate change), and nature tourism isn't likely to go away unless there's complete totalitarian lockdown...",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:23:05",
                    "replies": [
                        {
                            "author": "an_irishviking",
                            "body": "What you are hinting towards would be basically star trek. A moneyless unified society. People would have no need to work because everything would be automated. \n\nThis would lead to people devoting their time to their passions and a society based on personal merit. Moving would be done for personal choice or to follow a specific discipline, like moving to Paris to study cuisine. There would be more options for people.\n\nThough this is also dependent on exceptionally cheap energy.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:58:09",
                            "replies": [
                                {
                                    "author": "oneeyedziggy",
                                    "body": "Yup, not saying it's close... It's OP's premise, not mine, maybe one day",
                                    "score": 6,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 19:27:36",
                                    "replies": [
                                        {
                                            "author": "an_irishviking",
                                            "body": "If we're smart I could see it happening sometime next century. But it will take either preemptively wresting control from corporations or a major societal upheaval.",
                                            "score": 4,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 20:25:22",
                                            "replies": [
                                                {
                                                    "author": "Pacify_",
                                                    "body": "We far more likely to end up in cyberpunk than star Trek. It's just basic human nature",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-17 02:21:37",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "eJaguar",
                                    "body": ">t. Moving would be done for personal choice or to follow a specific discipline, like moving to Paris to study cuisine. There would be more options for people. \n\n\nwow that's a very optimistic perspective. from how things seem to be playing out currently, all of Western Europe in 40 to 50 years, well you're not going to be the only one trying to get in and you're also not going to be the only one denied entry\n\n\nbut maybe if you're wide enough the automated kill drone border patrol won't shoot you immediately. bullets are expensive after all",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 21:00:44",
                                    "replies": []
                                },
                                {
                                    "author": "Jadty",
                                    "body": "This will never, EVER happen.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 20:58:13",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "damontoo",
                    "body": "All those things go away with an AGI. All of the problems they're fighting over will disappear. All the power dictators think they have will disappear too. ",
                    "score": -6,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:33:39",
                    "replies": [
                        {
                            "author": "Belnak",
                            "body": "AGI isn't going to cure human greed or hatred.",
                            "score": 8,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:50:02",
                            "replies": [
                                {
                                    "author": "damontoo",
                                    "body": "And in a post-scarcity society when people can print gold or anything else out of nothing (or some waste material), greed kind of ceases. \"Oh, so you filled an island with gold bars? That's nice.\" The total collapse of the global economic system will result in wars but they'll be very brief wars with a stalemate of autonomous machines/systems.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 21:57:40",
                                    "replies": [
                                        {
                                            "author": "brickmaster32000",
                                            "body": "So not AGI but magical replicators that somehow appear fully formed and distributed to everyone all at once.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-03-17 16:13:13",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "vergorli",
                            "body": "Well, if you look how Putin deliberately keeps his rural population too poor to get even toilets or washing machines, I can guess what dictators do when AGI comes around.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:47:11",
                            "replies": []
                        },
                        {
                            "author": "Deleted",
                            "body": "Look at this guy… he hasn’t heard of *AGI dictators* yet…\n\n😏",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:53:25",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AngryFace4",
            "body": "The amount of work in the world is not a finite thing. \n\nComputers, on the other hand, run on finite resources.",
            "score": 14,
            "depth": 0,
            "timestamp": "2024-03-16 17:55:52",
            "replies": []
        },
        {
            "author": "Infernalism",
            "body": "We're not going to be able to automate everything.\n\nBut, assuming we do, we still need consumers for our products and it can't all be overseas markets.  We need a domestic market, as China's current debacle illustrates extremely well.\n\nWe also need a population base to maintain our power.  This is the true power of immigration.  Families, children, people.",
            "score": 19,
            "depth": 0,
            "timestamp": "2024-03-16 16:53:20",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "This is the key element. Assuming everything can be automated then we have to ask - how does an economy like that look ? Essentially if you have automated farming but nobody can afford to buy the product then what will happen to the product ?",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:25:26",
                    "replies": [
                        {
                            "author": "Infernalism",
                            "body": "UBI becomes necessary at that point.  \n\nEssentially government subsidized free housing, food and utilities.",
                            "score": 10,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:28:36",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "And where does the money for UBI come from ?",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 19:41:10",
                                    "replies": [
                                        {
                                            "author": "Infernalism",
                                            "body": "Heavily taxed businesses.\n\nIt's that or people just burn everything down because people are not going to starve because there aren't enough jobs.  They will burn this shit to the ground.",
                                            "score": 16,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 19:51:50",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "Broadly what you’re saying is we take the difference between what it costs the business to make a product X and what it can sell if for Y = Z. We then give a portion back to people (Z less something) so they can buy again. That isn’t sustainable. \n\nMore likely we simply don’t use money anymore because nothing really “costs” anything in the traditional sense. If the robots can maintain the robots and the robots can do all jobs then there is nobody to “pay”.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-16 20:16:10",
                                                    "replies": [
                                                        {
                                                            "author": "Infernalism",
                                                            "body": "Except we live in a reality that has entropy and all things break down and run down.  \n\nAnd there is always a material cost to repair and maintain.",
                                                            "score": 8,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-16 20:35:42",
                                                            "replies": [
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "But the robots mine the minerals, process the materials and maintain the broken down equipment surely ?",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-03-16 22:17:57",
                                                                    "replies": [
                                                                        {
                                                                            "author": "ralts13",
                                                                            "body": "Well someone has to build the robots. Or design the machine that builds the robots. Or designs improvements to the robots. It's likely that automating one process will create a job to maintain or improve it.",
                                                                            "score": 3,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-03-17 01:36:32",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Deleted",
                                                                                    "body": "Maybe at first but then the robots do that.",
                                                                                    "score": 3,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-03-17 07:51:19",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "shponglespore",
                                                            "body": "Money doesn't just pay for labor. The cost of labor could go to zero but raw materials would still have monetary value because the supply of them is finite.\n\n\n\n\nIf the cost of labor actually goes to zero, everyone should have a quota of natural resources they're allowed to use. It should be the same same everyone because nobody could to anything to justify having more than anyone else. In practice it would look a lot like a basic income except it would no longer be \"basic\". \n\n\nNot that I think it would ever work out that way, because people love being dicks to each other. That's the real wildcard for post-scarcity economics.",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-16 21:34:44",
                                                            "replies": [
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "Raw materials are produced through labor. Overpopulation is a different debate surely ?",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-03-16 22:18:35",
                                                                    "replies": [
                                                                        {
                                                                            "author": "shponglespore",
                                                                            "body": "Raw materials are not produced at all. They're collected from nature. Which has a finite supply of them that we have to share.",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-03-16 23:05:39",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Deleted",
                                                                                    "body": "There are more than adequate resources out there especially if we can use robots for mining. It is the economics of extraction that limit supply not the existence of the raw materials.",
                                                                                    "score": 0,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-03-16 23:14:21",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Deleted",
                                                            "body": "What if everything just became so cheap that you didn’t need to make much money anyway.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-17 19:26:39",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Pacify_",
                                            "body": "What is money?\n\nIt's not a physical thing. All production is just resources and man power. And remove man power and it's become purely resources. Money is just something we added along the way, it's not intrinsic to anything.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-03-17 02:23:14",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fluffy_assassins",
                            "body": "Farming is only for luxury crops, the rich can build more golf courses side they didn't have to feed us peasants.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 17:48:21",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Diatomack",
                    "body": ">We also need a population base to maintain our power.  This is the true power of immigration.  Families, children, people.\n\nMore people = more power? That doesn't sound right\n\nTechnological innovation has almost always been the key to exerting power over others",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:06:06",
                    "replies": [
                        {
                            "author": "Infernalism",
                            "body": "Technological innovation comes from people, specifically, young people.  That's where we get out breakthroughs.  \n\nYou need a strong population base for tech improvement, a strong domestic market and a reliable tax payer base.  Without those, everything else is moot.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:22:47",
                            "replies": [
                                {
                                    "author": "Diatomack",
                                    "body": "That's true for now, definitely. But I assume there will come a time however far in the future where AI will be more innovative than humans.\n\nAssuming we get to that point, it doesn't matter how many people you have, the AI will be the innovator not you.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 17:32:52",
                                    "replies": [
                                        {
                                            "author": "Infernalism",
                                            "body": "> That's true for now, definitely. But I assume there will come a time however far in the future where AI will be more innovative than humans.\n> \n> Assuming we get to that point, it doesn't matter how many people you have, the AI will be the innovator not you.\n\nAs Agent Smith said, that's when it becomes their world and not ours anymore.",
                                            "score": 4,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 17:35:47",
                                            "replies": []
                                        },
                                        {
                                            "author": "WhimsicalWyvern",
                                            "body": "I don't think anyone can actually predict with \\*any\\* sort of accuracy what the world will be like if and when that comes to pass.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 18:56:36",
                                            "replies": [
                                                {
                                                    "author": "Diatomack",
                                                    "body": "Everyone with any skin in the game seem to generally say some time this century",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-16 19:00:25",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "terribleD03",
                            "body": "Actually, more people often equals more power.  \n\nIn one scenario - if the population is diverse and there is no assimilation.  Then society regresses toward tribalism (or some might say Balkanization).  Once that happens there is increased strife, hate, inequality, crime, etc.\n\nAll that allows a government (or a party or some group of people - like the U.N.) to basically do whatever they want.  The population is busy just trying to survive their everyday lives, and it will growing resentful of others, society, etc.  It also lays the foundation for the government, or whatever group has enough power, to implement a police state, fascism, a kleptocracy, etc, etc, etc.\n\nThere are plenty of other ways that more people equals more power.  This is just one small example within the U.S. - look at what the Democrats did with sanctuary cities and states.  They encouraged illegal immigrants to come into the country and to their states.  This accomplished several things.  First, increased the population base.  Then the Dems voted to insure that the census had to include all residents (not just citizens).  That increase gives them more representatives in the House.  Second, it gets them more federal funding.  Most people think of that in terms of welfare but actually there's lots and lots of avenues to get more of the federal government's disbursements.  Then if issues arise with illegal immigrants the first thing they do is get special allocations (more money) from the federal government.\n\nAlso, in a wartime scenario more people equals more bodies to throw at the enemy.   \nOr in an agricultural / pre-automated / pre-AI society more people = more power due to more production power.\n\nBut you are also correct in that technological innovation works as well too.  Especially in today's disinformation age.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-03-16 19:22:57",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kpeterson159",
            "body": "I seriously doubt it will be every job out there. Framers and roofers will take a while to be outsourced. Along with electricians, HVAC and plumbers. I used to be a commercial plumber.",
            "score": 8,
            "depth": 0,
            "timestamp": "2024-03-16 17:03:08",
            "replies": [
                {
                    "author": "Fully_Edged_Ken_3685",
                    "body": "Those fields will be flooded by displaced domestics, providing a sharp political pressure against immigration. If you think the \"turk der jerbs\" rhetoric is bad now...",
                    "score": 13,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:12:59",
                    "replies": [
                        {
                            "author": "Gubekochi",
                            "body": "Dey tuk der jerbz?",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:16:35",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Icy-Bicycle-Crab",
                    "body": "Framing is already preassembled off-site, which is easier to automate. That can start with simple steps like automatically cutting all the lengths that a design needs. ",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-17 01:23:17",
                    "replies": []
                },
                {
                    "author": "ken-bitsko-macleod",
                    "body": "They're going to start architecting for robots to build and maintain.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:25:01",
                    "replies": []
                },
                {
                    "author": "DomingerUndead",
                    "body": "Yeah plumbing is prob one of the most safe jobs, roofing on the other hand there's one company called Renovate out there already automating this. Google \"Rufus roofing robot\"",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:46:08",
                    "replies": []
                }
            ]
        },
        {
            "author": "MannieOKelly",
            "body": "In terms of economic welfare: government benefits. Especially if that eventually includes a UBI. \n\nOf course there are other reasons, like war and failed or semi-failed states that can't keep internal order.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-16 17:16:01",
            "replies": [
                {
                    "author": "right_leaner",
                    "body": "That would be a reason against immigration though. If everyone is on a UBI, more immigrants means more recipients.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-04-24 18:09:10",
                    "replies": []
                }
            ]
        },
        {
            "author": "chufenschmirtz",
            "body": "Universal basic income, if it were ever implemented, would likely drive massive migration of those seeking welfare benefits. There would have to be laws to exclude non-citizens otherwise there would be a massive increasing number of recipients over time and comparative paucity of tax contributors.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-16 18:25:46",
            "replies": [
                {
                    "author": "Jadty",
                    "body": "Dude they’re already giving free money and indefinite luxury accommodations to illegals in NY RIGHT NOW, what makes you think they won’t also give them free UBI gibs? It’s over.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:10:43",
                    "replies": [
                        {
                            "author": "chufenschmirtz",
                            "body": "So I just googled this and see, “CLAIM: New York City is giving credit cards to migrants living in the U.S. illegally. AP FACT CHECK:\nMigrants in New York City will receive prepaid debit cards, not credit cards.”  \n\nFurther down, “Want to bet that New York City’s illegal crisis is going to get worse? $53,000,000.00 in free credit cards ensure that it will. New York will fall very soon. But migrants will get prepaid debit cards as part of the New York pilot program — not credit cards.”",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-03-16 21:39:31",
                            "replies": []
                        },
                        {
                            "author": "PA_Dude_22000",
                            "body": "And some have the gall to call those born in America, the “lucky” ones, pffft.\n\nShould have been born a Honduran orphan that managed to survive the trek to America and be livin‘ the Hi-Life with free Gov‘t Handouts on a small cot in a cramped refugee flop-house, eating bread and cheese daily from a massive $300 a month stipend.\n\nSome people were just born lucky, I guess 🙄",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-16 21:50:12",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JesseRodOfficial",
            "body": "How long will AI work for us though? Once it’s intelligent enough to understand how things work, why would it waste its time entertaining any of our work?",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-16 18:50:18",
            "replies": []
        },
        {
            "author": "Top-Apple7906",
            "body": "This question may have been better if it was, what is the point of the US or other developed nations letting immigrants in.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-16 19:04:41",
            "replies": []
        },
        {
            "author": "SbreckS",
            "body": "Not everything can be automated. But I'm sure you'll tell me otherwise.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-16 21:21:43",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "You can probably guess my view lol\n\nEverything will be automated given enough time\n\nI'd love to hear more of your pov though.\n\nDo you think there will be certain jobs that AI will never match human intelligence?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:26:09",
                    "replies": []
                }
            ]
        },
        {
            "author": "Mahariri",
            "body": "Cannon fodder for the war with Russia and China. At least that is the plan. The moment war breaks out our new friends will suddenly rediscover their love for their motherland.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-17 04:59:52",
            "replies": []
        },
        {
            "author": "puertomateo",
            "body": "This is such a weird question. \n\n\nIf you mean \"all jobs\" have been automated, why do you think someone would want or try to immigrate for a job? If you really only mean certain segments, why can't some immigrants be people who are better than residents at something? \n\n\nEmployment is only one of the reasons that people immigrate. There's plenty of immigration that occurs for humanitarian reasons. To escape racial or religious persecution. To get away from terror, war,  or oppression. To join their families or spouse. To retire in a region that they prefer. I'm not quite sure where you're coming from with this question.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-17 09:00:57",
            "replies": []
        },
        {
            "author": "HandOfThePeople",
            "body": "We have mass immigration because of wars. Wars the western world started. We better fucking accept those people.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-17 10:56:21",
            "replies": []
        },
        {
            "author": "the-butt-muncher",
            "body": "Consumption. You need people to buy shit to keep the economy running.",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-03-16 18:37:30",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "I wish it weren't so\n\nOne of the only good things to come out of the communist countries were products that were actually built to last, like the East German unbreakable  [superfest](https://digitalcosmonaut.com/superfest-ceverit-glass-ddr/) glasses.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-16 18:45:22",
                    "replies": [
                        {
                            "author": "the-butt-muncher",
                            "body": "Well, one could argue if shit's unbreakable then you need even more people buying it to create economic growth.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-16 23:29:10",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "[deleted]",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-03-17 06:02:55",
                    "replies": [
                        {
                            "author": "the-butt-muncher",
                            "body": "Don't be daft.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 17:34:37",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MattyT4998",
            "body": "The answer to this question depends largely on what is meant by 'all jobs automated'. 'No one has work' is a completely different thing to 'No one has to work'. And while the current world mindset mitigates strongly against seeing job automation as any kind of positive, there's a ton of situations and a ton of workers who might embrace it if it's done right.\n\nFor example, if it makes big box warehouse jobs obsolete, that might be just fine if it frees up a workforce to address climate change mitigation (an area I'd love to work in). And yes, this would require a significant redistribution of resources to do fairly.\n\nIn which case maybe we need more immigrants to do more useful jobs other than just bring in money or work in finance.\n\n....if you're looking for a positive take.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-03-16 17:38:55",
            "replies": []
        },
        {
            "author": "2pickleEconomy2",
            "body": "I guarantee you won’t see a decrease in total employment over the next 40 years outside of temporary recessions. Labor demand will continue to grow.",
            "score": 9,
            "depth": 0,
            "timestamp": "2024-03-16 17:53:59",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "Agree to disagree on that. I think we will start to see actual automation taking root by 2030 and beyond, let alone 40 years into the future",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-03-16 18:06:03",
                    "replies": [
                        {
                            "author": "2pickleEconomy2",
                            "body": "Automation already happens. I’m not saying we won’t seem a boom in automation. I’m saying we will still see demand for labor rise. Automation will create jobs.",
                            "score": 12,
                            "depth": 2,
                            "timestamp": "2024-03-16 18:16:32",
                            "replies": [
                                {
                                    "author": "Diatomack",
                                    "body": "I know this is hypothetical, but if we have an AI that can automate most/all jobs (I.e. work harder/smarter than us) then what new jobs could be created?\n\nSurely the AI would be able to also fill any new jobs that need to be filled?",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 18:19:34",
                                    "replies": [
                                        {
                                            "author": "2pickleEconomy2",
                                            "body": "You think starting in six years, all or most jobs will be replaced by AI? Thats pretty extreme. \n\nIf automation allows one worker to do the work of ten, that’s an increase in productivity. We generally predict increases in worker productivity and lower prices will increase (quantity of) demand, not decrease it. \n\nThe bigger problem I see is unskilled workers will face massive displacement, akin to what happened to all those manufacturing and farming jobs of yesterday. Those jobs get replaced as we find new areas to grow our output.\n\nWe’ve seen this before.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 18:27:23",
                                            "replies": [
                                                {
                                                    "author": "Diatomack",
                                                    "body": "\n>You think starting in six years, all or most jobs will be replaced by AI? Thats pretty extreme. \n\nNo, I think that's when we'll start to see the beginning.\n\nAnd there is definitely a cognitive ceiling where you can't expect all lower-skilled workers to reskill in a new high-level career.\n\nLife doesn't work like that.",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-16 18:33:29",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "shponglespore",
                                    "body": "If \"automation\" creates jobs, it should be abandoned immediately because it's just making unnecessary work.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 21:27:38",
                                    "replies": [
                                        {
                                            "author": "2pickleEconomy2",
                                            "body": "If we us the rise in productivity to produce more stuff. Specifically at a higher rate of increase - e.g. productivity doubles so we produce more than twice as much. Which we have done in the past in all things.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-03-17 00:19:03",
                                            "replies": [
                                                {
                                                    "author": "Icy-Bicycle-Crab",
                                                    "body": "Sure, but what is the point of that increase in productivity? ",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-17 01:24:21",
                                                    "replies": [
                                                        {
                                                            "author": "2pickleEconomy2",
                                                            "body": "Same thing it’s been before: to produce more stuff.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-17 10:20:23",
                                                            "replies": [
                                                                {
                                                                    "author": "Icy-Bicycle-Crab",
                                                                    "body": "And why do we need to produce more stuff? ",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-03-17 15:52:10",
                                                                    "replies": [
                                                                        {
                                                                            "author": "2pickleEconomy2",
                                                                            "body": "Because people want more stuff? Not to mention we still have homelessness, food insecurity, and poverty.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-03-17 15:54:58",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Icy-Bicycle-Crab",
                                                                                    "body": "We have those things because how we choose to distribute the amount of stuff that is made, not because of the quality of things being made. \n\n\nHomelessness, food security and poverty have all being increasing as the economy grows. \n\n\nThose are equality problems, economic growth for the sake of economic growth doesn't fix those. ",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-03-17 15:58:16",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "2pickleEconomy2",
                                                                                            "body": "People like to consume more. Are you not interested in making a higher salary with less work?",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-03-17 15:59:55",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Icy-Bicycle-Crab",
                                                                                                    "body": ">Are you not interested in making a higher salary with less work?\n\n\nWeird how that never happens and the increases in productivity don't trickle down. ",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-03-17 16:02:03",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "2pickleEconomy2",
                                                                                                            "body": "Ok, but that’s a separate issue. You were arguing people don’t want to be able to consume more. I think they do. \n\nIf we went to most people and asked if they would want to double their income while working the same amount or earn the same amount while working half as much, guess what most people would choose? \n\nI’m not making a moral statement. I’m just saying how people act. And our gains in productivity over the last two centuries has largely been used to produce more, not simply work less.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2024-03-17 16:04:18",
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "noahjsc",
                            "body": "Here's why, unemployed military age males are dangerous.\n\nThe police in my country are putting put reports that economic conditions are ripe for civil unrest.\n\nRealistically speaking look historically to the USSR. Many jobs were created for the sake of work instead of out of necessity. Our society has many unproductive jobs atm. You underestimate the will of the elites to not see themselves in a French Revolution scenario. They aren't ignorant of the risks.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-03-16 20:07:31",
                            "replies": [
                                {
                                    "author": "Diatomack",
                                    "body": "Yeah that's true.  \"Bullshit\" jobs are rife.\n\nAnd yeah, the elites are not going to get guillotined this time around. They're safe. Good for them.\n\nPeople are too bloodthirsty to \"eat the rich\". They are perfectly fine lol. There are bigger fish to fry",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 20:10:50",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Depthpersuasion",
            "body": "To allow better living for their families? Is this a hypothetical or jesting question; or one truly thinking the sole purpose of immigration is the workforce?",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-03-16 18:30:26",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "Yeah no shit. And when there are no jobs, why would a country want to accept extra people?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 18:38:26",
                    "replies": [
                        {
                            "author": "Depthpersuasion",
                            "body": "Because we care about them? What does it matter if resources are readily available thank to A.I.?",
                            "score": 7,
                            "depth": 2,
                            "timestamp": "2024-03-16 18:41:35",
                            "replies": [
                                {
                                    "author": "Diatomack",
                                    "body": ">What does it matter if resources are readily available thank to A.I.?\n\nIn that case it hopefully won't matter. I do hope all countries become prosperous and free.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 18:49:17",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "orbitaldragon",
            "body": "You are assuming the AI overlords will work for us.. and not the other way around.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-16 17:36:17",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "A malevolent AI overlord would have no purpose for humanity. If AI gets out of hand humans won't be around for very long",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:42:44",
                    "replies": []
                }
            ]
        },
        {
            "author": "Electricbill7",
            "body": "To separate the rich from the poor. To make the middle class a really small group and the poor class really big. It's for control over the people.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-03-16 21:50:12",
            "replies": []
        },
        {
            "author": "krindjcat",
            "body": "If *all* or most jobs are automated society will fundamentally be different from the one today to such a degree it's hard to project. Immigrants will be the least of your worries.\n\nHowever, immigration has always been around, people follow resources and run from danger. The reasons for immigrating change but immigration itself does not.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-16 17:39:08",
            "replies": []
        },
        {
            "author": "toronto_programmer",
            "body": "Immigration isn’t about increasing production, it is about importing consumers",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-16 18:59:57",
            "replies": []
        },
        {
            "author": "earsplitingloud",
            "body": "People will immigrate away from building robots like slaves for their robot masters.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-16 19:16:33",
            "replies": []
        },
        {
            "author": "dcdttu",
            "body": "Once all jobs are automated, you have removed society from itself. That's usually when guillotines get invented. \n\nImmigration will not be the big issue.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-16 19:38:44",
            "replies": []
        },
        {
            "author": "rileyoneill",
            "body": "People wanting to live where they want.  Maybe families reuniting.  If all jobs are automated, its going to be something we see on a global scale.  It means house designing jobs, and house building jobs are automated.  It means all food production, distribution, and preparation is automated.  It means everything that provides for our needs is automated.    \n\n\nIn addition to automation is a revolution in energy, solar/wind are going to be 10x cheaper than traditional energy and will be produced on site or fairly local.  Energy is an input for everything, transportation, food production, HVAC, material production,  and manufacturing.    \n\n\nThe cost of a comfortable life will drop drastically.  People by and large work to afford a quality of life, if this quality of life was much cheaper, people would by and large not work so hard.  Not that they would not work, but they would not grind to survive.    \n\n\nBut think about it, if this was the norm for you, would you ever decide to pack up and move somewhere else?",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-16 20:05:53",
            "replies": [
                {
                    "author": "Jadty",
                    "body": "They won’t let us EVER have any of that.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:11:48",
                    "replies": [
                        {
                            "author": "chargernj",
                            "body": "Then we TAKE it from them.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 11:53:45",
                            "replies": [
                                {
                                    "author": "Jadty",
                                    "body": "Easy there, Mr. Glowie. This thread is for educational purposes only.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-17 11:55:08",
                                    "replies": [
                                        {
                                            "author": "chargernj",
                                            "body": "Then let's educate them about the lessons to be learned from the French Revolution.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-03-17 11:58:23",
                                            "replies": [
                                                {
                                                    "author": "Jadty",
                                                    "body": "Your Honor, let the record show that these are words posted by Special Agent McNamara and not me. Slow day at the Bureau?",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-17 12:00:12",
                                                    "replies": [
                                                        {
                                                            "author": "chargernj",
                                                            "body": "Those who make peaceful revolution impossible will make violent revolution inevitable.\n\nJohn F. Kennedy",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-17 12:05:50",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "xeonicus",
            "body": "I think various menial labor will still rely on humans, and often immigrant labor.  Consider something as trivial as fruit picking.  Even today, robots aren't capable of doing this reliably.  The industry relies on cheap human labor.  Even if advances are made in robotics that allow for this, such robots would be incredibly expensive to own and operate.  Whereas a large labor force of humans are readily available do it easily for less than below minimum wage.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-16 20:28:19",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "That's true. I would hope in a mostly automated society that the now unemployed citizens would decide to pick up that work rather than shipping people over",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 20:35:12",
                    "replies": [
                        {
                            "author": "xeonicus",
                            "body": "I don't think anyone will do it, because the wages are too low and they don't want to.  A lot of industries rely on exploitation and paying below minimum wage.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-16 20:39:12",
                            "replies": [
                                {
                                    "author": "Diatomack",
                                    "body": "We do need people to wipe our grandparents' asses",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 20:56:59",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "shponglespore",
                    "body": "You say \"even today\" as if robots are as advanced as they're ever going to get. But robots are improving quickly and I see no reason for the improvement to stop anytime soon, barring a complete collapse of the world economy.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:38:48",
                    "replies": []
                }
            ]
        },
        {
            "author": "vercertorix",
            "body": "Fleeing the corporate overlords who decide they don’t need most of us now that we don’t provide products and labor for them.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-16 22:03:02",
            "replies": []
        },
        {
            "author": "TheAnswerUsedToBe42",
            "body": "Human rights, access to water, livable environments.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-16 23:06:46",
            "replies": []
        },
        {
            "author": "BKGPrints",
            "body": "Automation isn't a new concept.  We've been doing it for thousands of years and will continue to do so.  Not to mention that jobs have still been created because of it.  Maybe, what we should really be concerned about is that those jobs that are low-skill (which typically mean low-wages) are going to either go away or become fewer.\n\nThose who don't adapt to pursue specialty training, certification or higher type of education are going to face a not so bright future.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 00:00:48",
            "replies": []
        },
        {
            "author": "SoftlySpokenPromises",
            "body": "Depends on the economic climate after the fact.  Immigration could be something that happens in countries that embrace automation because of a lack of jobs and no social support network.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 00:06:48",
            "replies": []
        },
        {
            "author": "BlurredSight",
            "body": "This cycle has happened before and will happen again. Industrial Revolution killed any jobs that could be done by a machine and those workers had to quickly adapt to finding a new source of income usually working on an assembly line or maintaining the machines, etc. war time comes around and the job market needs people as 70 million people die in WW2 and a reset happens where people are making money and can afford to not work 70 hours a week.\n\nAutomation happens, stuff like coffee shops, grocery stores, distribution centers, public transit drivers become automated and we put value on those stores that keep human talent and interaction (Walmart and Trader Joe’s). But unlike war which started a great boom in the economy and reset a bunch of lives by killing them off, this time I imagine conditions will be a negative feedback loop where like you see now, people work where they can, they can’t afford to buy goods and products they need, companies lay off workers in return of lost sales rather than increase wages, and again the cycle continues. You also see a decrease in fertility in turn and after if it’s UBI or an automation tax, who knows.\n\nAlso outside of the private sector the government  would also cut off jobs or just refuse to replace retired workers because some computer can do it. Like the military for example, which is the largest public employer in the US but even they are laying off roles.\n\nBut this isn’t a Devin AI means bye bye one of the most skilled sectors in the market this is like 40-50 years down because right now AI isn’t artificial nor is it intelligent",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 01:01:52",
            "replies": []
        },
        {
            "author": "ralts13",
            "body": "Basically not everything will be automated. It will be ages before high skill labour can be automated while retaining quality. And if it's cheaper to hire someone than implement automation there will always be jobs.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 01:32:45",
            "replies": []
        },
        {
            "author": "MrMelonMaster",
            "body": "There won’t be any point in anything or any way to make anything functional if all jobs are automated in a capitalist society like this.\n\nIf we ever did get to this point without the greedy stopping it from happening for their own personal volitions, we would be taking in immigrants for the greater good and because we have the resources as a society.\n\nYou can’t apply today’s needs to a society entirely different in the future.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 02:03:47",
            "replies": []
        },
        {
            "author": "Robdon326",
            "body": "Lol not all jobs...what are billions gonna do,sit@home",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 04:40:30",
            "replies": []
        },
        {
            "author": "fonzmc",
            "body": "Persecution, genocide, punishment that goes agsinst the UN Human Rights etc. Let's also not forget modern day slavery.\n\nEconomic is a motivation for some immigration.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 05:37:40",
            "replies": []
        },
        {
            "author": "Beer-Milkshakes",
            "body": "To create problems that politicians will \"fix\" at the next election.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 05:48:20",
            "replies": []
        },
        {
            "author": "h3lblad3",
            "body": "Freedom of movement is a human right.\n\nWith no work, there won't be the mass drive to immigrate for work so the idea of \"invading immigrants\" will be even less of a problem. Problem reduces even further the more we get various resources closer and closer to superabundance -- there's no reason to worry the immigrant will get something you don't if there's more than enough of it for everyone.\n\nAnd I maintain: freedom of movement is a human right. I'm opposed to borders in general outside of pure security reasons. I just think that full automation will make my stance far more palatable for everyone else to take up.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 05:48:53",
            "replies": []
        },
        {
            "author": "Nixeris",
            "body": "Because that technology definitely won't be ubiquitous and evenly distributed.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 06:41:42",
            "replies": []
        },
        {
            "author": "perrinoia",
            "body": "As jobs get consumed by automation, new jobs are created that haven't been automated yet. \n\nAs long as people exist, they will find something that needs doing and a way to earn money doing it. \n\nUnless we birth a generation of people who believe they are above doing things, in which case, they deserve to starve.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 08:28:32",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "What is the point of national borders in such a scenario? You either have a post-scarcity Utopia, or you have a caste system where people are toys to landholders, with almost no options to change their position in life.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 08:32:55",
            "replies": []
        },
        {
            "author": "MissPandaSloth",
            "body": "Jobs are a whackamole, one disappears ten more appear.\n\nEven if we have some perfect AI and automation (which is something very far away, or maybe borderline impossible) we gonna have tons of entertainers, people supervising automation, jobs we couldn't even imagine now, feet smell sellers, whatever.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 08:43:37",
            "replies": []
        },
        {
            "author": "Alzzary",
            "body": "The error you are making is assuming automation destroys jobs. It actually frees manpower for other tasks. I manage an it infrastructure and the more I automate things the more I can do higher level stuff (strategy, planning, training, etc)",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 08:53:31",
            "replies": []
        },
        {
            "author": "Doctor_Amazo",
            "body": "Once all jobs are automated, how will capitalism be able to continue as no one is able to pay for goods and services that are now being provided by automation?",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 08:54:27",
            "replies": []
        },
        {
            "author": "tboy160",
            "body": "Once jobs are almost fully automated, everything must change.  We can't have capitalism.  We can't \"earn\" a living.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 09:26:09",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "To import new escorts. When automation is widespread, human trafficking will spike.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 09:47:43",
            "replies": []
        },
        {
            "author": "CountySufficient2586",
            "body": "Keep the native population healthy modern society is slowly killing us.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 10:29:22",
            "replies": []
        },
        {
            "author": "bewitched_dev",
            "body": "there are certain ethnic groups that feel unsafe with a homogeneous local population",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 12:16:41",
            "replies": []
        },
        {
            "author": "theMEtheWORLDcantSEE",
            "body": "Better cities, safer, cleaner, nicer views, weather.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 13:46:55",
            "replies": []
        },
        {
            "author": "xenodemon",
            "body": "Put on your foil hat and decide which rabbit hole you want to go down. Our they going to be allowed to vote? Receive public welfare? Assimilation? Language, culture, art, law? Think of your democracy",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 14:41:27",
            "replies": []
        },
        {
            "author": "AccountParticular364",
            "body": "climate, living conditions, leisure activities, cultural opportunities....",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 21:55:55",
            "replies": []
        },
        {
            "author": "BrilliantPhilosopisR",
            "body": "My friend, we shouldn't have been accepting it for the last 30 years!",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-18 00:23:19",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "[removed]",
            "score": 7,
            "depth": 0,
            "timestamp": "2024-03-16 18:36:24",
            "replies": [
                {
                    "author": "Jadty",
                    "body": "I’m glad you can see it that clearly. Many are still in denial.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:14:00",
                    "replies": []
                },
                {
                    "author": "CrushedCountry",
                    "body": "Yes, absolutely.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-03-17 00:58:48",
                    "replies": []
                }
            ]
        },
        {
            "author": "LasVegasE",
            "body": "Consumers are the point. Wealthy consumers are far more value to a nation than unproductive labor.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-16 19:14:26",
            "replies": []
        },
        {
            "author": "Jadty",
            "body": "Destabilization of countries and cultures, just like today.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-03-16 20:46:33",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "Fun times ahead",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:02:29",
                    "replies": []
                }
            ]
        },
        {
            "author": "Croce11",
            "body": "There honestly isn't much of a point to it nowadays. Things would be so much better off if we didn't have massive waves of immigration, at least in my country. Even ignoring the illegals (which just make it 100x worse) we should have a stricter curation of who we decide to let in. This way we keep the power of an employees contract in the hands of the employee and not the employer who can just see you as easily replaceable. This way we need less food to sustain our lifestyles. Our healthcare systems won't be so busy. It would be so much easier to find a place to live.\n\nIronically one of the best things to happen to Europe in the middle ages was the black death. After all the \"purge\" the people left had an incredible boost to their quality of life. That's something we could be enjoying right now without the whole \"holy crap there's a high deathrate pandemic wiping us out at random\" if we did a better job at controlling birthrates and immigration. We naturally do already have a negative birthrate but immigration just fucks that all over. And it's the worst kind of immigration too.\n\nThe kind that doesn't assimilate into the culture. The kind that refuses to learn our language. Several decades ago this wasn't nearly as big of a problem, people would be proud to be a part of this country whether or not they were born in it. They saw living here as the privilege it should be. Like if I ever move to Japan or Finland or something... I'm gonna go learn the language. I'm not going to want to be seen as an outsider. I'll respect the culture and societal norms to the best of my ability. Otherwise why am I there?\n\n[https://financialpost.com/news/economy/what-is-population-trap-how-do-you-get-out](https://financialpost.com/news/economy/what-is-population-trap-how-do-you-get-out)\n\nLike Canada, basically we're screwed. We need mass deportations. At least spread these people around to countries that need them.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-03-16 21:35:41",
            "replies": [
                {
                    "author": "MaximumZer0",
                    "body": "That's a weird stance to have, considering that I don't see you typing in Ojibwe, Navajo or Yupik.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-17 01:08:59",
                    "replies": []
                },
                {
                    "author": "Diatomack",
                    "body": "Yeah, as a European, its scary\n\nI said somewhere in this thread about the black death and how it benefitted the common people\n\nFrom a friend who interacts on a daily basis with immigrants here.. She says there are many immigrant men who move here with their family and they learn/speak the language well. Its their wives and the young girls who don't learn or most likely aren't taught the native language.\n\nThey you end up with these women trapped, not knowing the language in the country they live in.\n\nLuckily I know a diverse group of immigrants. Zambians, Afghans, south Africans, who all integrate well. The government doesn't care",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:48:59",
                    "replies": []
                }
            ]
        },
        {
            "author": "nabiku",
            "body": "For unskilled and illegal immigrants, the economy is dependent on their labor. In Texas alone, immigrant labor is a quarter of the state's GDP. Manufacturing and construction are immigrant-led industries, and automation in those fields is decades away. Illegal immigrants contribute more than $30 billion to Texas economy annually, with an additional $6.5 billion in combined federal, state, and local taxes. There is no way to cheaply automate the labor illegal immigrants do. AI will have no impact on food production, construction, hospitality, and other industries that employ illegals. \n\nFor skilled immigrants, specifically H-B1 visa holders, they are set to create an estimated 1.3 million new jobs and add around $158 billion to the US GDP by 2045. Each H-1B visa holder creates 1.83 jobs for Americans. H-1Bs work in STEM industries that can't be efficiently automated.\n\nAnd I don't know if you know much about the education systems of South Korea, Singapore, and Japan, but their level of education is above and beyond ours here in the US. The students in those countries spend most of their time studying. The US might have the best universities, but the majority of our students are not competitive on a global scale. \n\nIf an industry has to lay off workers due to tech advances, those companies will be laying off Americans first. Keep the most prolific workers -- that's just capitalism.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-16 17:49:21",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "That's interesting info, thank you.\n\n>For skilled immigrants, specifically H-B1 visa holders, they are set to create an estimated 1.3 million new jobs\n\nI assume this doesn't matter in this hypothetical scenario where jobs are automated? There doesn't seem to be anything particularly special about STEM that makes it particularly automation proof compared to other fields.\n\n>And I don't know if you know much about the education systems of South Korea, Singapore, and Japan\n\nYes they are wonderful economies to read about. They have among the lowest birth rates in the world but remain economic powerhouses for decades, at least for now anyway lol.\n\n>If an industry has to lay off workers due to tech advances, those companies will be laying off Americans first. Keep the most prolific workers -- that's just capitalism.\n\nAs bad as your education system is in America, you are still better off than most of the world in reality. It's different in the tech industry because you attract the brightest minds in the world. A lot of countries don't have first dibs on these people",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-16 18:04:27",
                    "replies": []
                }
            ]
        },
        {
            "author": "patrick66",
            "body": "Very clearly and obviously climate change. It will be a choice for America to accept large numbers of refugees or be responsible for several hundred million deaths. There’s no third option.",
            "score": 7,
            "depth": 0,
            "timestamp": "2024-03-16 17:11:54",
            "replies": [
                {
                    "author": "thatguy425",
                    "body": "Why only America? ",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:22:08",
                    "replies": [
                        {
                            "author": "Jadty",
                            "body": "Because the powers that be have decided they want to crash this empire with no survivors. They’re engineering an Asian future for the next 500 years. Westerners have proven to be weak and easily manipulatable, getting fat and jumping from [current thing] to [new current thing] without a second thought. We’re already on a steady path to self destruction. The American Empire won’t last another 100 years in its current state.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-03-16 21:04:53",
                            "replies": []
                        },
                        {
                            "author": "damontoo",
                            "body": "I hate this objection to anything good we do. \"Why do we have to spend $x?!\" or \"Why do *we* have to accept them?\" Because we do things differently in America which is why you exist at all. Your immigrant ancestors were allowed to come live here. ",
                            "score": -2,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:37:48",
                            "replies": []
                        },
                        {
                            "author": "patrick66",
                            "body": "Not only America but America is basically uniquely blessed with every resource imaginable and an environment that will mostly become more habitable through climate change",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:56:50",
                            "replies": [
                                {
                                    "author": "thatguy425",
                                    "body": "Do you live in America? Have you been to the Southwest during a heatwave or the mid west during a deep freeze. The only places that may be more habitable is the coast and they are starting  to get pretty full.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 18:50:04",
                                    "replies": [
                                        {
                                            "author": "WhimsicalWyvern",
                                            "body": "The Northeast and Midwest have milder winters than they used to. Sucks to live in the South, though, who are getting more hurricanes in addition to higher temps.\n\nReal winners from climate change are Canada and Russia. Who, coincidentally, both produce a fuckton of oil.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 18:59:09",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "oneeyedziggy",
                    "body": "I think a disturbing number of people are very willing to accept the deaths of strangers in exchange for their own comfort",
                    "score": 11,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:24:36",
                    "replies": [
                        {
                            "author": "Jadty",
                            "body": "Always has been.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-03-16 21:05:46",
                            "replies": []
                        },
                        {
                            "author": "Diatomack",
                            "body": "The Congolese child who mined the cobalt in your phone is cringing at your comment right now",
                            "score": -4,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:30:40",
                            "replies": [
                                {
                                    "author": "oneeyedziggy",
                                    "body": "Do you NOT find that disturbing?",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 19:30:09",
                                    "replies": [
                                        {
                                            "author": "Diatomack",
                                            "body": "No, I don't.\n\nIs it a surprise to you that the entire human experience is built upon the exploitation of others?\n\nWe're stupid apes with a guilty conscience who never seem to learn our lesson.\n\nLive off-grid if you actually want to make a difference.",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 19:39:15",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cellarkeller",
                    "body": "There is no way America will accept hundreds of millions of people in, even if Trotsky is elected as president. The likelihood of that leading to a civil war would almost be 100%, and if there's going to be civil wars they'd want it happening outside of the US borders. ",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:27:42",
                    "replies": [
                        {
                            "author": "patrick66",
                            "body": "I think you are correct about the likely outcome but the choice is real.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:57:30",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Diatomack",
                    "body": "Total nuclear war could be the third option maybe lol. But I seriously doubt that's ever gonna happen (famous last words)\n\nIt's quite exciting how far desalination has come in the past couple decades though.\n\nPeople can live in extremely horrid and desolate areas if they are rich enough to build functioning infrastructure. Hopefully the tech gets cheaper and cheaper",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:19:52",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "They’ll seal those borders so tight air won’t get through, before they let hundreds of millions in.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-17 01:15:41",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": -2,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:17:57",
                    "replies": [
                        {
                            "author": "patrick66",
                            "body": "Overpopulation isn’t real lol",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:55:48",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[removed]",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 17:58:55",
                                    "replies": [
                                        {
                                            "author": "patrick66",
                                            "body": "I mean your racism aside, yes lots of places could use better infrastructure, but the planet is objectively not overpopulated",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2024-03-16 18:00:54",
                                            "replies": [
                                                {
                                                    "author": "Jadty",
                                                    "body": "There’s no racism here.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-16 21:06:43",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Deleted",
                                                    "body": "[removed]",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-16 18:02:48",
                                                    "replies": [
                                                        {
                                                            "author": "patrick66",
                                                            "body": "Yes. Nuke the entire island. Now the trade deficit is zero and your non-sequitur is eliminated",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-16 18:17:21",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "I_Am_Mandark_Hahaha",
            "body": "Fount out recently. The percentage of people who migrated from a different country - less than 4% of the world's population. \n\nOur perception of the \"immigration\" issue may be overblown.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-16 18:01:54",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "That’s extremely misleading when the costs and benefits of immigration are primarily localized.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-03-16 18:07:16",
                    "replies": [
                        {
                            "author": "beaucoup_dinky_dau",
                            "body": " I live near Texas which has a huge influence on everything around me and it is really one of the fast growing regions, money and people just pour in and out of Texas, it's like the land of opportunity.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2024-03-16 18:53:29",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "cool, now narrow it down to the western world. 21% of global immigrants go to North America and about 30% go to Europe (I can't say if this includes EU immigrants who go to other EU countries). that means HALF of global immigrants end up in Western countries. this doesn't even include Australia, a major hub for immigration. now in terms of what percentage immigrants make up in some major Western countries: 13.6% in the US, 17% in Germany,  20% in Canada, 29.5% in Australia. it's hard to even say if this calculation accurately releflects the true amount of undocumented immigrants in each respective country. \n\nlong story short, you need to brush up on statitistics and how to interpret them",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-03-16 19:08:11",
                    "replies": [
                        {
                            "author": "I_Am_Mandark_Hahaha",
                            "body": "So 21% of 4% of world population immigrate to North America. That's less than 1% of world population. You need to brush up on percentages.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-03-16 19:13:48",
                            "replies": [
                                {
                                    "author": "I_Am_Mandark_Hahaha",
                                    "body": "Here's another metric. The US accounts for 25% of the world GDP. That's 1/4 of all the wealth in the world. The US population is only 4.25% of the world population.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2024-03-17 01:38:16",
                                    "replies": []
                                },
                                {
                                    "author": "Deleted",
                                    "body": "Ok, I’ll bite. 30% of global immigrants go to Europe, which accounts for less than 3% of the world population and 21% go to North America, which accounts for 7.5% of global population. Immigration is an issue that disproportionately affects the western world. Who cares if immigrants make up a small proportion of global population? I’m focused on the West and how it’s affected.\n\nI don’t understand your line of reasoning. ",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-03-17 01:31:25",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Keening99",
            "body": "Pursuit of love and a better life and all it entails. Exploration. You name it. Same reasons as today. Some people just seek a new start in life.\n\nIt's a human instinct to be curious and seek the unknown.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-16 17:35:18",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "The biggest reason is to get a job with a higher salary. And then either bringing your family with you or sending regular payments back home.\n\nMost countries don't want immigrants unless they are coming over to work.\n\nWhen the jobs are gone that kind of goes out of the window.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:39:55",
                    "replies": [
                        {
                            "author": "Keening99",
                            "body": "If nobody has to work. I think the sentiment on immigration will shift. Don't you?",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-03-16 22:33:04",
                            "replies": [
                                {
                                    "author": "Diatomack",
                                    "body": "Hmm.. Yeah, I guess so",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 22:40:53",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "GhostHound374",
            "body": "We will never be able to automate all jobs. As far as design thinking goes, this is a physics problem, not an engineering one.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-16 20:13:07",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "I don't understand what you mean, sorry?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-16 20:17:39",
                    "replies": []
                }
            ]
        },
        {
            "author": "angelkrusher",
            "body": "What a bizarrely limited viewpoint question.\n\nIt sounds like OP just hasn't thought this through.\n\nIf you think immigration is only for jobs then it's time to go do some studying buddy. Yikes.\n\nWell at least he's asking a question and not just trying to stuff it down people's throats.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-16 20:34:50",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "Thanks for being open minded. I have clear opinions, as do you. I probably should have made it clearer in the post: I don't care about race, gender, sexuality, etc.\n\nI want AI to make this world more equal.\n\nThat said... I will not give up women's rights. Personal autonomy, abortion, or otherwise.\n\nSame with sexual minorities. They have the right to express themselves. I refuse to lose their rights. It's taken centuries to get here, and now we're willing to throw it away?\n\nI'm worried about the growing portion of immigrants in my country who don't support these things. I understand certain places have different views. But I don't want our culture and belief system to die. There has been to much blood spilled to reach the equality we have.\n\nIt doesn't necessarily impact me but many of my friends are threatened.\n\nI tell them, look at Stephen Fry's interviews. Look at the videos of gay hangings in Iran.\n\nSome of them don't see the threat, but I do and I won't let them down.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 20:55:23",
                    "replies": [
                        {
                            "author": "angelkrusher",
                            "body": "History is your friend. I get what you're saying, but it's also incredibly unrealistic to a certain degree. Immigration isn't the only thing that breeds change, technology, viewpoints, war, all of that.\n\nJust the essence of you saying that you don't want things to change means that you're already setting yourself up for ideological failure.\n\nLife is the opposite. Things change, while yes cultures and values can be constant over generations or so but they are usually altered as they go along.\n\nIt's your job to teach yourself this stuff not somebody on reddit. Put it in the work.\n\nConservative views are great until it absolutely works against you. Think of all the dim-witted Republicans running around the United States talking about they want classic values even though most of that classic value was rooted in racism fear guns and pure stupidity.\n\nBe careful what you wish for you just might get it.  Cheers",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 16:02:54",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mhornberger",
            "body": "People will still seek immigration for culture, novelty, food, human rights, curiosity, climate, experience.  And people would be motivated to accept immigrants due to culture being porous and syncretic, getting different voices and points of view, art, food, and just human receptivity to interaction.   And with strong automation, immigrants aren't \"taking our jobs,\" nor is housing a problem because you can automate construction, and of course build a lot more density, plus mass transit, all kinds of things.  \n\nNot everyone fantasizes about a sealed-off ethnostate.  Let me say that again:  not everyone fantasizes about a sealed-off ethnostate.  Though those that do often mistakenly believe everyone else thinks like them, or that their intuitive position is 'common-sense.'",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-17 04:58:16",
            "replies": []
        },
        {
            "author": "sleepcurse",
            "body": "What’s the point of accepting millions of them now? Honestly",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-03-16 16:59:45",
            "replies": [
                {
                    "author": "clownpilled_forever",
                    "body": "sshhhhh you can't say that",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:08:53",
                    "replies": [
                        {
                            "author": "sleepcurse",
                            "body": "I know it’s Reddit :) \n\nI can’t illegally enter a different country and jump on assistance for rest of my life.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:25:12",
                            "replies": [
                                {
                                    "author": "chargernj",
                                    "body": "Can't do that in the USA either.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-03-17 11:50:30",
                                    "replies": []
                                },
                                {
                                    "author": "PA_Dude_22000",
                                    "body": "Agreed, and contrary to certain parties opinions on the matter, you can’t do that in the US either.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 21:57:07",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Diatomack",
                    "body": "To drive down wages. Bigger pool of workers, so more competition. Keeps pay lower. But that doesn't matter at all when automation becomes cheaper than a human worker",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:01:55",
                    "replies": [
                        {
                            "author": "RobotToaster44",
                            "body": "You're getting downvoted, but Engels wrote exactly this over 100 years ago.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:42:45",
                            "replies": [
                                {
                                    "author": "Diatomack",
                                    "body": "He did.\n\nIts been well known for centuries. The Statute of Labourers came into effect immediately after the black death wiped a third of the population out of existence in England.\n\nIt has been one of the only times in history where the elites were genuinely vocally shocked by the power shift from the upper classes to lower classes.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 17:53:07",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sleepcurse",
                            "body": "Sounds awful",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:03:56",
                            "replies": [
                                {
                                    "author": "Diatomack",
                                    "body": "It gets worse when you add the failure of multiculturalism.\n\nMy country has entire sections of cities that are by and large comprised of a single ethnic group that don't really mix with others.\n\nSame thing happened when Russians fled en masse to certain parts of SEA to avoid conscription and created \"white only\" beaches and areas ffs.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 17:14:06",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "oneeyedziggy",
                    "body": "What's the point of not? If America is so great, why not accept as many of the worlds citizens asvwe can manage... Let the backwaters collapse... They can't be much trouble if everyone who's not happy with the status quo leaves... Dictatorships are built on the backs of peasants. Let the warlords grow their own food and run their own government and dig their own ditches and see how long they last. Meanwhile we get all the best people...    \n\n\nUnless you're just a shit head who thinks only white people have value.\n\n\nEdit: seems like there are a lot of people who disagree can't form a coherent argument against me",
                    "score": -8,
                    "depth": 1,
                    "timestamp": "2024-03-16 17:29:32",
                    "replies": [
                        {
                            "author": "sleepcurse",
                            "body": "Have you ever seen the amount of debt America has? \n\nNo other country has open borders. We are being flooded with people that will never work or contribute to society here. On top of that there are criminals flocking in from all over the world and if you think that’s not the case you are braindead and brainwashed.\n\nEdit. Caught the part about white people value. I don’t see immigrant flooding non-white countries so white people must be doing something right.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-03-16 17:43:18",
                            "replies": []
                        },
                        {
                            "author": "Pale_Possible6787",
                            "body": "Why would we want to let our own countries collapse",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-03-17 09:36:56",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Rocketsloth",
            "body": "Eventually, environmental degradation will drive huge masses of people away from the equatorial zones, they will seek habitable zones northward. It will make northern zones retreat from the current coastlines. It's inevitable.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 17:11:16",
            "replies": []
        },
        {
            "author": "veinss",
            "body": "When jobs are automated and resources are distributed based on need people will finally be able to live together with like-minded people instead of being supposed to assimilate into whatever culture they happened to be born around. Also if indoctrination of children into things like religion is banned and prosecuted then a lot of people might decide to immigrate at 18 or whatever the adult age is in order to live around their chosen religion.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 17:42:54",
            "replies": []
        },
        {
            "author": "Photofug",
            "body": "Tax base for government, since the corporations aren't going to pay any more tax for less workers ",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 17:52:22",
            "replies": []
        },
        {
            "author": "jaymick007",
            "body": "Housing, lots of money for the well connected to make.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 18:27:29",
            "replies": []
        },
        {
            "author": "sh00l33",
            "body": "it is worth considering whether mass automation, which deprives most of society of any resources, will not result in emigration to countries that have introduced certain restrictions in order to protect jobs for their citizens.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 18:39:36",
            "replies": []
        },
        {
            "author": "-AMARYANA-",
            "body": "The world will be more about migration than immigration from here on out. Just look closely around you now. The world order is changing and nobody knows exactly what happens next.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 20:28:14",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "The population is concentrating in the global north",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 20:32:27",
                    "replies": []
                },
                {
                    "author": "Jadty",
                    "body": "They got this shit planned for the next 50 years. You and I maybe don’t know, but those moving the pieces know EXACTLY what they’re doing.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:13:05",
                    "replies": [
                        {
                            "author": "-AMARYANA-",
                            "body": "I’ve been playing chess since I was 10. Beat my father and uncle days after they taught me how to play. They got their plans. I got my principles. Fortune favors the bold.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 00:28:45",
                            "replies": []
                        },
                        {
                            "author": "Deleted",
                            "body": "[deleted]",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 04:29:55",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "malsell",
            "body": "Increased standard of living would be a huge motivation for a lot of people. Even if we got to a point of Star Trek synthesizers and basic income, some countries are just going to be better off than others",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 20:40:26",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "The two aren't in the same time frame.\n\nImmigrants will flock to places with good job opportunities, freedom and security.\n\nIt will take decades for \"all\" jobs to be automated. The amount of legal framework for some industries would take years minimum to apply. \n\nI would also find it hard to have automation robots to be cheaper than a human for more complex environment.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 20:45:43",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "Yeah that's fair enough.\n\nBut it won't need anywhere near 100℅ automation to have a dramatic impact on the economy as it stands now\n\nMany of our jobs will be safe, many won't.\n\nBut those who lose their jobs will now be competing with those in the remaining jobs",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:01:17",
                    "replies": [
                        {
                            "author": "shponglespore",
                            "body": "If trends continue, we will need to either provide for people's needs without expecting them to work, or find out what happens when a ton of people with nothing to lose decide to spend their energy trying to kill the people who would watch them starve.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-16 21:43:18",
                            "replies": [
                                {
                                    "author": "Diatomack",
                                    "body": "I hope things will be ok.\n\nLike we looks after kids, disabled guys and the elderly.\n\nThe vulnerable in our respective countries come first before anyone else.\n\nBut.. \n\n>when a ton of people with nothing to lose decide to spend their energy trying to kill the people who would watch them starve.\n\nThis will be captivating to watch",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-16 21:52:20",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NVincarnate",
            "body": "Immigration in itself is the point. Cultural diversity doesn't just fall outta the sky, y'know.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 20:56:46",
            "replies": []
        },
        {
            "author": "ReasonablyConfused",
            "body": "Along these same lines, what is the point of all the poors in your country or outside?",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 21:07:25",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "Individual countries have a responsibility to care for those within their borders. \n\nDisabled, elderly, children, etc...\n\nRegardless of where they come from.\n\nAt least in my city I know for a fact we have enough social housing to support our homeless population. \n\nUnfortunately like most of the world we just put zero money into mental health support so these guys end up on the streets anyway when they don't fit into the mould.\n\nAnd every year, more children go hungry, more disabled people without social welfare... Fucked up",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:14:38",
                    "replies": [
                        {
                            "author": "ReasonablyConfused",
                            "body": "That’s a nice perspective. I worry that most social safety nets are there to keep the workforce mostly intact. A workforce that is currently needed because labor is needed. Remove that need and I believe that the current crop of the mega rich would support political candidates that would remove these safety nets. \n\nA step further would be for the mega rich to decide that it is unnecessary to keep such a population around at all.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 00:18:53",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bohba13",
            "body": "because not every job can be automated. _someone_ has to keep all the bullshit running. after all, our banking system is held together by ducktape, Fortran, and hope.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 21:53:09",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "Lmao\n\nYeah that's accurate.\n\nI love how good we are as a species to keep things running just enough to work",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 21:56:12",
                    "replies": [
                        {
                            "author": "bohba13",
                            "body": "yup. Automation is simply another tool in the bag for us to do that.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-16 23:48:14",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kamomil",
            "body": "Even if we have automated jobs, and need fewer employees, corporations will still need customers to buy their stuff.\n\n\n\nOrdinary citizens enjoy their families better when they have the number of children that they want. That often means 1 or 2, or no children at all.\n\n\nCorporations don't care about citizens' quality of life, so they lobby the government to increase immigration. \n\n\nWe need the government to regulate corporations so that they do not behave like energy & money vampires, to the population of the country ",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 22:17:32",
            "replies": []
        },
        {
            "author": "SharkBubbles",
            "body": "We will have machines picking fruit for us and doing other farm labors? Immigrants contribute a lot to our economy, and they don't ask for much in return. We can manage to keep humans occupied despite automation in the workforce.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 22:20:07",
            "replies": []
        },
        {
            "author": "Pleasant_Ground_1238",
            "body": "I am convinced that immigration as a problem is solved with a quite universal passport: the right hand palm (handprint biometrics of next-day). We have to agree that the word \"spurrious\" is poorly understood and usually confused with the English words \"useless\", \"futile\", \"superfluous\" and \"meaningless\". If that was more real would likely be also more semantic. I need: phones can call me to a chatbot of choice Google/Microsoft/Meta/OpenAi/Claude/Apple. I need fridges/refrigerators and fridgemakers making their machines able to extract drinkable water out of thin energy with some of our mechanical/kinetic energy. I would ban indirect payments (old bartering payment systems in some jurisdictions because they seem highly illegal, unvialble, and connected to will for non-accountability and no will for digital or printable payment receipt. We, by difenition are human: designed to be happy and make everyone and us all happy ;-) Miss? At at your elevel I would pass some milestones in such an exam/testing. You say,",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 22:55:32",
            "replies": []
        },
        {
            "author": "Strange-Scientist706",
            "body": "Well, there will always be Star-bellied sneetches, and there will always be non-star-bellied sneetches. If the non-Star-bellies sneetches wish they had stars on their bellies, then the Star-bellied sneetches will pay the non-star-bellied sneetches pieces of stars to do the things they don’t want to do. So the non-star-bellied sneetches will emigrate to the star-bellied sneetches beaches to get the stars.\n\nThat’s the point of immigration.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 23:13:03",
            "replies": []
        },
        {
            "author": "spacejockey8",
            "body": "Politicians still need voters. Robots can’t vote yet.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 23:29:59",
            "replies": []
        },
        {
            "author": "JohnTM3",
            "body": "The birth rate in this country (USA) is down. If it weren't for immigrants, the population would be declining.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 23:37:36",
            "replies": []
        },
        {
            "author": "HolyRamenEmperor",
            "body": "From the nation's perspective, there are often cultural and economic benefits from accepting new members.\n\n\nFrom the immigrants' perspective: politics, violence, gangs, wars, climate and climate change, hunger, education, health and healthcare, the culture, the marketplace, family.... Work/income isn't the only reason to relocate.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 23:52:09",
            "replies": []
        },
        {
            "author": "Big___TTT",
            "body": "We’ve still got decades with the need for cheap labor.  It’s not like in 5 years we’re going to be living in a sci fi world of robots",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-17 00:03:23",
            "replies": []
        },
        {
            "author": "Agious_Demetrius",
            "body": "Thankfully no. Bring on the bots. Can’t wait for robo-tradie. Might get a decent price for your home renovations.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-17 02:38:30",
            "replies": []
        },
        {
            "author": "Lharts",
            "body": "There already is no point.  \nNo country on this planet needs immigration.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-17 02:50:40",
            "replies": []
        },
        {
            "author": "RexInvictus787",
            "body": "It is well established that the further left on the political spectrum you go, the less children you have. This spells disaster for any left leaning political party in a country that relies on popularity contest to pick the government. There will always be a political necessity for the platform of “come to our country and we will give you free stuff, but don’t vote for the other party because they won’t.”\n\nI concede that was dramatically oversimplified.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-17 04:27:26",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Poverty. \n\nAutomation will help the very rich and leave many people very poor.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-17 08:50:22",
            "replies": []
        },
        {
            "author": "Ok_Donut_1043",
            "body": "I think you are asking what the point of letting people in would be over what the reasons for them coming are? You know, because it has always been possible to line up job categories that experience high demand with foreign labor. Companies just say that those foreign workers have skills that your people don't. \n\nIt's not crooked on its surface. It only gets that way when you consider how companies in certain industries get away with not offering anything like a real wage to locals, then dangle the reality of coming to America at any wage before a foreign worker. \n\nCovid showed that out. It happened down the road at this huge ski resort. They used not to try and pay more than $12 an hour. They relied heavily on J1B's ,or whatever those visas are called. Then Covid hit, and their corporate minimum wage is now $20. \n\nIt had to, or in the new world no one would work for them. Fortunately, the company realized that ahead of the curve and responded with a wage increase before there was too much of a fight. Because, you know, unions. Above all, they don't want unions.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-17 15:25:38",
            "replies": []
        },
        {
            "author": "Awkward_moments",
            "body": "It more to keep house prices high, GDP going up (not GDP per capita) and to keep wages low. \n\n\nIf the government actually wanted certain types of workers they would pay for it or make business pay for it.  \n\n\nBusinesses always look for employees with 5 or 10 years experience so they can get in cheap labour below market rate. They never look for 0 years experience to train them up or pay enough to convince people into that industry.\n\n\nAnd governments never do anything about the hosuing crisis because the people in business own houses and benefit from the crisis so do their donors, also the old. This last one is the one that does it for me, my parents (and their gen) who own a house have no interest in anything that would benefit their children getting a house. Because it would either make imaginary numbers go down or would bring more people (like their childre ) into the area.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-17 17:00:51",
            "replies": []
        },
        {
            "author": "GhostCheese",
            "body": "people emigrate because they want to either enjoy the place they move to or escape the place they move from.\n\nif all work is automated then there would have to be some other way to improve your life in the land of automated labor otherwise people would not even want to emigrate. \n\n&#x200B;\n\nthey only want to come to the US because there is hope at an improved life.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-17 19:17:00",
            "replies": []
        },
        {
            "author": "Mediocre-Ebb9862",
            "body": "This sub is truly a doomeristic place where people keep fearing stuff that will never happen, or will happen 300 years from now.\n\nAll jobs are automated? Seriously?",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 19:08:42",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "AI will be the best thing that happens to our species",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-03-16 19:15:52",
                    "replies": []
                }
            ]
        },
        {
            "author": "Berenstain_Bro",
            "body": "immigrants (people) might wanna be athletes, musicians, fashion models, actors... *those jobs are gonna be automated by robots?*",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 20:17:31",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "Assuming your comment isn't a joke..\n\n>fashion models, actors...\n\nThose two, for sure will and should be automated\n\nMost celebrities are even more shallow and self-centered than us redditors.\n\nModels are already 50℅ Photoshop, and A-list actors are shitty people.\n\nMusicians, I do think will be. Chart music will probably be automated. Chart music is some chemically produced crap.\n\nLocal musicians performing live music will never go away.\n\nAthletes won't either. But there will always be the debate with doping. And prosthetic limbs, as they get better. Oscar Pistorius comes to mind. What a shit",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-03-16 20:28:56",
                    "replies": []
                }
            ]
        },
        {
            "author": "kykyks",
            "body": "immigrants are for the most part not simply looking for jobs.\n\nthey look for survival.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-16 23:40:46",
            "replies": []
        },
        {
            "author": "SnoMan_O0o",
            "body": "More bodies for the war machine. Just chew through them, cast them aside, and move on to the next loser.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-17 00:14:02",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "The point wasn't just to get jobs in the first place. Most people immigrate to escape their current situation. And that will remain the same after automation.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-17 01:52:03",
            "replies": []
        },
        {
            "author": "cosmicr",
            "body": "Immigration drives the economy. People come and spend money, buy houses, pay rates etc.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-03-17 00:29:59",
            "replies": []
        },
        {
            "author": "alemorg",
            "body": "There is a population crisis in the eu and they definitely need residents to maintain growth otherwise their society would collapse without younger generations.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-03-17 03:16:19",
            "replies": []
        },
        {
            "author": "in20xxdotcom",
            "body": "Immigration often brings brain power. I think when most jobs are automated, we will still decision makers, planners, and objective setters.",
            "score": -1,
            "depth": 0,
            "timestamp": "2024-03-16 18:01:22",
            "replies": []
        },
        {
            "author": "I_MakeCoolKeychains",
            "body": "I would still immigrate to improve my chances of finding a new wife. The dating pool around here especially those my age, are nasty disloyal people. At this point I don't have any friends from before I was 25 because they all suck the life out of everything. \n\nIf I move somewhere else with more women and less men and less of a \"take everything personally and create drama constantly\"attitude I can actually relax and find a decent woman who doesn't just want me for money or muscles",
            "score": -1,
            "depth": 0,
            "timestamp": "2024-03-16 18:03:20",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": "Good luck with that.\n\nYou stand out, you have to be attractive, have a nice personality, or be charismatic. All good traits that will attract partners no matter how small the dating pool is.\n\nBarring that, you need to be rich.\n\nSo yeah, money or muscles can both be important traits no matter where you are in the world.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-16 18:15:43",
                    "replies": [
                        {
                            "author": "I_MakeCoolKeychains",
                            "body": "That was not what I was saying. You're making the assumption I can't find a date, I can and have never had trouble in that department. I don't like the women that live here. I see it all across the city everybody just dating and dumping each other or just settling for someone just to avoid loneliness even when they don't like them",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-03-16 18:21:48",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dglp",
            "body": "Immigrants will be needed to do the thinking that nativists are proving themselves unable to do.",
            "score": -4,
            "depth": 0,
            "timestamp": "2024-03-16 18:33:35",
            "replies": [
                {
                    "author": "Diatomack",
                    "body": ">Immigrants will be needed to do the thinking that --nativists-- are proving themselves unable to do.\n\nNo, that's just people in general. Every country has proven they can't learn from the past and give in time and time again to their primitive human desires.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-03-16 18:40:23",
                    "replies": [
                        {
                            "author": "dglp",
                            "body": "That means immigrants are needed, to save people from themselves.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-17 12:41:28",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pvm_Blaser",
            "body": "The same as it is now for the large part: goodwill. Especially in the US, we’ve been in a “need to save the world” mode for a long time now.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-03-16 19:18:39",
            "replies": []
        }
    ]
}