{
    "post_title": "Why we need more Women in AI",
    "post_timestamp": "2023-11-30 14:42:46",
    "last_comment_timestamp": "2024-12-12 17:30:17",
    "time_difference": "378 days, 2:47:31",
    "comments": [
        {
            "author": "gut-brain-axis",
            "body": "We do but we also need to give women a break from fixing things all the time. It's not our fault we were excluded to begin with and not our responsibility to fix.",
            "score": 68,
            "depth": 0,
            "timestamp": "2023-11-30 16:00:20",
            "replies": [
                {
                    "author": "purple_paramecium",
                    "body": "Yes, thank you. I’ve decided that my ultimate goal in life is to be a shining example of a woman in STEM who is perfectly fine at my job—And that’s the end of it. Women are constantly being pushed to mentor, and lead teams, and sit on boards, and do outreach, ad infinitum.  But you better ALSO be some kind of technical wizard, otherwise men lose respect for you for not doing the real work. \n\nWhereas **nobody gives a shit** if a man just does his basic job everyday and never does any extras like committees, mentoring, etc. Nobody is disappointed that a man is merely competent and not some technical unicorn. \n\nCan I just do the part I like? (Ya know, the STEM?) And leave me alone otherwise?",
                    "score": 43,
                    "depth": 1,
                    "timestamp": "2023-11-30 22:55:03",
                    "replies": [
                        {
                            "author": "gut-brain-axis",
                            "body": "Yes!!! This. Let me write code and let some dude do the D&I committee and outreach nonsense.",
                            "score": 11,
                            "depth": 2,
                            "timestamp": "2023-12-01 00:21:31",
                            "replies": [
                                {
                                    "author": "shapelessdreams",
                                    "body": "Sadly for juniors this will mean more discrimination and difficulty with mentorship. It feels like a catch-22",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2023-12-01 12:27:23",
                                    "replies": [
                                        {
                                            "author": "gut-brain-axis",
                                            "body": "That's not really our problem. If it doesn't get done if women don't do the work there is clearly a lack of accountability at the places where it matters. We can't expect women to always do this work. We're already in the minority. Let men pick it up this time.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2023-12-01 18:45:46",
                                            "replies": [
                                                {
                                                    "author": "shapelessdreams",
                                                    "body": "My point is that they won’t unfortunately. Hence the damned if you do damned if you don’t catch-22.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2023-12-01 19:13:42",
                                                    "replies": [
                                                        {
                                                            "author": "gut-brain-axis",
                                                            "body": "Not really because if juniors aren't supported that is not our problem or responsibility. It sucks for everyone not just for women. We need to start holding men equally accountable for caring about this stuff.",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2023-12-01 20:04:54",
                                                            "replies": [
                                                                {
                                                                    "author": "shapelessdreams",
                                                                    "body": "Ok. I’m just saying they won’t be accountable because they have no one to be accountable to.",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2023-12-01 20:18:29",
                                                                    "replies": [
                                                                        {
                                                                            "author": "gut-brain-axis",
                                                                            "body": "I would hope they would be accountable to themselves and their values. Simply being a good person.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2023-12-01 20:24:39",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "beepbooplazer",
                            "body": "Yep. I went hard on leadership and outreach when I was an undergraduate. I still give back sometimes in limited capacities, but otherwise I’m done. I’m here to do technical work, get paid, and go home. Not save everyone.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2023-12-01 00:24:25",
                            "replies": []
                        },
                        {
                            "author": "snotsnack",
                            "body": "I forget where I heard it first but I've been calling this \"breaking the glass floor\" when you can be celebrated for mediocrity as much as a man",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2023-12-01 05:11:53",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ruebzcube",
                    "body": "In theory I agree but in reality how else will things get done",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2023-11-30 21:11:41",
                    "replies": [
                        {
                            "author": "gut-brain-axis",
                            "body": "They won't. Not our problem.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2023-11-30 21:24:27",
                            "replies": [
                                {
                                    "author": "Fun_Mathematician_73",
                                    "body": "Incredibly based",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2023-12-01 00:18:25",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Commander_in_Queef1",
                            "body": "With time and being highly compensated.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-12-02 22:04:02",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "clover_heron",
                    "body": "\"oh wow you overlooked an obvious problem for years because you lack insight and are insufficiently educated in an area you have chosen to devalue? Huh.\"",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-03 11:17:41",
                    "replies": []
                }
            ]
        },
        {
            "author": "fer-nie",
            "body": "Every time women in AI comes up it reminds me of this woman.\n\nhttps://www.nytimes.com/2020/12/03/technology/google-researcher-timnit-gebru.html\n\n\"Google Researcher Says She Was Fired Over Paper Highlighting Bias in A.I\n\nA well-respected Google researcher said she was fired by the company after criticizing its approach to minority hiring and the biases built into today’s artificial intelligence systems.\n\nTimnit Gebru, who was a co-leader of Google’s Ethical A.I. team, said in a tweet on Wednesday evening that she was fired because of an email she had sent a day earlier to a group that included company employees.\n\nIn the email, reviewed by The New York Times, she expressed exasperation over Google’s response to efforts by her and other employees to increase minority hiring and draw attention to bias in artificial intelligence.\n\n“Your life starts getting worse when you start advocating for underrepresented people. You start making the other leaders upset,” the email read. “There is no way more documents or more conversations will achieve anything.”\n\"",
            "score": 34,
            "depth": 0,
            "timestamp": "2023-11-30 21:21:13",
            "replies": []
        },
        {
            "author": "Level_Strain_7360",
            "body": "Cool, hire me.",
            "score": 4,
            "depth": 0,
            "timestamp": "2023-12-01 01:14:32",
            "replies": [
                {
                    "author": "ajshicke",
                    "body": "Same!",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-02 16:42:00",
                    "replies": []
                }
            ]
        },
        {
            "author": "LexifromZargon",
            "body": "Ngl im rly interested in ai and gave some ideas id love to research but how do you even get into ai?",
            "score": 4,
            "depth": 0,
            "timestamp": "2023-12-01 01:19:07",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Sorry I am a bit late here, Im a director in tech and my team is knee deep in ai. We had hack week this week and built over a dozen workable tools that will help our company. The best way to get into AI is to first learn everything you can: figure out how it works, know the use cases and where ai is headed. Then, start building things. Whatever you want. You dont even need to learn code if you arent a coder, just how to prompt. Take what you learn and approach your own workplace, linkedin, your network...this can lead to some great connections and opportunities. I was in the dot com era, we are in 2.0 of this now and the earlier you get in, the better. Maybe your own ideas will even turn into a business.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2023-12-02 07:50:17",
                    "replies": [
                        {
                            "author": "LexifromZargon",
                            "body": "Thanks for the advice! ill definetly try it!",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-12-04 04:54:30",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "There is something a little ironic about men telling women what they should be interested in working on, as if they don't know what is important. Are we still really at the point where we have to \"Actively seek out\" women for certain jobs? If we are that's fine, but I kinda think that stage has passed - at least it has for the women I know and work with. You couldn't hold them back from new technology with a team of horses!",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-03 10:57:47",
            "replies": []
        },
        {
            "author": "Single_Vacation427",
            "body": "That post looks written by chat gpt",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-03 18:20:57",
            "replies": []
        },
        {
            "author": "Suitable_Accident234",
            "body": "Highlighting the successes of women in AI offers role models and encourages young women to pursue careers in the field, enriching AI with diverse ideas and innovations. \n\nReference: [https://youtu.be/D5oANROV8X4](https://youtu.be/D5oANROV8X4)",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-07-25 08:49:37",
            "replies": []
        },
        {
            "author": "RevolutionaryHand145",
            "body": "(I'm male) So I just watched this [https://www.youtube.com/watch?v=s36eG\\_ZHmGA](https://www.youtube.com/watch?v=s36eG_ZHmGA) & then went looking for how many women are working on AI. When I heard men go over the ancient \"bigger is better\" theme in terms of AI my head just kind of explodes. There are so many natural qualities women trend into which would help AI it seems crazy they aren't making more decision about the AI models. \n\nWhen I reflect on my mother and father, My dad was all about ensuring we had good Quantity of life factors from money to driving force. However, my mom was major into the Quality of life factors, and still is. She was able to be a stay a home mom who was college educated with a \"English Major\" and believed her degree was going to be useless. Let me tell you, it wasn't. I got a broad education, in home tutor, and a respect for quality classic materials. Even now when my parents are in their 70's she's still driving the Quality of life factor from projects in the house they live in to keeping ties together in the family.   \n\nBig D\\*\\*\\* males who love to throw money at projects was great for AI getting out the door, but all children need  two parents and I don't think this one is any different, in fact I think this one needs both more than any other.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-12 17:30:17",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "This is a very sexist post that assumes women are different than men",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-02 21:55:34",
            "replies": [
                {
                    "author": "infernorun",
                    "body": "They are different. Why do you think there are no women in AI? They choose other careers.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-03 13:57:46",
                    "replies": []
                }
            ]
        },
        {
            "author": "Fearless-Soup-2583",
            "body": "Vast majority of people working on this stuff work on the technical side  or the business side of it - Idk how much improvement having women merely for the sake of it is going to change it - Its extra responsibility on female engineers to be fixing this  - unless you believe there is such a thing as a woman engineer and a male engineer and they differ a lot in their skills when they're in a technical role  - I don't see how this is going to affect it.",
            "score": -4,
            "depth": 0,
            "timestamp": "2023-11-30 18:39:27",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "It's not about skillset; it's about the way ML/AI models are trained.\n\nDiversity in the training dataset is currently necessary to reduce [bias](https://www.media.mit.edu/projects/gender-shades/overview/).\n\nWhat we need is regulation that mandates ethical development standards. I've learned in the tech industry...if a policy is not mandatory (e.g. required by law), it will be ignored.\n\n[https://www.whitehouse.gov/briefing-room/presidential-actions/2023/10/30/executive-order-on-the-safe-secure-and-trustworthy-development-and-use-of-artificial-intelligence/](https://www.whitehouse.gov/briefing-room/presidential-actions/2023/10/30/executive-order-on-the-safe-secure-and-trustworthy-development-and-use-of-artificial-intelligence/)",
                    "score": 16,
                    "depth": 1,
                    "timestamp": "2023-11-30 18:47:43",
                    "replies": [
                        {
                            "author": "Hawk13424",
                            "body": "Pretty sure they just train on internet content. If that is biased then the model will be biased. The engineers involved aren’t filtering the data and hiring more women engineers in AI/ML won’t fix the bias in and of itself self.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-12-03 14:54:30",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "I stated that regulation is what we need: laws requiring ethical development standards.\n\nThe process of preparing data for ML is called \"data cleaning\". The quality of data included in your training, test, and validation sets will impact the accuracy of your model in production. This is why datasets should be diversified.\n\nSee the executive order for more details on basic requirements.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2023-12-03 15:18:26",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Fearless-Soup-2583",
                            "body": "Data Scientists are well aware of the difficulties in this - there's literal techniques to reduce bias in models. At the surface level over sampling,under sampling and some other techniques - but they're present. Being a good data scientist means you possess some of these skills - Social diversity is not the only place you have bias in models - there's other use cases where it is needed - where one category significantly outnumbers the other one - you don't need to hire women specifically for that - it can be done through better data collection - any smart data scientist should ideally be able to tell when a dataset is utterly skewed.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2023-11-30 19:06:07",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "Intelligent people can still be negligent and fail to apply best practices.\n\nI'm sure the people who built computer vision models at well-regarded companies such as Microsoft and IBM did understand ML bias. However, they built models that performed worse on women and darker-skinned individuals.\n\nThe Gender Shades study is just one example of why we need regulatory standards for everyone to follow. When companies develop algorithms that make automated decisions in the real world, affecting real people, there needs to be some standard of fairness, transparency, and safety.\n\nI say this as someone who has worked in that industry for years.\n\n**Edit:** Clarified \"computer vision\" models specifically.",
                                    "score": 9,
                                    "depth": 3,
                                    "timestamp": "2023-11-30 22:25:56",
                                    "replies": []
                                },
                                {
                                    "author": "pommefille",
                                    "body": "But yet, they don’t, and there’s always the problem of *you don’t know what you don’t know*.\n\nSome oversimplified examples: Kodak constantly evolved their film to have better colors, but they based their color systems exclusively on white skin. Medicines did all of their testing for dosage on male subjects. Health trackers consistently lacked period data variables. Crash test dummies came in one size range, and never factored in any disabled people. In all these cases, different genders, races, sizes, and abilities were excluded because the people developing these things had no experience with them and never considered them, so they were fine for average sized white men, but not for anyone else. Why not try to avoid that from the start, and get people who know how biases have impacted them and can think of data in more and more inclusive ways?",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2023-11-30 22:24:29",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}