{
    "post_title": "What do you do when your current skill set is replaced by AI?",
    "post_timestamp": "2023-05-29 21:05:14",
    "last_comment_timestamp": "2023-05-31 04:36:12",
    "time_difference": "1 day, 7:30:58",
    "comments": [
        {
            "author": "MpVpRb",
            "body": "Stop using the word \"replaced\"\n\nA better word is \"enhanced\" or \"augmented\"\n\nLearn. The. New. Tools!",
            "score": 24,
            "depth": 0,
            "timestamp": "2023-05-29 22:55:57",
            "replies": [
                {
                    "author": "Jerry_Williams69",
                    "body": "People said the same thing to blue collar workers when automation swept through many industries.",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2023-05-29 23:49:58",
                    "replies": []
                },
                {
                    "author": "royal_friendly",
                    "body": "I know how to use the current tools available. There are complexities to use though in practice. \n\nFirst, you have legal ramifications of use that have not been sorted out enough. A lot of AI tools have TOS that prohibit commercial use, for one. Yet there are many who use the outputs commercially - how do you compete with others using tools they should not be using, not currently being cracked down on by large companies like Adobe? (Their recent Photoshop beta release which added generative AI includes TOS specifically stating it’s not permitted for commercial use likely due to licensing). \n\nSo as a business owner, the legal risk is a concern. It’s pretty low likelihood that I’d have legal action taken against me but everyone who runs a business feels that way until it happens.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2023-05-30 04:44:56",
                    "replies": []
                },
                {
                    "author": "whiskeydayz",
                    "body": "I wish more people understood this.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2023-05-29 23:32:06",
                    "replies": []
                }
            ]
        },
        {
            "author": "domestic_omnom",
            "body": "You as a photographer will have to learn how to use those tools. \n\nPeople have been saying that AI will replace me as an IT guy. That's not going to happen anytime soon. Same with you. \n\nAll industries are changing. We have to adapt.",
            "score": 17,
            "depth": 0,
            "timestamp": "2023-05-29 21:34:38",
            "replies": [
                {
                    "author": "NoctysHiraeth",
                    "body": "If anything it'll make IT more interesting by streamlining some of the boring and repetitive stuff so I can focus on the hands-on work and complex, interesting issues that I am going into the field for. Hopefully it won't affect the barriers or entry too badly though, because those of us at the bottom are having enough trouble getting hired.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2023-05-29 23:59:45",
                    "replies": [
                        {
                            "author": "RuralWAH",
                            "body": "That sounds pretty similar to what we told office workers in the 1970s about automation. Turns out, there were a lot more office workers than complex interesting issues.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2023-05-30 00:49:47",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 8,
            "depth": 0,
            "timestamp": "2023-05-30 02:02:05",
            "replies": [
                {
                    "author": "royal_friendly",
                    "body": "I largely agree with you. Where I am stuck is in how to start slowly transitioning. All the potential careers that could be transitioned towards require certain qualifications (college degrees, certifications, etc.). I’ve looked at enough recent job listings to see how unqualified (on paper) I am for almost everything - don’t have a certain degree or past job experience. \n\nOn paper this is simple but reality is not so much. How does one find the time (and money) for such a significant overall while running 2 businesses, having a family, etc.? \n\nI’m in this awkward position where I am currently making a living, but seeing these market shifts. I’m not just going to pack in my current livelihood but just anticipate maybe 5 years left before these things start to aggressively dissipate.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-05-30 04:50:44",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "I’ve been in three different careers now myself. You have to adapt or gain a different set of skills. \n\nIf you see the writing is on the wall, then you have no excuse to not start learning new skills now. Every century ends up making previously stable careers obsolete. New jobs will come along, and you can position yourself at the forefront now, if nothing else.",
            "score": 3,
            "depth": 0,
            "timestamp": "2023-05-29 22:49:33",
            "replies": []
        },
        {
            "author": "Snwfox",
            "body": "You won't be replaced by AI in your profession, at least not in the near future. If you are replaced in the near future by anything, it's going to be someone who took the time to learn how to leverage these new tools. People have for a LONG time always been weary of new technology, especially when it disrupts the way they work. Computers for instance. Did some people get put out of work because of them? Yes, but many of those people didn't adapt to the change.\n\nBe the person that learns the new tools.",
            "score": 3,
            "depth": 0,
            "timestamp": "2023-05-29 23:32:44",
            "replies": [
                {
                    "author": "Wittybanter19",
                    "body": "Can’t upvote this enough.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-05-30 04:35:05",
                    "replies": []
                }
            ]
        },
        {
            "author": "Last-Elephant8264",
            "body": "I’m also 33 and a photographer (sports) and worried about the longevity of my job. But not for the reasons you are. \n\nUnless they build robots that can attend weddings and capture beautiful images, candidly and creatively then computers aren’t gonna take your jobs. You can’t replace you and your ability to capture moments with AI. It’ll affect workflow, media marketing and other aspects of it but I wouldn’t worry about loosing your job completely. It will be different maybe and if you are smart and use them it’ll help you rather than hinder you.",
            "score": 3,
            "depth": 0,
            "timestamp": "2023-05-30 04:04:15",
            "replies": [
                {
                    "author": "Wittybanter19",
                    "body": "I work in SEO and content creation, and am currently guiding AI efforts within my company. I understand how simple it seems to connect AI with the elimination of jobs, but nothing I see right now suggests that’s what will happen. The role of writers and producers can shift, and that’s probably the best place to be with all of this. AI can’t produce finished copy or images all on its own. It needs guidance and editing — ironically, just like writers.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-05-30 04:31:31",
                    "replies": []
                }
            ]
        },
        {
            "author": "HAND_HOOK_CAR_DOOR",
            "body": "People are still going to hire photographers to take and edit the photos. Good editing and culling doesn’t mean anything if there are no quality photos left after the culling. Do what you can to streamline your job with these tools.",
            "score": 4,
            "depth": 0,
            "timestamp": "2023-05-29 21:12:39",
            "replies": []
        },
        {
            "author": "Vast_Cricket",
            "body": "You get Bots to replace law makers to make things more efficient and get more output for less.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-05-29 23:39:42",
            "replies": []
        },
        {
            "author": "ABeajolais",
            "body": "I remember Y2K.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-05-30 00:14:27",
            "replies": []
        },
        {
            "author": "Puzzleheaded_Fold466",
            "body": "Learn how to use and implement the tools. The calculator didn’t make mathematics disappear, it made good mathematicians and other quantitative professionals even better.\n\nFind out how these AI applications can make you a better photographer and content creator, and how they can help you outcompete your peers. \n\nAI isn’t your competitor. People are.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-05-30 00:43:12",
            "replies": [
                {
                    "author": "Wittybanter19",
                    "body": "This is a great way to put it. It’s not about AI doing the work, it’s about people using AI to expand their work, much like the calculator did. \n\nLearn how to use it, don’t think of it as a competitor. ChatGPT can create content but it doesn’t do that without very specific and targeted commands. It can’t command itself very well.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-05-30 04:34:42",
                    "replies": []
                }
            ]
        },
        {
            "author": "IronElisha",
            "body": "The problem with AI like Midjourney is that it pulls what it generates from somewhere. While the composition of what it presents may look \"original\", the works it used to generate those images may be copyrighted, patented, or even duplicates of other AI generated art.   \n\n\nAs a photographer, you'll always have a need to have original, authentic work. The problem with AI is that you cannot guarantee with 100% certainty that it will always deliver the result you want. I recently read about a court case regarding several airlines in which one of the researchers for the plaintiff used ChatGPT as a \"source\" for looking up case material to reference. Needless to say, the cases that ChatGPT provided were entirely fictitious and derailed one side of a fairly large court case. The judge was not happy.  \n\n\nEven if you can prompt AI to do something, you'll still need humans to ensure the authenticity - particularly in art - and you'll still need humans making sure that the AI is producing what you expect.   \n\n\nImho I wouldn't be as worried about AI as some people are. Its just an application that is programmed to do a job.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-05-30 01:23:02",
            "replies": []
        },
        {
            "author": "Zestyclose_Shop_9334",
            "body": "if I can no longer afford to live a decent life, I will become a menace.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-05-30 04:35:03",
            "replies": []
        },
        {
            "author": "Left-Car6520",
            "body": "I'd say I'll be a consultant analysing and fixing all the problems introduced by people trying to replace my skillset with AI.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-05-30 05:24:32",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "As you get older, adapting to change becomes harder, as does exercise. The brain and body are subject to all sorts of factors that weigh them down as time goes by, and it can be exhausting to fight the inevitable. But there is no choice in the matter and despite claims to the contrary, there is no way to make it easier. You have to incorporate continuous learning into your repertoire, as much as you have to make yourself go to the gym. \n\nIf you want to remain a photographer, then you have to master and keep mastering all the new techniques and tools and technology and tricks (three T's?) that come down the pike, perhaps taking classes or visiting expos or networking with colleagues, and help drive the field forward, rather than letting others do so. Think instead of the AI adding capabilities / efficiencies / cost savings / artistic possibilities to the field, rather than AI taking something away.  If you embraced the change rather than fighting it, you just might find you have talents you did not suspect. I don't mean to paint a happy peppy people view of things, but use your legitimate worry as a springboard towards action. Good luck.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-05-30 14:16:41",
            "replies": []
        },
        {
            "author": "cool-pants-007",
            "body": "I do NOT think photography will disappear as a profession.  \n\nHow would it take photos of specific houses or people right now? Real estate photography, headshots, weddings, etc \n\nWhat are the new tools to photoshop? I’m curious \n\nI sort of think non-writing skill sets will be safer, btw",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-05-30 15:57:31",
            "replies": []
        },
        {
            "author": "Annual_Ad_1536",
            "body": "You probably have a huge network of people in the wedding industry, why not go into wedding planning? It leverages your design skills and is pretty much immune to AI replacement (any field that involves empathizing with humans in a collaborative creative process involving many interacting components is also immune).",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-05-31 04:36:12",
            "replies": []
        }
    ]
}