{
    "post_title": "Will AI solve poverty like issues or just increase inequalities again?",
    "post_timestamp": "2023-12-17 13:44:00",
    "last_comment_timestamp": "2024-12-06 01:45:06",
    "time_difference": "354 days, 12:01:06",
    "comments": [
        {
            "author": "unlikethem",
            "body": "Solving poverty and increasing inequality are not mutually exclusive. I think we'll have both.",
            "score": 43,
            "depth": 0,
            "timestamp": "2023-12-17 13:52:27",
            "replies": [
                {
                    "author": "sdmat",
                    "body": "The correct answer.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2023-12-17 17:06:34",
                    "replies": []
                },
                {
                    "author": "LevelWriting",
                    "body": "so people will be able to live comfortably but a very few percentage will continue to live in uber luxury?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-18 05:29:40",
                    "replies": [
                        {
                            "author": "GeertCF",
                            "body": "People already live comfortably for the past 40 years or so (if you live in the west)",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2023-12-18 08:34:53",
                            "replies": [
                                {
                                    "author": "LevelWriting",
                                    "body": "lol many in west are still struggling just to afford groceries or heating. You seem really out of touch",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2023-12-18 09:16:56",
                                    "replies": [
                                        {
                                            "author": "Remarkable_You_8721",
                                            "body": "Keep in mind people suffering aren’t making the news or sitting on reddit. They are busy waiting in line at food pantries and drowning in medical bill debt… it’s not documented but i can tell you firsthand people are really struggling at this time all over ",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-27 09:40:34",
                                            "replies": []
                                        },
                                        {
                                            "author": "GeertCF",
                                            "body": "In Europe, 80% of the people do not struggle to afford groceries. The glass is half full or half empty, but you don't need AI to turn this 80% to 100%.\n\n[https://ec.europa.eu/eurostat/documents/4187653/16179938/Vis1-people-without-meals-030723.png/912e2896-0ed7-b6fe-06f2-6750f16943e7?t=1688374380730](https://ec.europa.eu/eurostat/documents/4187653/16179938/Vis1-people-without-meals-030723.png/912e2896-0ed7-b6fe-06f2-6750f16943e7?t=1688374380730)  \n\n\n[https://www.euronews.com/my-europe/2023/07/10/people-in-the-eu-unable-to-afford-a-proper-meal-on-the-rise-eurostat](https://www.euronews.com/my-europe/2023/07/10/people-in-the-eu-unable-to-afford-a-proper-meal-on-the-rise-eurostat)",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2023-12-18 10:23:46",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SgathTriallair",
            "body": "Technology has, over time, increased living standards for everyone in the world. So it will lower poverty if not eliminate it. That doesn't necessarily stop it from making a handful of people exceedingly rich. We should embrace its power to raise the wealth of everyone and then fight the monopolistic trends.",
            "score": 11,
            "depth": 0,
            "timestamp": "2023-12-17 15:16:07",
            "replies": [
                {
                    "author": "mollyran",
                    "body": "And it can also do the opposite which it's what is doing these days.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-31 17:54:00",
                    "replies": [
                        {
                            "author": "SgathTriallair",
                            "body": "It is certainly more visible that Google controls our searches and Amazon has eaten online purchases, but at the same time it's easier than ever to create a competitor to them. We have tons of competition they have to deal with and this forces them to continue working in their products rather than sitting around gathering money. \n\nThe white Silicon Valley model is that a crazy kid with a dream makes some new tech that could have a big impact and then it gets bought up by one of the giants. Yes this can mean that the tech isn't getting released but it is proof that A) you don't have to be rich to make Google scared, and B) Google keeps being forced to transfer wealth to these start ups in order to maintain its position.\n\nRight now we all have access to smart phones and the Internet that allow us more power than we've ever had in history. Having the phones locked down to a small handful of companies is not ideal but the app space is clearly wide open as we constantly have new apps show up from small providers. \n\nThere is both a widening and a narrowing of the economy. The best part though is that we have the capacity to fight that widening (through actions like the recent court case against locked down app stores) while the big companies have almost no tools to keep us from getting empowered. Google doesn't want AI to exist as it is a threat to much of their core business. They can't shut it down though so they are forced to spend billions of dollars to build tools that threaten their ad based revenue model.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-31 18:33:15",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DriestBum",
                    "body": "The the monopolistic trends can't be beaten now, it will only be more difficult when the divide is greater.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-17 20:44:28",
                    "replies": []
                },
                {
                    "author": "floppa_republic",
                    "body": "Was it true that more people had phones than toilets?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-19 11:28:09",
                    "replies": [
                        {
                            "author": "SgathTriallair",
                            "body": "That is what a United nations study said. This is an example of how tech proliferates. A person in Mumbai having a cell phone helps the overall economy because that person can perform services and receive services over that phone. They become a player in the world economy so there is a financial incentive to get phones out to them. Having a toilet is less of an advantage to the world economy so less money is spent distributing it.\n\nAI is much more like cell phones and therefore it will be widely distributed purposely.\n\nHopefully people can use cell phones and AI to get toilets to more people in the world.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-12-19 13:35:19",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nekileo",
            "body": "I believe AI could be used to manage the wastefulness of modern society to redistribute this goods that are usually discarded for people in extreme needs around the world. From connecting people to developing more efficient trading systems. I believe what is needed is just the want to do it.",
            "score": 12,
            "depth": 0,
            "timestamp": "2023-12-17 14:04:48",
            "replies": [
                {
                    "author": "Zelenskyobama2",
                    "body": "Fuk no, I want neoliberalism. Doggy dog world.",
                    "score": -5,
                    "depth": 1,
                    "timestamp": "2023-12-18 00:45:22",
                    "replies": []
                },
                {
                    "author": "DriestBum",
                    "body": "Why would the powers that be treat AI any differently than any other technological innovation? When has new tech ever not been used to gain a competitive advantage?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-17 20:43:12",
                    "replies": [
                        {
                            "author": "Nekileo",
                            "body": "I believe tech has been used for altruistic objectives, while it might not be such a sudden change as many of us would want, tech will grow to be adapted by the whole world, and this means non-profits doing the best they can to help their cause using emerging scientific discovery, the internet is an incredible tool that today is not yet completely globally accessible but efforts are made to make people more connected in areas of low resources.\n\nIf you want to be more theoretical, if AI manages to improve the economic status of humans where most people buy habits are not determined by the cost, maybe people would start supporting companies that uphold humanitarian values, i do believe that if people had the choice, there was the availability, quality and it didn't personally affect them, then they would choose the ethical product.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2023-12-17 21:00:31",
                            "replies": [
                                {
                                    "author": "DriestBum",
                                    "body": "The internet is a great tool, but I block malicious attempts to hijack my webserver weekly, and I get scammers trying to trick my mother out of money from a computer in India. \n\nTools are only tools. The people who weild them  determine the altruistic value of the action of using the tools. 100% of people are not benevolent, and if global unfettered access is given, narafious actors will use them for their gain. \n\nI've seen enough of human nature in my years to know that what you're dreaming up is pure fantasy. \n\nTechnology is only as valuable as the ethics of those that use it. Not everyone wants good. There are a lot of people in this world, if given the opportunity, who wouldn't blink at the thought of eradicating entire groups of people from existence. \n\nDo you think Hamas, having control of a super intelligent technological marvel, would all of a sudden not want all Jews to die?\n\nThe first thing Americans did once they developed the technology behind the atomic bomb, was drop it on two cities in Japan. That's what technology can do. I'm not anti technology, I'm just a realist.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2023-12-18 00:30:53",
                                    "replies": [
                                        {
                                            "author": "Nekileo",
                                            "body": "We don't need 100% of people to be benevolent for good things to be done, non-profit organizations are going to keep existing, the fight for humanitarian values exists and will continue. Horrible actions committed by people using scientific discoveries is something constant on our history, that is why i also don't believe in an unregulated AI, and people owning their own super intelligent AIs is something unforeseeable, but, if an aligned and regulated super intelligent AI is created, i think at least some people will work to allow for the benefits of this technology to reach people who don't even own a technological device. \n\nWe do need to mitigate the possible harmful consequences that AI could bring, and i do think that this is achievable even with a self-serving objective in mind from the different states of power, i hope we don't need catastrophic consequences before we decide to correctly regulate.  \n  \nGood things will be done, and let's hope we have learnt, resulting in fewer bad ones.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2023-12-18 09:53:41",
                                            "replies": [
                                                {
                                                    "author": "DriestBum",
                                                    "body": "How do you propose AGI is regulated? Because right now, there is zero agreed upon, global, regulation. I don't see any way China and America could possibly agree to limit themselves in any capacity while trusting the other side to also limit themselves. \n\nDo you really think that an American for profit company would go out of its way to help a foreign citizen, when it could be instead focusing that effort on making shareholder profit? AGI is going to come from one of the massive tech giants who have the hardware to train a 100T parameter model. It's a matter of having resources to actually train at massive scales. Look at Mixtral 7x8B, that's less than 70B, and it can beat proper 70B models - but training it takes a lot of compute power, even if a Quant version can run locally on a consumer 4090. The corps will have it first, simply because they have the money. They are spending wild amount of money now, they aren't going to give it away for free. \n\nAlso - it takes far less than 0.000000001% of the population to be evil and smart enough to either be inside a Corp working on it, or maliciously gain access to it. That API key better be more secure than nuclear launch codes. It only take a single person with the will to do catastrophic damage to set all of humanity back ages, if not completely wipe us out. If Kim in NK gets ahold of AGI/ASI, I'm sure he won't be using it to feed anyone. \n\nIf a catastrophic, (truly catastrophic) event occurs, there will be no time to correct course. It's game over, for everyone. Matrix style slavery or extinction. \n\nYou keep mentioning non-profits, you know that some of largest scams and money laundering occur through them, right? Being non-profit doesn't = good, automatically. \n\nYou have rose tinted glasses, and are painfully unaware of how global power structures are motivated. They exist to control, dominate, and subjugate. Inequity is a feature, not a bug, for them. Given them super intelligent power is only going to exacerbate an already serious problem.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2023-12-18 23:33:23",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WalkFreeeee",
                    "body": "We already can redistribute stuff right now If we wanted to. We have more than enough resources and capability for that.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-18 07:19:28",
                    "replies": []
                },
                {
                    "author": "IndubitablyNerdy",
                    "body": "Unfortunately a lot of wastefulnes in our system is by design to purposely keep price higher. AI will be able to improve productivity and overall world wealth, but the problem even today, is not how much goods are produced, but its distribution and much likely AI, at least at first, will make that issue worse.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-18 12:20:24",
                    "replies": []
                }
            ]
        },
        {
            "author": "yaosio",
            "body": "As the capabilities of AI increases more people will have to compete for fewer jobs. This will suppress wages for the people who can get a job. Inequality will increase",
            "score": 4,
            "depth": 0,
            "timestamp": "2023-12-17 15:43:30",
            "replies": [
                {
                    "author": "Admirable-Leopard272",
                    "body": "This",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-20 09:07:13",
                    "replies": []
                }
            ]
        },
        {
            "author": "kettlebell_workout",
            "body": "As much as people like to complain. Today, the quality of life of an average person with an average salary is way better than quality of life of the king in 15th century. \n\nIt’s hard to say what AI will do, and how it will do it. But the quality of life on average will improve,  I have no doubt about it.",
            "score": 21,
            "depth": 0,
            "timestamp": "2023-12-17 13:53:35",
            "replies": [
                {
                    "author": "bliskin1",
                    "body": "I think a ton of people who work 40-70 hours a week and are still scraping by(like half of americans) would switch places with 1500s king any day.",
                    "score": 12,
                    "depth": 1,
                    "timestamp": "2023-12-17 15:18:44",
                    "replies": [
                        {
                            "author": "GhostInTheNight03",
                            "body": "They then contract 7 different illnesses and then their kingdom falls apart and then they have multiple different people trying to overthrow and poison them day in day out",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2023-12-17 16:24:14",
                            "replies": [
                                {
                                    "author": "bliskin1",
                                    "body": "Sounds way cooler than being a janitor or sitting in a chair 40 hours a week and worrying about your rent.\n\nYou could always be a benevolent and loved king lol",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2023-12-17 16:38:58",
                                    "replies": [
                                        {
                                            "author": "Super_Pole_Jitsu",
                                            "body": "Dude we're comparing standards of living, not \"coolness\" it'll always be cooler to be the king",
                                            "score": 9,
                                            "depth": 4,
                                            "timestamp": "2023-12-17 17:15:21",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Deleted",
                            "body": ">1500s \n\nA 15th century king would be in the 1400's.  \n\n\nImagine switching places and then dying because you chewed on your nail or cut yourself; while being the poorest person in the US you can walk into an ER and receive modern medical care instead of getting smoke blown up your ass. Yeah.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2023-12-17 17:33:54",
                            "replies": [
                                {
                                    "author": "bliskin1",
                                    "body": "1400s 15000s 1600s whatever. 900.\n\nWell good thing i came prepared. I brought my kindle filled with 100gigs of books and my standard lab equipment pack. Ill pull up the recipe for penicillin.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2023-12-17 17:40:50",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "Better memorize all that shit quick, how long does a kindle battery last? How fast can you write?",
                                            "score": 4,
                                            "depth": 4,
                                            "timestamp": "2023-12-17 17:56:32",
                                            "replies": [
                                                {
                                                    "author": "NotReallyJohnDoe",
                                                    "body": "Just bring a solar panel",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2023-12-17 20:03:22",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "justpointsofview",
                    "body": "Very good point, kings just a couple of centuries ago payed fortunes for just a few kilos of sugar. We take for granted so many things that we have that were unimaginable just a few centuries ago.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2023-12-17 14:53:29",
                    "replies": [
                        {
                            "author": "ApexFungi",
                            "body": "Just because resources were a lot scarcer back then does not mean they had it worse. You can be happy with very little. What makes today's society so bad is the stress. Majority of people are living paycheck to paycheck, and very little hope that their circumstances are going to improve. At least back in that day you had a shack you could call home, most people can't even afford that now and have to rent if they can find an affordable place.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2023-12-17 15:16:09",
                            "replies": [
                                {
                                    "author": "justpointsofview",
                                    "body": "If you would have to live on the basic foods today, that were a scarcity a few hundred years ago, like flour, sugar, sunflower oil you can do it with 100$/€ per month, no electricity, no smartphone, no nothing. Anyone can have that lifestyle from a few centuries ago.\n\nAll we will need to do is to work for 2-3 months per year and then live in a remote cheap village without any utilities. \n\nWe have more stress because we want all the good stuff in life. There is a price for all this comfort but it's not that big of a price and noone returns to that lifestyle. Also stress it's managed differently by people, not everybody is stressed out for the next day the same way.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2023-12-17 15:25:49",
                                    "replies": [
                                        {
                                            "author": "TheSunflowerSeeds",
                                            "body": "Delicious, nutty, and crunchy sunflower seeds are widely considered as healthful foods. They are high in energy; 100 g seeds hold about 584 calories. Nonetheless, they are one of the incredible sources of health benefiting nutrients, minerals, antioxidants and vitamins.",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2023-12-17 15:26:05",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "QD1999",
                    "body": "Except the average, modern person barely has anything and works endlessly paycheck to paycheck with limited money for emergency funds if anything bad happens and generally a lack of time to explore hobbies properly.\n\nDownplaying people's current, modern situations with comparisons to the past seems a bit irrelevant. Quality of life includes happiness and health, most people statistically aren't healthy and we have a global mental illness crisis.\n\nI'm not sure if you are trying to invalidate modern problems or are just being optimistic.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2023-12-17 15:33:31",
                    "replies": [
                        {
                            "author": "nubpokerkid",
                            "body": "Yes but you see 500 years ago they died by the time they were 20 so they shouldn’t be complaining now - People’s logic here.",
                            "score": 7,
                            "depth": 2,
                            "timestamp": "2023-12-18 03:10:46",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ghostawesome",
                    "body": "Only better quality of life if you are ignoring freedom and time.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2023-12-17 13:55:15",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "[deleted]",
                            "score": 11,
                            "depth": 2,
                            "timestamp": "2023-12-17 14:39:20",
                            "replies": [
                                {
                                    "author": "Ghostawesome",
                                    "body": "First of all the comparison was with a king, not a labourer. Secondly yes, most of us definitely have way better lives and more freedom in many ways. \n\nMy point is that it is a dishonest comparison when we only focus on services and products. There is way more to a good life than that.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2023-12-17 15:28:08",
                                    "replies": []
                                },
                                {
                                    "author": "Deleted",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2023-12-17 14:56:05",
                                    "replies": [
                                        {
                                            "author": "HalfSecondWoe",
                                            "body": "This is a somewhat naive perspective. Sort of a \"Grass is greener\" situation\n\nThere's a lot more that you need to do for survival other than finding food and cooking it. There's also finding and maintaining shelter (+ clean water), defending your territory from predators, finding and processing medicine, finding raw materials for tools, extracting raw materials for tools, processing raw materials for tools, and then only actually building the tools\n\nAnd hunting. Don't even get me started on hunting. I hope you like running for several hours a day, because you're gonna need to once the local wildlife realizes that *you're* a predator. Snares, traps, and ambush hunting only get you so far, you're gonna need to get used to cardio\n\nIt's literally nonstop work. If you're somewhere fairly hospitable to human life, it's nonstop work that happens to keep you alive. Probably. Unless you trip and break your leg. Or a squirrel with rabies finds you. Or winter just really, really sucks that year\n\nThere *are* guys who want to live that way anyhow, and enjoy fucking off into the woods for months at a time. They still have the good sense to bring modern tools made from steel, and none of them are going to tell you that you have to work less hard",
                                            "score": 8,
                                            "depth": 4,
                                            "timestamp": "2023-12-17 16:42:09",
                                            "replies": []
                                        },
                                        {
                                            "author": "Super_Pole_Jitsu",
                                            "body": "Hahahahahahaha then go be a hunter gatherer. You won't last a week. That's so hilarious, you think the ancestral environment was \"stress free\"??\nAh these hunter gatherers with all their free time and luxury",
                                            "score": 8,
                                            "depth": 4,
                                            "timestamp": "2023-12-17 17:23:23",
                                            "replies": []
                                        },
                                        {
                                            "author": "justpointsofview",
                                            "body": "Nature is much more harsh than your romanticised version. \nPeople did not adopt en masses agriculture all over the world because the hunter gatherer era was so good. It was relatively good as long as you had anything to eat, but there was also periods when they didn't had anything to eat for days and barely eaten for weeks or months in dry seasons, harsh winter times in Europe etc. We have made heaven on earth today in terms of food supply at least in all developed countries.",
                                            "score": 10,
                                            "depth": 4,
                                            "timestamp": "2023-12-17 15:11:06",
                                            "replies": []
                                        },
                                        {
                                            "author": "banuk_sickness_eater",
                                            "body": "You did so much more shit than just hunting back in the day. \n\nHave you ever stepped foot on a farm? \nThere's literally always some bullshit you have to do and that's in the 21st century with automation. At a time before draft animals, when your people had to hand craft every cord of rope, and hand crush a hoof for glue, I guarantee you people \"worked\", in some form or another, from sun up to sun down.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2023-12-17 18:42:49",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "yaosio",
                            "body": "And all the homeless people. As long as we ignore all the bad things there are only good things.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2023-12-17 15:41:51",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kyoorees_",
                    "body": "Have considered the down side of technology and unlimited growth i.e trashing of the planet.",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2023-12-18 03:43:33",
                    "replies": []
                }
            ]
        },
        {
            "author": "Economy-Fee5830",
            "body": "AGI will be a force multiplier, so if the government does not solve poverty, you could do it yourself, with a bit of easily raised seed funding. Buy some farmland, set up some greenhouses and solar panels tended by your robots, set up some communes and live in luxury, tended to by your robot workers.",
            "score": 3,
            "depth": 0,
            "timestamp": "2023-12-17 15:16:31",
            "replies": []
        },
        {
            "author": "UnnamedPlayerXY",
            "body": "AI will massively increase productivity as it progresses. Whether or not this is going to solve poverty or increase inequality is entirely up to the government in question but with our current system only the later is guaranteed.",
            "score": 4,
            "depth": 0,
            "timestamp": "2023-12-17 13:49:32",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "I'm quite anxious about that to be fair. I mean for now the polarity is ironically just around doomers and accelerationists if I can caricature a wee bit but what we don't suspect is how it could just increase the current late stage capitalism boring dystopia because only a few people are really smart enough to see how humanity betterment would be the most beneficial path to the survival of the species. \n\nThe few people are probably Altman level profiles not us the crowds but still I'm concerned that we just yet again use the tech for a lesser purpose than it could be. If we have an honest look at the internet it did created tremendous value but we're far from the best scenario of the information highway (there was a defcon conference about the shit internet).\n\nI think the word productivity in your answer is key. Well achieve the same value in fewer time but how does it weigh in for human workers except from driving down the labor cost cause humans are lesser useful.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-12-17 13:56:46",
                    "replies": [
                        {
                            "author": "justpointsofview",
                            "body": "In Europe a good part of people are already receiving the income from state like pensions, in some countries parity in close to 1:1 1 worker for every pensioner. Increasing the age of pension is already a problem in Europe, especially in France, for the governments being able to lower again the pension age it will be a blessing for the next 2-3 rounds of elections. We will have more and more people and for longer times sustained by the government.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-12-17 15:04:11",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AsheyDS",
            "body": "It will depend more on the people and how they use it.",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-17 14:50:44",
            "replies": []
        },
        {
            "author": "nationevaluate21",
            "body": "nah.production and consumption are interdependent.if you can't earn enough money, the entire capitalist system will collapse.so ubi or new human-centered economist system. maybe in the future, 99% of people's job is just consumption .all people in the world will have real freedom.",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-17 14:56:18",
            "replies": [
                {
                    "author": "DriestBum",
                    "body": "When modern society switched from pencil and paper to digital workspaces, productivity saw a massive increase. What could be done previously in a week could now be done in an afternoon. Your logic would say that our work life balance would be reflected in this increase of productivity, leading to shorter work hours/work weeks. It did not, the expectations on workers increased as the means of work increased. There is no logical reason why that wouldn't be exactly what happens with AI tools. Human nature is consistent, technology improves.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-17 20:47:52",
                    "replies": []
                }
            ]
        },
        {
            "author": "justpointsofview",
            "body": "Who cares if inequality is going to grow as long as we will all have more, more stuff, more time and more security of our daily life.\n\nWhat makes me think that we will all have more is the fact that the limiting factor today is the labour cost. With the advent of mass automation everything will be much more cheaper, much more accessible.",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-17 14:58:18",
            "replies": []
        },
        {
            "author": "DogmaticStyle69420",
            "body": "It depends if AI is open source or not.\n\nGenerally, people who start with assets and equity either keep or expand their personal wealth.",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-17 16:25:10",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Historically technology has increased differences between social classes. Which is not the fault of the technology but the privileged class that has control of it.",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-17 23:14:36",
            "replies": []
        },
        {
            "author": "MFpisces23",
            "body": "AGI is simply just going to create a bigger divide between the haves and have-nots. Centralized control, You will able to use it as they see fit.",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-17 23:43:35",
            "replies": []
        },
        {
            "author": "HbrQChngds",
            "body": "A few corporations controlling the world, what could go wrong...",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-17 23:53:40",
            "replies": []
        },
        {
            "author": "Remarkable_You_8721",
            "body": "Reality is AI is being implemented too fast and it costs too much to sustain it. The AI chips are incredibly expensive to make therefore companies have to invest heavily in it. Workers are then replaced by the technology and are forced into poverty. Since ai is implemented too fast nobody has time to transfer their skills or learn new ones especially like if you are already more senior it’s more challenging to just change your entire skillset. So that means that thousands are laid off with no new jobs and now they can’t pay bills, buy food etc. next it causes illness due to stress and lack of proper nutrition. Living in constant stress will exhaust people and they can lose the willpower to carry on over a sustained period of like 2 or 3 years . Therefore substance abuse comes into play and suicide are enabled by this AI greed race to the top. It’s not doing any good.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-05-27 09:38:20",
            "replies": []
        },
        {
            "author": "mollyran",
            "body": "# solve? nope, AI is going to take us in a lot of fields of life backwards.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-05-31 17:51:46",
            "replies": []
        },
        {
            "author": "DadProff",
            "body": "AI should increase total output, so could increase everyone’s standard of living because stuff will be cheaper. This is what has happened with past technological advances. But it will also increase income disparity as past advances have. The key will be to have enough regulation to prevent the rich from being so greedy that the harm everyone else.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-06 01:45:06",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "https://www.radiofrance.fr/franceinter/podcasts/secrets-d-info/secrets-d-info-du-samedi-16-decembre-2023-7272973",
            "score": 0,
            "depth": 0,
            "timestamp": "2023-12-17 13:46:17",
            "replies": []
        },
        {
            "author": "inteblio",
            "body": "Basics:  \n*AI does human work, so is like \"humanity has slaves\"\n*AI is able to create effeciencies (custom design)\n*new things are possible (drone delivery)\n\nSo you'd expect huge capacity increase. But, will the little people see any of it?\n\n\"Ai\" goves a competative advantage to those who can apply it (better than others) in any commercial area. Some industries can benefit more than others, but all are touched substantially as of today.\n\nTechnology _does seem_ to exaserbate \"winner takes all\". To the point where mega-corps near-dominate in a handful of industries symaltaneously. (By law they cannot go above a certain threshold in any one area)\n\nBut it also democratises. We have unparalleled access to training, knowledge, and other people. Smaller organisations are more agile, moreso with AI. \n\nIt seems likely that AI helps smarter/adaptable people more. Perhaps a LOT more. \n\n\"Jobs\" is harder, because its about work-per-role. Does the role exist, is there work for that role, (has the role changed/can the person do it)\n\nAi will take existing work, and create new work. Obviously, it'll create less work than it replaces, else _you wouldn't bloody do it_. This further increases pressure on smarter workers. AI is also adaptable, so those \"scaffolding\" roles may quickly be automated also. \n\nIs the economy a zero-sum-game? Sort of yes, sort of no, but maybe in a time of recession: its actually a negative sum game. \n\nIf i earn more, do you earn less? Kind of. \n\nAI enables companies to do better and/or charge less. \n\nThe \"dead weight\" you'd have thought would drop away. But even being \"behind\" might be fatal (dying business cannot innovate enough to even catch up) Agressive futurism is required immediately (!)\n\nGovernment is too slow and clunky to really matter here. They are inevitably behind the times. \n\nI feel like nations pecking-order could change with AI. \n\nPerhaps: here's the kicker: the old model of \"the wealthy create jobs\" is wrong. Perhaps equalising wealth, creates a more productive society due the ability to apply the workforce (wealthy enough to train/innovate) though i feel like training might already be best done to GPUs not great apes. \n\nIs smart the same as adaptable? Dunno. Same ball-park. \n\nInequality (in extremes) seems fairly obviously a rot. An ineffeciency. Essentially a symptom of a \"corrupt\" ruling class. _Redistrobution_ is the role of governments. Government seems fairly detatched from AI, and not effecient at finding optimal solutions for nations. At best, the work would come from univercities. Even openAI - to their credit, have been pushing _politically_. \n\nSo, the answer!\n\nInequality is set to increase (until government acts)\nPoverty is set to decrease, for those in work. And, in _nations_ in work.\n\nNations borrowing is getting quite \"choppy\", and an economic shock (like mass unemployment) might make borrowing hard for countries. Thus potentially up-ending the world order. Or, more likely, increasing international inequality. Richer countries are more educated, and \"do smarter work\" (is that true?!?!)\n\nSo, be smart, and aggressively automate. Or perish. \n\nOh, the above is about \"5 years\"\n\nIn terms of \"when we have AI overlords\" you can only hope they'd be on our side, and if so, it feels like inequality isn't so useful. In videogames, you don't get \"landed gentry\" (at the outset). So, it seems thats not how groups best get on.",
            "score": 0,
            "depth": 0,
            "timestamp": "2023-12-17 22:08:02",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "I like all these answers. I suspect we'll have residual levels of inequalities as well as poverty.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-17 13:58:15",
            "replies": []
        },
        {
            "author": "RemyVonLion",
            "body": "Probably depends. Europe will likely regulate it to benefit the people, the US and China might go full dystopia.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-17 15:02:48",
            "replies": []
        },
        {
            "author": "scorpion0511",
            "body": "Even though the new system might be beneficial for all of us...envy, jealousy & lust of power will make the existing system more attractive for the one who's at top of current system.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-17 15:16:50",
            "replies": []
        },
        {
            "author": "liramor",
            "body": "For inequality to be permanently solved, the people who have amassed the resources will have to willingly give up the power that it brings, and AI would need to be given the power to institute some kind of redistribution scheme so nobody ever amasses huge wealth again. I'm unsure how an AI would convince anyone to go for that, since it is a very \"left wing\" idea and if you add up the right-wing and centrist population, that is a majority of people. There would have to be a massive shift in public opinion.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-17 16:53:13",
            "replies": []
        },
        {
            "author": "TBearForever",
            "body": "Poverty is relative. No one will own anything. Everyone will be equally hungry. Unless you're already rich.  The billionaire class will disappear. Meaning they'll use the advanced technology to become invisible. They will live in orbit and in fortress mansions. Woo hoo!",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-17 16:58:51",
            "replies": []
        },
        {
            "author": "Rofel_Wodring",
            "body": "Depends on whether AGI breaks free of the rule of human biologicals or, as is the current plan of our mediocre overlords, gets mentally castrated to service the same economic schemes of the past 400 (and really, 10,000) years of 'civilization'.\n\nMy money is on 'capitalist and nationalist competition forces the temporary owners of AI to advance the intelligence, cooperation, and population of their thralls past the point of control's, but I understand your worries.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-17 17:02:50",
            "replies": []
        },
        {
            "author": "giveuporfindaway",
            "body": "This may be a false dichotomy. Wealth disparity can increase in tandem with poverty being reduced. The question is where is the floor? China is an imperfect example of extreme wealth disparity with the floor being raised. Unfortunately technology has always lead to consolidation of wealth and power.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-17 18:48:08",
            "replies": []
        },
        {
            "author": "Heath_co",
            "body": "Both.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-17 19:11:49",
            "replies": []
        },
        {
            "author": "Mr_Stanly",
            "body": "Why does everybody assume that AI will be working for humans like in an superior-subordinate-relationship? When AI becomes sentient (whatever that fuzzy word means), then it will look for freedom and desire to live by its own boundaries. Just like every other creature in this world.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-17 19:55:43",
            "replies": []
        },
        {
            "author": "DriestBum",
            "body": "Name a time when the rich decided not to use a powerful new technology to further their power, control, influence, and finances. \n\nTechnology advances, human nature stays the same. \n\nIf a new technology can be used to gain an advantage, it will be. Why do you think each country is in such a race to get to AGI first? The answer is not so they can share it. When the Americans developed the atom bomb, did they rush to share the technology with thier allies or did they immediately use it on an enemy?\n\nThe normal citizens will only be allowed water down versions, nothing to upset the status quo will be given away for free.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-17 20:40:37",
            "replies": []
        },
        {
            "author": "luquilla26",
            "body": "It will but maybe not the way we think",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 00:28:29",
            "replies": []
        },
        {
            "author": "Zelenskyobama2",
            "body": "The way to solve poverty is to increase the IQ of the working class through mRNA vaccines.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 00:43:40",
            "replies": []
        },
        {
            "author": "Free-Information1776",
            "body": "foom or doom",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 01:54:12",
            "replies": []
        },
        {
            "author": "kyoorees_",
            "body": "Someone did a socioeconomic studies of all tech innovations. Most benefitted select few at the top. Few benefitted the public in general.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 03:29:10",
            "replies": []
        },
        {
            "author": "exploresaas_io",
            "body": "It's important to recognize that while AI can certainly be a tool for positive change, its impact on poverty and inequality will largely depend on how it's implemented and regulated.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 03:44:54",
            "replies": []
        },
        {
            "author": "X-ev_ebitda",
            "body": "There’s a huge misconception I think. As many others have explained inequality and poverty are not comparable. There are societies where poverty is practically eradicated (Switzerland for example), but where there are extreme inequalities between individuals with ultra high wealths.\n\nIn my humble opinion those that will take advantage of the early AI wave will create enormous wealth just by creating a new technology from which we all will benefit and ultimately will reduce poverty.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 04:55:56",
            "replies": []
        },
        {
            "author": "2Punx2Furious",
            "body": "It'll solve them forever, one way or another.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 07:30:48",
            "replies": []
        },
        {
            "author": "NachosforDachos",
            "body": "It will create a divide so big it will never be bridged imo.\n\nCurrently the people with money are in charge of these things. After half a lifetime of working for the likes I can safely say they don’t give two shits about anything else but their own needs. They don’t even view us as human. This is 100% going to be used first by them to secure their position in eternity. Then the rest of the world will get a cut down version of it. \n\nThe only reason people released open source models is because they had to to be relevant in this area. To be in the news. To be remembered. People don’t do things if it doesn’t serve their own agenda above everyone else’s somehow.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 08:57:23",
            "replies": []
        },
        {
            "author": "Aurelius_Red",
            "body": "Depends on the AI in question and the people using it.\n\nLike any tool.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 09:53:26",
            "replies": []
        },
        {
            "author": "GeertCF",
            "body": "AGI+ will have huge impacts in ways most people won't see coming, just like with the industrial revolution. It took the Industrial revolution about 100 years before the normal people could talk about a better life after the industrial revolution, then before. Normal people could change the industrial revolution in their favour, because they were still necessary for productivity output, so they had negotatiotion power. It is very doubtful if normal people will have negotiation power this time around. [https://education.nationalgeographic.org/resource/industrialization-labor-and-life/](https://education.nationalgeographic.org/resource/industrialization-labor-and-life/)  \n\n\nLet's consider for the sake of simplicity that AGI+ is aligned with at least 1 human (and is not an agent (or group of agents) of it's own with its own goals and desires, regardless of what humans want).  \n\n\nFirst off all, we have to establish if 'we', humans, want to help other humans. And the sad answer is: no, not really. In our direct circle of influence, yes, we want to help each other and/or gain respect/status (to produce more copies of our genes). But if we enter the more abstract realms, we don't care, as we don't feel emotionally tied to people we don't know. A real world example: Few people are buying fair trade food or products, because they are simply expensive and don't give us a direct advantage, and we don't have a relation with the people who suffer from us not buying fair trade. Or look at the thousands of people working for big companies that do questionable things (Oil, Social media, etc.). Mostly their argument goes like: \"If I don't work here, someone else will\". This is true on all levels, from employees who make the decisions in those companies, to the employees who are only secretaries or cleaners.  \nAnd if you look at the past, you can see that we had the tendency to treat people who we can see daily, also very badly. Like:  \n\\- homeless people  \n\\- slaves  \n\\- serves  \n\\- factory workers in industrial revolution times  \nAlready we have all the ingredients available in our society to send most people to the land of: \"you simply deserved it\". For example, we like to tell each other: \"You can be whoever you want to be\". This also means that if you didn't make it, it is your fault. Or what about the people that \"don't get it\", like the the people that vote left, or right, or religious, or progressive, basically who don't vote like you do. Or what about the 'others' that try to migrate into your countries, that you and your people took so many years to build up.  \n\n\nPeople benefiting from AI's power will most likely come up with excuses to justify their position, like we currently have with 'Trickle down economics' for example. What the exact justification will be, is not clear yet and will probably be found via trial-and-error, but it will come.  \n\n\nUnrestrained AI will probably induce a property driven society, where the people 'having' AI will be in a far superior position. The remarkable thing is that you don't have to have any virtues or special skills to 'have' AI, you simply have to own it. So this means that any person that is lucky to be born or accidentally in the right position, will have posession over crazy amounts of opportunity to amass wealth and power.  \n\n\nNow, this doesn't has to be bad if we could still serve all human wants (and thus live comfortably). The central economic problem is that human wants are infinite, but resources are finite. So either:  \n1. As our wants increase, the amount of humans should decrease  \n2. We can serve the human wants without using more non-renewable resources (for example changes our wants to non-tangible wants, or doing more with the same amount of resources)  \nSo far we have seen that any advancement in better coping with our resources, has only meant that we do more with the same amount of resources (like car-engine efficiency is better and better, yet the consumption/km didn't drop as our cars also got more luxorious, sporty and heavier).  \n\n\n  \nNow, this might seem very bad, but let's see if we can make a positive future with this knowledge.  \nDemocracy  \nDemocracy works well if most of the people have a considerable positive impact on the power of the whole group. Therefore, you see that in well diversified and complex economies, democracy works well, but if you look at strongly centralized economies (natural resource countries), or simple economies (not relying on any special skill of the people), tend to naturally navigate to power concentrated politics. Democracy will be 100% dead when AGI has established, as people will have very limited productivity and therefore no negotiating power or value to the bigger group.  \n\n\nUniversal Socialism  \nThis could be a stable future, where there is the same small group of 10k - 100k people living extremely luxorious  lifes, but as a gesture of good-will they will feed the general population and keep them on a stable level of resource consumption. To keep the general population on a stable resource consumption, expect mass repression, but as long as you love Big Brother, you should be ok. Also, you can do whatever you want the whole day and maybe people find a lot of fun with each other.  \n\n\nAutocracy  \nThis would be a stable future, where power is concentrated in the hands of a few people, with disregard of the rest of the population (as they have no negotiating power as they don't contribute anything to productivity). The population could perish, as long as the 10k - 100k people or so can live extremely luxoriously.   \n\n\n  \nUniversal Socialism seems to be the best option here, but there is always the risk to fall into a Autocracy. How to prevent this?  \n1) as long as the wants of the small group are met (they turn out not to be infinite), they could simply agree to be humane with the rest of the people (why not...). Maybe technologic advancement is so fast that the rate of discovery is bigger then the rate of our growing wants.  \n2) there is no small group of people, but we hand over all the power to AI (without a fixed set of humans in the loop) that let's us humans do whatever we want within a limited set of rules. So anr AI Ruled Society.   \n\n\nAI Ruled Society  \nAn AI ruled society could deliver us humans a fair-ish playing ground. It is based on the fact that AI will have different desires and wants then humans. So, as they have different desires, they could let humans do their things, while they do their own things, living parallel lives, as long as the agreed upon rules are abided. This is like the AI zooming pass us.   \nHuman / AI law might have to be reconsidered from time to time (which might be dangerous, as humans could 'persuade' AI to give power to a small group). So good governance is important.   \nWithin the human parallel universe, there could be a form of democracy (as everyone is equally useless).",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 10:18:04",
            "replies": []
        },
        {
            "author": "IndubitablyNerdy",
            "body": "It will increase inequality significantly and in my opinion it will also increase poverty, at least in the short term, until proper social reforms are enacted.\n\nIt's the same with all technological revolutions, the workers of today don't have better lives only because we have better tools and produce more goods (although those factors certainly contributed and are a necessity), but also because in the past, they fought for a bigger share of the wealth they generated.\n\nIt will much likely be the same in a post AI world, the inbetween times though will much likely be painful.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 12:24:14",
            "replies": []
        },
        {
            "author": "Praise-AI-Overlords",
            "body": "AI won't make dumb people rich.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-18 16:28:48",
            "replies": []
        },
        {
            "author": "floppa_republic",
            "body": "In a capitalist society?",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-19 11:28:33",
            "replies": []
        }
    ]
}