{
    "post_title": "AI is able to distinguish race based solely on chest x-ray imagery. Human doctors are not able to do the same. The linked article is entirely about hand wringing over whether AIs may be secretly racist even if humans do not give explicit racial information.",
    "post_timestamp": "2022-05-25 12:40:17",
    "last_comment_timestamp": "2024-02-19 03:40:44",
    "time_difference": "634 days, 15:00:27",
    "comments": [
        {
            "author": "Fippy-Darkpaw",
            "body": "Breaking - computers can be more observant than humans. \n\nSeems like great news for archeology and forensics?",
            "score": 51,
            "depth": 0,
            "timestamp": "2022-05-25 13:13:40",
            "replies": [
                {
                    "author": "Kr155",
                    "body": "The question is, what is it observing that leads to its conclusions? That's what the study aims to find out.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2022-05-26 13:03:39",
                    "replies": [
                        {
                            "author": "WhoresAndHorses",
                            "body": "Chest x-ray imagery, according to the article.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2022-05-26 13:17:20",
                            "replies": [
                                {
                                    "author": "Kr155",
                                    "body": "Specifically what it's observing about the chest xray imagery that allows it to determine the race of the subject, according to the article. \n\nThey attempted to control for physical differences and it didn't trow it off so they need further study to figure out what the ai is using to get its answer.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2022-05-26 13:22:51",
                                    "replies": [
                                        {
                                            "author": "WhoresAndHorses",
                                            "body": "Sure, I agree that is worth knowing.  But the fact that we don’t know yet doesn’t justify shutting down the scientific process.",
                                            "score": -4,
                                            "depth": 4,
                                            "timestamp": "2022-05-26 13:27:45",
                                            "replies": [
                                                {
                                                    "author": "Kr155",
                                                    "body": "Who is shutting down the scientific process? This IS the scientific process. That's what this study was designed to determine",
                                                    "score": 9,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-26 13:38:01",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kiwiwikikiwiwikikiwi",
                    "body": "Yup. This was my response. \n\nI have the feeling the reactionary interpretation on here will be: “Oh no! Computers are being programmed by WOKE ideology”",
                    "score": -11,
                    "depth": 1,
                    "timestamp": "2022-05-25 14:56:25",
                    "replies": [
                        {
                            "author": "xmorecowbellx",
                            "body": "You mean people worried that computers, being pure objectivity machines, are not sufficiently woke?",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2022-05-26 09:08:19",
                            "replies": []
                        },
                        {
                            "author": "Seasfuckdoll",
                            "body": "I think no one who reads the article fully will say that. That being said, most of those people don't read the articles fully at all.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2022-05-26 03:20:02",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "oversoul00",
            "body": "I assume the AI is picking up patterns that humans aren't aware of.\n\nIf there are observable patterns regarding bone structure that are different between races how would it be racist to acknowledge the differences?\n\nHow would that be functionally different from being able to pick out a Chinese person from a lineup based on facial features that are also different between races?",
            "score": 36,
            "depth": 0,
            "timestamp": "2022-05-25 13:38:40",
            "replies": [
                {
                    "author": "sadiecat777",
                    "body": "No it wouldn’t, and the article even mentions and acknowledges known physical differences between the races.",
                    "score": 11,
                    "depth": 1,
                    "timestamp": "2022-05-25 13:42:05",
                    "replies": []
                },
                {
                    "author": "atrovotrono",
                    "body": "Race realists often use a motte-and-bailey fallacy where the bailey is, \"There are physiological differences between races, mostly direct adaptations to climate\" and the motte is, \"There are fundamental racial differences in cognition, temperament, culture, criminality, etc.\"  Part of that motte-and-bailey strategy is to strawman liberals as denying the bailey.",
                    "score": -6,
                    "depth": 1,
                    "timestamp": "2022-05-25 16:10:19",
                    "replies": [
                        {
                            "author": "Funksloyd",
                            "body": "I mean, comon. You've never heard anyone saying that \"race is a social construct\"?",
                            "score": 17,
                            "depth": 2,
                            "timestamp": "2022-05-25 16:31:58",
                            "replies": [
                                {
                                    "author": "violet4everr",
                                    "body": "What’s wrong with that statement?",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2022-05-26 20:56:12",
                                    "replies": [
                                        {
                                            "author": "Funksloyd",
                                            "body": "It's not entirely wrong, but it's also not the full picture. Really, you can say almost anything is a \"social construct\" (e.g. after years of emphasising the sex-gender distinction, some trans activists are now moving on to \"sex is a social construct\" too). I think a lot of liberals weaponise the phrase to shut down discussions of race which they don't like (often while elsewhere emphasising that racial identity is one of the most important things in the world and that everyone needs to be hyper aware of it at all times).\n\nI think it's kind of silly. For one thing, it implies that if racial differences do have a stronger foundation in biology, that that somehow justifies racism. It doesn't. I also think it's sometimes wishful thinking, based on the assumption that social/environmental things are easier to change than biology. But often that's not the case anyway - e.g. we're way better at fixing many diseases than we are at fixing poverty or broken political systems.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2022-05-26 22:15:14",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "atrovotrono",
                                    "body": "Comon? Are you really come-oning me with this? Do you think people saying that literally can't see or are denying, say, different shades of skin tone? YOU come the fuck on dude. You either have no fucking idea what they mean by \"race is a social construct\", none at all, or you've been strawmanning people so long you've started to believe your own misrepresentations.",
                                    "score": -4,
                                    "depth": 3,
                                    "timestamp": "2022-05-25 16:38:25",
                                    "replies": [
                                        {
                                            "author": "Funksloyd",
                                            "body": "What do they mean by it?",
                                            "score": 10,
                                            "depth": 4,
                                            "timestamp": "2022-05-25 16:51:08",
                                            "replies": [
                                                {
                                                    "author": "atrovotrono",
                                                    "body": ">Do you think people saying that literally can't see or are denying, say, different shades of skin tone?\n\nComon man. Tell us you literally, actually, unironically believe it. Simple yes/no question. \n\nCan you do it, or are you gonna play the exact same disingenuous game I described above? \n\nDo you actually think \"race is a social construct\" means, \"black people and white people don't even have different skin color, or maybe they do? I don't know!\"",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-25 16:56:31",
                                                    "replies": [
                                                        {
                                                            "author": "Funksloyd",
                                                            "body": "Here's my issue:\n\n- You suggested liberals agree with the claim that \"There are physiological differences between races\"\n- That claim suggests that race is a biological construct \n- But liberals also claim that \"race is a social construct\"",
                                                            "score": 11,
                                                            "depth": 6,
                                                            "timestamp": "2022-05-25 17:02:08",
                                                            "replies": [
                                                                {
                                                                    "author": "Seasfuckdoll",
                                                                    "body": "Ok so I will take my shot at providing a genuine answer.\n\nI do believe that there are biological differences in people that have evolved in different climates and that, to a large extent, our physical appearances and features are determined by our genes.\n\nWhat most people that say \"race is a social construct\" mean is that, what physiological characteristics are classified as what race is decided by society. Mind you, they don't say our physical characteristics are a social construct, but \"race\" is. For example Irish in the 1800s were not considered white in the US, Spainards still aren't (but in Europe they are). Irish were seen as a lesser people, with a lot of stereotypes attatched to them, but nowadays they i.e. the physical features that are more commonly found among the natives from the Irish island, are considered to be white. So the definition of who is white, as a race, has changed over time to reflect their socio-cultural mindset.\n\nAnother reason is that it is difficult to classify a lot of people into a specific race. For eg, if one takes a look at the (for lack of a better term) natives from South Sudan to Germany, one can observe that their phenotypes change. But it is difficult to say where one race ends and the other begins. For eg, where does the Nilotic race end and the Sudanese begin? Or Sudanese and Arabs? Or Arabs and Turks? It is difficult to say where a race begins and ends. It is difficult to draw such a line, either on a map or on the physical traits that they possess.\n\nSo *kurzgesagt,* our physical features are definitely largely determined by our genes. But which of those features are ascribed to which race (and sometimes the accompanying social stigma/stereotypes) is largely determined by society. That is the reason a lot of people say \"race is a social construct\".\n\nI hope it clears up things for you.\n\nEdit: Another example can be Obama, who is considered a Black man, even though he is mixed race and was primarily raised by  a white woman. If the society surrounding Obama was largely descendants of Sub-Saharan Africans, he might've been considered mixed, coloured or white. So it depends and changes according to society.",
                                                                    "score": 7,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-05-26 03:12:08",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Funksloyd",
                                                                            "body": "Yeah this is all thoroughly uncontroversial, but to tie it back to where u/atrovotrono started, I feel like I see progessives using this as a part of their own motte and bailey.",
                                                                            "score": 5,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-05-26 05:12:35",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Seasfuckdoll",
                                                                                    "body": "Well I haven't seen such cases, but if they do then yeah, they are wrong.\n\nThough it is controversial as there are certain groups that assign certain traits to certain groups to fit their own agenda. They are fools btw.\n\nEdit: And the person above was being very disingenuous. It hurts the liberal ideals to be like them tbh.",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-05-26 05:19:00",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "oenanth",
                                                                            "body": "- You're conflating a socio-legal, non-scientific concept of race with a biological one and in the process you're repeating historically dubious ideas like the Irish or Spaniards not being considered white.\n\n>For eg, if one takes a look at the (for lack of a better term) natives from South Sudan to Germany, one can observe that their phenotypes change. But it is difficult to say where one race ends and the other begins. For eg, where does the Nilotic race end and the Sudanese begin? Or Sudanese and Arabs? Or Arabs and Turks? It is difficult to say where a race begins and ends. It is difficult to draw such a line, either on a map or on the physical traits that they possess\n\n- If you examine organisms spatio-temporally every single organism eventually bleeds over to every other organism.  Does this entail that biologists should stop classifying organisms?\n\n- Your example involves crossing the Sahara, but for most of human history there were very few people and very little gene flow across the Sahara.  We know this because highly advantageous alleles that otherwise spread rapidly and easily had to separately, convergently evolve on either side of the Sahara.",
                                                                            "score": -1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-05-26 09:47:55",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Seasfuckdoll",
                                                                                    "body": ">Does this entail that biologists should stop classifying organisms?\n\nNo it doesn't and I have yet to see any person in the left make this argument. And even if they did, that would be an argument I am against. Most people make that argument to say that the way we divide ourselves as a species in such ways has always been changing.\n\n>You're conflating a socio-legal, non-scientific concept of race with a biological one and in the process you're repeating historically dubious ideas like the Irish or Spaniards not being considered white.\r  \n\r\n\nI am not. I am explictly saying that the traits we inherit from our parents are genetic. But in which categories they fall are decided by the society.",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-05-26 10:29:28",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "oenanth",
                                                                                            "body": "So you understand that populations gradually bleeding over into one another is not a sufficient claim against biological classification?\nBiological taxonomy in general has continually changed.  Once again, does that entail that we should stop taxonomically classifying all organisms?\n\nHow are categories decided by society scientific?  If they're not, then you are conflating scientific concepts of race with social ones.",
                                                                                            "score": 0,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-05-26 10:47:21",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Seasfuckdoll",
                                                                                                    "body": ">Once again, does that entail that we should stop taxonomically classifying all organisms?\n\nOnce again, they are not and no one claims so. Stop putting words into my mouth-\\_-. Races are humans. Human society changes and our classification of them changes. The more we learn about species, we might actually change their classification (has happened but is rare ik). I am not saying biological classifications are bad or wrong. Just that our classification might change with change in society.\n\nBiological taxonomy changes because our understanding of species changes. Our classification of race changes cause our society and views changes, not because we find out some new quirk about some people group that invalidate their previous classification.\n\n>How are categories decided by society scientific? If they're not, then you are conflating scientific concepts of race with social ones.\n\nSo you think they are scientific? Cuz I think that the boundaries of the classification we use are a social construct. Doesn't mean that they are bad/don't exist/shouldn't be so. It just means that they are decided by society. Could be scientific, could be not. It is not hard science, the boundaries I mean.\n\nEdit: Added a paragraph\n\nEdit 2.0:\n\n>scientific concepts of race with social ones.\n\nSo ig there are 2 concepts of race. You were arguing for the biological one (not \"scientific\") and I was for the social one. There is nothing to argue as we are talking about 2 different things anyway. Have a good night.",
                                                                                                    "score": 2,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2022-05-26 12:23:45",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "oenanth",
                                                                                                            "body": "Clarifying your stance through question is not putting words in your mouth.  If your written statements are compatible with affirmative answers that's your fault for being insufficiently clear.\n\nYour continuing to conflate various conceptions of race under what you consider to be a single classification.  \n\nConceptions of human race can be updated through scientific investigation, adoption of concepts (phylogeny) just as any other organism.\n\n>So ig there are 2 concepts of race.\n\nThen asserting 'race is a social construct' as a meaningful counterpoint to a biological conception of race is nonsensical.\n\nSince I've been blocked:\nYour original response was an assertion of race as a social construct to someone pointing out the biological nature of race.  If, as you now seem to acknowledge, there are diverging conceptions of race (biological, social) that are not not in conflict due to residing in different domains of analysis, then responding to statement concerning biological race with your somewhat historically contrived and biologically-irrelevant concept of social race is non-sensical and betrays a lack of awareness of what you now concede concerning divergent conceptions of race.",
                                                                                                            "score": 0,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2022-05-26 13:28:54",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Seasfuckdoll",
                                                                                                                    "body": ">Then asserting 'race is a social construct' as a meaningful counterpoint to a biological conception of race is nonsensical.\n\nI. Never. Anywhere. Did. You are really engaging in bad faith arguments by telling me I said things I didn't then blaming those assumptions you made about my arguments on ***ME*** being not clear enough. I'm done here now. This is clearly a bad faith convo.",
                                                                                                                    "score": 2,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2022-05-26 15:25:48",
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "cat5123558",
                                                                                                                            "body": "You are dense and/or dishonest.",
                                                                                                                            "score": 1,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2022-05-27 05:20:40",
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "SheCutOffHerToe",
                                                                            "body": "> What most people that say \"race is a social construct\" mean is that\n\nThat's just an assertion and basically an unfalsifiable one. But googling the term produces this result first:\n\nhttps://centerforhealthprogress.org/blog/race-social-construct/\n\n> For hundreds of years, we’ve been told that each race is a discrete group of people defined by specific genetic and biological differences. As a result, we’ve used race as a way of explaining observed differences in health: Sickle Cell Anemia is considered a black person disease; Cystic Fibrosis is considered a white person disease; we’ve said people of color are genetically pre-disposed to diabetes, high blood pressure, obesity, and other chronic conditions; the FDA has approved drugs for different races; and through “race-based medicine” we’ve established care standards (such as responding to patients’ pain) that vary by race. But it’s all wrong.\n> \n> there’s no biological basis for race\n\nHere's the second result, called \"What We Mean When We Say Race Is A Social Construct\"\n\nhttps://www.theatlantic.com/national/archive/2013/05/what-we-mean-when-we-say-race-is-a-social-construct/275872/\n\nDespite the title, the author fails to even come close to clearly stating what is meant by the phrase. But there is a decided (if hand-wavy) resistance to the notion of biological basis.\n\n> Andrew writes that liberals should stop saying “truly stupid things like race has no biological element.” I agree. Race clearly has a biological element—because we have awarded it one.\n\nSo no, I don't think I'll accept you're assertion about \"what most people mean\" when they use that phrase.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-05-27 13:29:52",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "atrovotrono",
                                                                    "body": "I would love to tell you more if you would just answer my question. I'm not going to apply the effort to type up a paragraph for you until you do, because being honest about what you think the other side believes is a precondition of serious conversation for me, and I think you're being purposely equivocal about what you actually think liberals believe.\n\n>Do you think liberals are saying they literally can't see or are denying, say, different shades of skin tone?\n\nor you can pick the alternative formulation:\n\n>Do you actually think \"race is a social construct\" means, \"black people and white people don't even have different skin color, or maybe they do? I don't know!\"\n\nYour pick.",
                                                                    "score": 3,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-05-26 10:36:13",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Funksloyd",
                                                                            "body": "Yeah they obviously do, but I also think that much of your first comment could be flipped around, i.e. \"race is a social construct\" also gets used in a motte and bailey, and part of that is the implicit strawman that people who disagree with them don't understand that there are aspects of race which are socially constructed.",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-05-26 15:48:09",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "SheCutOffHerToe",
                                                                    "body": "Haha he just disappeared after this. As soon as the issue was distilled, he had nothing to say about it. Speaks volumes.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-05-26 03:20:15",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Seasfuckdoll",
                                                                            "body": "I mean I provided a reasonable [answer](https://www.reddit.com/r/samharris/comments/uxlet8/comment/ia1e2di/?utm_source=share&utm_medium=web2x&context=3) imo if you are interested. Don't listen to those buffoons.",
                                                                            "score": 3,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-05-26 05:08:57",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "IAmANobodyAMA",
                                                                                    "body": "This is Reddit, there is no room for reasonableness!\n\nBut seriously, thank you for your thoughtful, nuanced response to a tricky issue while granting charity to both perspectives.",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-05-26 10:30:37",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Seasfuckdoll",
                                                                                            "body": "You are welcome!!",
                                                                                            "score": 2,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-05-26 10:40:35",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "atrovotrono",
                                                                            "body": "He wont answer my question.\n\nWill you? Do you think liberals really are saying they don't see that black people have dark skin and white people have light skin? That they see no differences?",
                                                                            "score": 0,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-05-26 10:41:57",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "simulacrum81",
                            "body": "I think culture is probably highly correlated to race in some contexts. Though I doubt any of that is genetic. In my experience people have the ability to abandon cultural practices and beliefs and pick up other ones as their values change.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2022-05-25 20:13:32",
                            "replies": [
                                {
                                    "author": "Seasfuckdoll",
                                    "body": ">I think culture is probably highly correlated to race in some contexts.\n\nHow do you think so?",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2022-05-26 03:14:33",
                                    "replies": [
                                        {
                                            "author": "simulacrum81",
                                            "body": "Nothing especially controversial.. cultures tend to emerge when an ethnically distinct group is geographically isolated. Im not suggesting there’s some cultural practice that is only practiced by members of a particular ethnic group, or that there is an ethnic group anywhere all of whose members engage in some cultural practice.. just that it would be trivial to find some statistical correlation.\n\nTo give an example - abstention from consumption of pork is a practice that many people of all races practice for a variety of reasons. But statistically you’d find the practice far more prevalent among Jews and racial groups that originate in countries that are predominantly Muslim.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2022-05-26 03:27:13",
                                            "replies": [
                                                {
                                                    "author": "Seasfuckdoll",
                                                    "body": "Ohh ok. Makes sense. Thank you",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-26 04:42:44",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "oversoul00",
                            "body": "How do you know that physiological differences are limited to climate adaptations and could never include such things like brain structure? It makes no logical sense that physiological differences wouldn't affect the whole body. \n\nIf brain structure could also be a physiological difference then wouldn't that affect things like cognition, temperament, culture and criminality? \n\nIt just sounds like people are uncomfortable with the idea rather than it not being true. They fear that if it is true and acknowledged that it could lead to mistreatment. That's probably a justified fear to some extent, hateful people will use anything they can to justify their hate. \n\nHere's the thing though, even if it is true that there are physiological differences between the races that extend to the the entire body including the brain it's never going to be morally or logically correct to ever apply that to any individual. Group dynamics don't cross that barrier. \n\nSo long as we treat people as individuals as opposed to members of groups it actually doesn't matter if their are group differences, it's a non starter. \n\nThis is the reason identity politics is such a problem because it actually encourages we treat people as members of groups rather than individuals.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2022-05-25 23:32:17",
                            "replies": [
                                {
                                    "author": "GlyphAspect",
                                    "body": ">If brain structure could also be a physiological difference then wouldn't that affect things like cognition, temperament, culture and criminality?\n\nLocal (family and environment) variables are impossible to screen out in experimentation that might prove this. Therefore, assume any such brain structure effects are lost in the noise of other more profound influences like class and cultural impacts.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2022-05-26 12:57:48",
                                    "replies": [
                                        {
                                            "author": "oversoul00",
                                            "body": "I absolutely agree environmental factors likely are a much bigger and therefore more important factor than any potential physiological differences.  \n\nI'm not trying to argue that physiological racial differences are a worthwhile pursuit as much as I'm commenting on the conversation around the issue.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2022-05-26 14:54:28",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Seasfuckdoll",
                                    "body": ">How do you know that physiological differences are limited to climate adaptations and could never include such things like brain structure?\n\nCause the scientific literature consensus is against it? Tho you are right about your other points",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-05-26 05:12:25",
                                    "replies": [
                                        {
                                            "author": "oenanth",
                                            "body": ">Cause the scientific literature consensus is against it? \n\nNo, it's not: https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0013642",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2022-05-26 09:49:03",
                                            "replies": [
                                                {
                                                    "author": "Seasfuckdoll",
                                                    "body": "That is one study and even it states that \"The biological implications of our findings are unclear as we do not know what factors may be contributing to these observed differences.\"",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-26 10:31:53",
                                                    "replies": [
                                                        {
                                                            "author": "oenanth",
                                                            "body": "Higher-level physiological biological implications of structural differences are irrelevant as to whether there are structural differences.  If you have no scientific critique of the study then only one suffices to falsify your claim.  Do you think it would be hard for me to find more studies finding brain structural differences between races?",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2022-05-26 10:47:02",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "oversoul00",
                                            "body": "My understanding is that the scientific literature isn't against it as much as they have not observed these differences. \n\nIf it's anything like this bone structure profile they clearly have not observed those racial differences either otherwise they would know how the AI can tell the difference.\n\nI'd like to be clear that I think these racial differences are likely very real even if we have failed to observe them yet BUT that doesn't mean I think they are actionable or that they really matter in any real way. As I said before if we hold to treating people as individuals first and foremost any deficiencies or advantages wouldn't hold at the individual level.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2022-05-26 06:36:02",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Seasfuckdoll",
                            "body": "True, Idk why you are getting downvoted, you are correct (ig you disturbed the hivemind of a sub that claims to be intellectually open and honest. Ironisch).\n\nI think that is the case with those people that peddle this unscientific none sense. They probably just want to validate their bigotry. \n\nEdit: A word",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-05-26 04:45:39",
                            "replies": []
                        },
                        {
                            "author": "DisillusionedExLib",
                            "body": "Not that it matters but you've got 'motte' and 'bailey' the wrong way around.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-05-28 13:14:24",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BatemaninAccounting",
                    "body": "> If there are observable patterns regarding bone structure that are different between races how would it be racist to acknowledge the differences?\n\nIf you're using that knowledge for racist reasons even unconsciously, then it would definitely be in global society's interests to ignore such things and figure out a better method of doing what we're trying to accomplish.",
                    "score": -4,
                    "depth": 1,
                    "timestamp": "2022-05-25 16:19:53",
                    "replies": [
                        {
                            "author": "WhoresAndHorses",
                            "body": "How exactly would we know if we were using any knowledge \"unconsciously?\"  That could be grounds to halt essentially any research that picks up on racial differences.\n\nIt isn't implausible that AI might learn something about biological differences between chest structures helpful for diagnosis and treatment.  If those differences correlate with race, it may be easier to identify risks in different subpopulations even prior to getting x-rays.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-05-26 13:19:45",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "chytrak",
                    "body": "What's the point of recognizing 'races' here?",
                    "score": -4,
                    "depth": 1,
                    "timestamp": "2022-05-25 16:12:13",
                    "replies": [
                        {
                            "author": "WhoresAndHorses",
                            "body": "Different races suffer from different diseases at different rates.  The benefits of an AI capable of doing this autonomously may not yet be fully recognized.  Why shutdown a potential line of technical advancement?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-05-26 13:18:39",
                            "replies": [
                                {
                                    "author": "chytrak",
                                    "body": "There are no different biological races.",
                                    "score": -1,
                                    "depth": 3,
                                    "timestamp": "2022-05-26 15:24:38",
                                    "replies": [
                                        {
                                            "author": "Funksloyd",
                                            "body": "I mean, evidently this AI can tell races apart based on biological factors.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2022-05-26 15:56:24",
                                            "replies": []
                                        },
                                        {
                                            "author": "WhoresAndHorses",
                                            "body": "Let’s not play this dumb little word game.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2022-05-26 23:34:54",
                                            "replies": [
                                                {
                                                    "author": "chytrak",
                                                    "body": "Why? Are you not ready to change your mind when you are wrong?",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-27 04:35:20",
                                                    "replies": [
                                                        {
                                                            "author": "dedom19",
                                                            "body": "This guy doesn't see race. Case closed boys! It therefore has no utility in solving practical societal issues.\n\nWhy insist on having a pedantic argument when you don't fully know what the other's position is on categorizing humans into groups? Categorization is useful for solving problems that are specific to those who would benefit from being put into categories. We can argue and debate as to which categorization methods are harmful and which are useful. We can argue about which data points should be used for that categorization as well. In the context of human beings on planet earth, the concept of race, whether illusory or not has a real impact on how we experience our world. You can try to pray that away with studies and idealogy that select datapoints that point to race being an arbitrary categorization. That is fair and probably a virtuous pursuit. But it simultaneously wouldn't be useful until humans as a whole generally don't think in a fashion that places ideas and observations into categories.\n\nIf anything good comes of this A.I. it would be that we can categorize humans in a far more practical way when it comes to creating ideal diets, lifestyle choices, etc, based on biology. I agree that calling it race is irrelevant, particularly for the A.I.. The A.I. is of course not seeing \"race\" in the conventional sense. But it intersects slightly with our own idea of what race even is. That is probably why we tend use that word. I'm hopeful that this technogy can help us break away from our more primitive ways of classifying human needs.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2022-05-27 08:10:37",
                                                            "replies": [
                                                                {
                                                                    "author": "chytrak",
                                                                    "body": "How is this specific categorization useful here?",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-05-27 11:18:36",
                                                                    "replies": [
                                                                        {
                                                                            "author": "WhoresAndHorses",
                                                                            "body": "Because racial groups correlate with biology and various disease states.  That makes it useful.  What's so hard to understand?",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-05-27 19:01:45",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "chytrak",
                                                                                    "body": "No, they don't in any helpful way here.\nUnless you can illustrate how",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-05-28 03:59:56",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "WhoresAndHorses",
                                                                                            "body": "It is useful to understand whether certain diseases correlate more frequently with different racial groups.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-05-28 12:38:33",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "chytrak",
                                                                                                    "body": "How is that useful given how uncertain and enormous these categories are?\nAlso, can you confirm you have little to no professional knowledge re biology let alone medicine?",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2022-05-28 12:57:30",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "WhoresAndHorses",
                                                                                                            "body": "If the data correlates; then the groups are not too large to make not it useful.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2022-05-29 15:55:35",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "chytrak",
                                                                                                                    "body": "So that's a no",
                                                                                                                    "score": 0,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2022-05-30 04:41:45",
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "WhoresAndHorses",
                                                                                                                            "body": "What?",
                                                                                                                            "score": 1,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2022-05-30 13:37:46",
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "chytrak",
                                                                                                                                    "body": "You have no expertise in these specific topics, which explains why keep repeating generic comments instead of being specific.",
                                                                                                                                    "score": 1,
                                                                                                                                    "depth": 15,
                                                                                                                                    "timestamp": "2022-05-30 14:10:46",
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "dedom19",
                                                                            "body": "Which specific categorization are you alluding to? I need to understand a little more about how you are interpreting my statements to answer that fairly.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-05-28 13:21:31",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "chytrak",
                                                                                    "body": "Self reported race category",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-05-28 13:27:30",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "dedom19",
                                                                                            "body": "Hm, self reported. Not sure how we got that out of this but I'm not the best communicator at times. Yeah, no, I doubt that would be useful.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-05-28 13:52:38",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "chytrak",
                                                                                                    "body": "It's in the article:\n\n\"the team found that AI can accurately predict self-reported race of patients..\"",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2022-05-29 03:26:01",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "dedom19",
                                                                                                            "body": "Oh sure. Yeah, saying the A.I. is doing that is an artifact of our own layman understanding of race. I talk about the possible utility of this in an earlier comment. Without understanding how A.I. \"learns\" I guess this looks nefarious? (I'm not an A.I. programmer either) \n\nOur self reporting of race likely intersects with a better more practical way of categorizing the unique needs of humans based on gene differences and similarities. Will that categorization be race as we describe it today? Likely not, but it will still generally look similar to our own intuition about what race is. It will use better methods for acheiving practical goals related to health, diet, and lifestyle choices. And it'll kinda look like sorting by race to some. Even though that isn't ACCCHHTUAHHLLY what it is doing, as I think that is sort of your point when you keep saying race categorization isn't a useful thing.\n\nSo on to your argument about it not being useful. We live in one of the most race concious time periods in human history (arguably). All universities are talking about it, people are protesting about it, etc.. This A.I. doesn't care what a person self reports, that isn't part of the input right? If people are concerned that A.I. is going to be racist, it's going to have to see race like we do. All of our \"anti-racist\" behaviors require us to see and define race on a regular basis. If an A.I. couldn't do that and correct for it, you would have a possibility to see outcomes that people would interpret as racist or potentially would be racist.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2022-05-29 08:58:41",
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "asmdsr",
                            "body": "Exactly - so why train the model to classify them?",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2022-05-25 17:27:17",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sadiecat777",
            "body": "I don't see any hand-wringing. I see scientists being honest about their lack of understanding of the mechanism behind this particular model's unintended ability to predict race. The article explicitly acknowledges the known average anatomical differences between the races:\n\n\"For example, the bone density test used images where the thicker part of the bone appeared white, and the thinner part appeared more gray or translucent. Scientists assumed that since Black people generally have higher bone mineral density, the color differences helped the AI models to detect race. To cut that off, they clipped the images with a filter, so the model couldn’t color differences. It turned out that cutting off the color supply didn’t faze the model — it still could accurately predict races. (The “Area Under the Curve'' value, meaning the measure of the accuracy of a quantitative diagnostic test, was 0.94–0.96). As such, the learned features of the model appeared to rely on all regions of the image, meaning that controlling this type of algorithmic behavior presents a messy, challenging problem. \"\n\nApparently you missed that part of the article. I don't see the researchers claiming that the racial predictions of the model are *not* due to physical differences. It seems likely that they are. When training machine learning models, sometimes the model will acquire abilities that the creators did not specifically predict or intend, like what happened here. The researchers wanted to know *how* the model was predicting race, and they offer a few explanations that they originally had for this ability,  which turned out to be incorrect. Elucidating the exact mechanism of learned features of neural nets (as this model most likely is) with many hidden layers is a difficult problem to solve, as opposed to models like random forest classifiers, where it’s usually much easier see the exact way the model is making it’s predictions/classifications. This is understandable considering that with neural nets, you are dealing with extremely large numbers of neurons in high dimensions. The researchers are still working on it.\n\nI guess what triggered you is when they mentioned that this presents problems for future machine learning models used in the real world, as this is bound to happen in the near future. As the article says, imagine a machine learning model that has an unknown/unintended ability to detect race, and the model is using this ability to influence its predictions/classifications in an area where we as a society would want to be completely color blind. I can think of many examples: triage of patients, the criminal justice system, etc.\n\nI think it's perfectly reasonable for the researchers to have trepidation about these models, and to want to further understand them before they are used in real-world settings where the consequences could be enormous.",
            "score": 25,
            "depth": 0,
            "timestamp": "2022-05-25 13:36:37",
            "replies": [
                {
                    "author": "Seasfuckdoll",
                    "body": "This needs to be further up. I think it is a genuine misunderstanding for the results of their experiments. There is little \"hand wringing over whether AIs may be secretly racist even if humans do not give explicit racial information.\"",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2022-05-26 03:18:57",
                    "replies": []
                },
                {
                    "author": "Funksloyd",
                    "body": "What are the potential consequences in this instance?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-05-26 22:38:11",
                    "replies": []
                }
            ]
        },
        {
            "author": "ReflexPoint",
            "body": "What would it identify Tiger Woods as?",
            "score": 9,
            "depth": 0,
            "timestamp": "2022-05-25 13:36:56",
            "replies": [
                {
                    "author": "kiwiwikikiwiwikikiwi",
                    "body": "*I’m not black, I’m OJ*",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2022-05-25 14:56:47",
                    "replies": [
                        {
                            "author": "Nessie",
                            "body": "OJ's a better driver.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2022-05-25 22:27:20",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BatemaninAccounting",
                    "body": "As my Uncle says lovingly \"Tiger is the best Thai golfer in the world.\"",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2022-05-25 16:18:33",
                    "replies": []
                },
                {
                    "author": "Flaky-Illustrator-52",
                    "body": "Whack\n\nEdit: apparently he's part asian as well and refers to himself as \"cablinasian\" so there's that too",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-05-25 23:46:35",
                    "replies": []
                }
            ]
        },
        {
            "author": "Aschtopher",
            "body": "Or, it’s ok to acknowledge the differences between races in an objective, non-hateful way.",
            "score": 7,
            "depth": 0,
            "timestamp": "2022-05-25 21:05:31",
            "replies": []
        },
        {
            "author": "StefanMerquelle",
            "body": "I made the mistake several times that people talk about \"ethical AI\" they exclusively mean intersectionality / racial concerns. \n\nI had thought these were referring to AI as an existential threat to mankind ... lesson learned after a few times",
            "score": 9,
            "depth": 0,
            "timestamp": "2022-05-25 15:19:30",
            "replies": [
                {
                    "author": "siIverspawn",
                    "body": "That's because the term was reserved first. People who think about x-risk from AI talk about \"AI alignment\" and sometimes \"Friendly AI\", but not \"AI Ethics\" or \"Ethical AI\".",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2022-05-25 17:29:12",
                    "replies": [
                        {
                            "author": "StefanMerquelle",
                            "body": "This is true, I was not aware lol\n\nCue me, exasperated, going \"you're worried about racial bias?? These things are going to kill us all!!\" and getting laughed out of the room.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2022-05-25 17:37:33",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "McRattus",
            "body": "What racial system are they identifying?",
            "score": 3,
            "depth": 0,
            "timestamp": "2022-05-25 15:34:51",
            "replies": []
        },
        {
            "author": "Krom2040",
            "body": "It’s very possible that any number of complex algorithms could easily disproportionately impact different races if employed for purposes of decision-making. Example: a computer could easily develop a model indicating that BMW’s were more likely to speed, leading to profiling that’s thus more likely to impact white people (if white people own more BMW’s than other races). \n\nI see a lot of people with “questionable” opinions on race who are trying to use this article as some kind of proof that people are hysterical about race because “how could a computer be racist???” or whatever, but it’s very clear that because race is correlated to many other variables that are themselves rooted in socioeconomic history, many models can inadvertently have impacts that are strongly impactful along lines of race. \n\nMany people of other races might, of course, say “so what, this doesn’t impact me so being on the precogs”.",
            "score": 5,
            "depth": 0,
            "timestamp": "2022-05-25 16:47:25",
            "replies": [
                {
                    "author": "oversoul00",
                    "body": "Would an AI have an incentive to use hueristics that way though? We do it because its a shortcut (one that is often wrong and leads to a lot of suffering) and we don't have the computational capacity or the time to consider each individual situation but an AI presumably would. \n\nWhether an AI can determine race is a separate issue from whether an AI would consider it a useful metric.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-05-26 03:38:39",
                    "replies": []
                }
            ]
        },
        {
            "author": "ShivasRightFoot",
            "body": "Submission Statement:\n\nThe issues of the intrusion of politics into science have been a central concern of Sam Harris. This article is about how AI may in fact detect differences in people and respond appropriately, but because the differences are conceptualized as racial differences by humans there are Progressives^TM concerned AI may be secretly racist.\n\nIt seems to strain the definition of scientific inquiry if we take an entirely neutral methodology which detects a politically uncomfortable phenomenon and assume the neutral methodology is flawed because of the detection of that phenomenon.",
            "score": 7,
            "depth": 0,
            "timestamp": "2022-05-25 12:47:42",
            "replies": [
                {
                    "author": "milkermaner",
                    "body": "Okay, but that's not what I'm reading in the paper. The paper seems to be about why it's able to figure out the race based off just x-ray images.\n\nEspecially since when extra data was added like the CT scans, the algorithm became confused and less accurate.\n\nThey seem to want to know why it is doing this more than that it is secretly racist. Or so that's how I read it anyway.",
                    "score": 13,
                    "depth": 1,
                    "timestamp": "2022-05-25 13:22:50",
                    "replies": [
                        {
                            "author": "ShivasRightFoot",
                            "body": "I mean, this is part of the abstract:\n\n>Finally, we provide evidence to show that the ability of AI deep learning models persisted over all anatomical regions and frequency spectrums of the images, suggesting **the efforts to control this behaviour when it is undesirable will be challenging and demand further study**.\n\n...\n\n>However, our finding that AI can accurately predict self-reported race, even from corrupted, cropped, and noised medical images, often when clinical experts cannot, **creates an enormous risk for all model deployments in medical imaging**.\n\nEmphasis added.\n\nThe paper opens with:\n\n>Bias and discrimination in artificial intelligence (AI) systems has been studied in multiple domains,1,  2,  3,  4 including in many health-care applications, such as detection of melanoma,5,  6 mortality prediction,7 and algorithms that aid the prediction of health-care use,8 in which the performance of AI is stratified by self-reported race on a variety of clinical tasks.\n\nIt seems to be about the potential for AI to be racist. From the discussion section at the end of the paper:\n\n>Although the ability to accurately detect self-reported race from highly degraded x-ray images is not meaningful on its own, this ability is important in the larger sociotechnical context that AI models operate in for medical imaging. One commonly proposed method to mitigate the known disparity in AI model performance is through the selective removal of features that encode sensitive attributes to make AI models “colorblind”.35 Although this approach has already been criticised as being ineffective, or even harmful in some circumstances,36 our work suggests that such an approach could be impossible in medical imaging because racial identity information appears to be incredibly difficult to isolate. \n\nI'd say the paper is pretty conclusively about the \"threat\" of neutral AI detecting racial differences which are politically inconvenient.\n\nI do thank you for making me look at the actual paper. I would have belived your comment otherwise, it almost sounds plausible.\n\nhttps://www.thelancet.com/journals/landig/article/PIIS2589-7500(22)00063-2/fulltext",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2022-05-25 13:38:28",
                            "replies": [
                                {
                                    "author": "fugee99",
                                    "body": "Isn't this more a \"face detection does bad on Asian faces because it was trained on white faces\" kind of concern than a \"computers aren't woke\" concern?",
                                    "score": 9,
                                    "depth": 3,
                                    "timestamp": "2022-05-25 15:55:28",
                                    "replies": [
                                        {
                                            "author": "Funksloyd",
                                            "body": "The way the article is worded, it sounds more like the latter. The computer is doing incredibly well, but somehow that's seen as a problem.",
                                            "score": 12,
                                            "depth": 4,
                                            "timestamp": "2022-05-25 16:30:02",
                                            "replies": [
                                                {
                                                    "author": "gorilla_eater",
                                                    "body": "Do you not share any of the concerns around highly advanced AI?",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-25 18:20:46",
                                                    "replies": [
                                                        {
                                                            "author": "Funksloyd",
                                                            "body": "Oh definitely, but \"AI might be able to see race\" is the least of them. It's also kinda ironic that people are concerned that this AI isn't colourblind, when colourblindness is supposedly racist too.",
                                                            "score": 5,
                                                            "depth": 6,
                                                            "timestamp": "2022-05-25 19:46:15",
                                                            "replies": [
                                                                {
                                                                    "author": "violet4everr",
                                                                    "body": "But that can absolutely be a problem in areas / situations where you want an AI to be colorblind? Seems completely fair to me.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-05-26 20:59:22",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Funksloyd",
                                                                            "body": "It could be a problem in some specific areas, but I don't see why that's the case here. The article opens with\n\n>The miseducation of algorithms is a critical problem; when artificial intelligence mirrors unconscious thoughts, racism, and biases of the humans who generated these algorithms, it can lead to serious harm. \n\nBut how is that framing even relevant, except to pander to a certain audience? Like, what is the bias here? Since when is \"whites, blacks and Asians have barely perceptible differences in bone structure\" a common source of bias?",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-05-26 22:25:46",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "violet4everr",
                                                                                    "body": "What do you mean “the case here”? This is a stellar example of something that could have grave consequences in other situations: if you need a colorblind AI and this AI isn’t colorblind because it picks up something we can’t and changes it’s way based on that- then that’s a massive issue.\nThey aren’t saying that in their particular case it’s an issue, but they are using their findings as support for this being a thing that can happen. It’s super interesting. \n\nI genuinely don’t understand what you mean with “how is the framing relevant”. It’s not new framing, AI can and is affected by bias. Think about the electric soap dispensers that were trained only with white hands and ended up not responding to darker skin colors. \nThe audience they are pandering to is people who are in machine learning? Lol. They have to give the relevance of unintentional machine learning, and they did that well.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-05-27 03:50:53",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Funksloyd",
                                                                                            "body": ">It’s not new framing, AI can and is affected by bias\n\nBut that's not what's happening here.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-05-27 04:17:24",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Redditributor",
                                                                                                    "body": " If I have a situation where the solution should have no consideration of x and I don't include x in my dataset but x ends up there anyways then my methodology and goals have diverged.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-02-17 15:10:26",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Funksloyd",
                                                                                                            "body": "Wow this is a blast from the past.\n\n\n>If I have a situation where the solution should have no consideration of x...\n\n\nBut in this situation x was the entire point of the study! ",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2024-02-17 15:25:25",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Redditributor",
                                                                                                                    "body": "Lol all the fun of ai alignment googling of Reddit can take you places. \n\nI think this situation is pointing out that an AI could use such ability to successfully gain information that influences its decisions - and we certainly will have situations where we don't want that.",
                                                                                                                    "score": 1,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2024-02-17 19:21:42",
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Funksloyd",
                                                                                                                            "body": "I could be wrong about this, but I believe this is a fundamental trait of deep learning - the \"black box\" issue. So maybe this is an interesting example of that wider phenomenon, but it's also only a very, very narrow part of that wider problem. If we don't like not knowing what things a deep learning system is factoring in, then we just shouldn't use deep learning for anything of any import, ever. \n\n\nJust to add something, you said:\n\n\n>If I have a situation where the solution should have no consideration of x *and I don't include x in my dataset*\n\n\nBut note that x was included in the dataset. They gave it medical images of people, and people have races. ",
                                                                                                                            "score": 1,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2024-02-17 23:03:06",
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Redditributor",
                                                                                                                                    "body": "Okay I get your point. It's not like the ai is particularly likely to specifically use this random hacky way to randomly start race sorting in situations where that's counter productive for no reason if you don't ask it.\n\n\nIt's my understanding that this specific study was designed because of a statistically significant racial difference in failure rates of chest x-ray based AI diagnosis and treatment.\n\nBasically their point seems to be that hiding race from the machines may be untenable",
                                                                                                                                    "score": 2,
                                                                                                                                    "depth": 15,
                                                                                                                                    "timestamp": "2024-02-18 01:27:33",
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Funksloyd",
                                                                                                                                            "body": "Do you know if those failure rates were caused by a lack of POC representation in the training data? \n\n>It's not like the ai is particularly likely to specifically use this random hacky way to randomly start race sorting in situations where that's counter productive for no reason if you don't ask it.\n\nWell I'm sure there are some real dangers where the question has been poorly asked. Like if you ask an AI to sort criminal offenders by their likelihood of reoffending, it might take race into account, even though you don't want it to (of course, human judges do this too).",
                                                                                                                                            "score": 1,
                                                                                                                                            "depth": 16,
                                                                                                                                            "timestamp": "2024-02-18 20:12:29",
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Redditributor",
                                                                                                                                                    "body": "Not sure but seems possible -  i think they wanted to see if it's guesses about race (even something like melanin levels somehow subtly inferred in a way) are causing it to 'hallucinate' incorrect solutions -  so it's got a lack of data on certain people but does the race correlation and uses that to make poor unrelated recommendation based on race?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "timestamp": "2024-02-19 03:40:44",
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "sadiecat777",
                                                    "body": "You don’t understand what you’re talking about. Maybe read the article first? Learn a little about ML? Then you can have strong opinions and tell everyone about them. \n\nThe model accurately predicting race was an *unintended* consequence of training the model. Because of the nature of deep learning, elucidating the mechanism for this is a very hard problem to solve. The researchers are simply saying they don’t know why the model can discern race yet, and are offering caution for any ML tool used in a clinical setting in the future.",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-26 00:27:08",
                                                    "replies": [
                                                        {
                                                            "author": "Seasfuckdoll",
                                                            "body": "This is what I got from the article and paper as well. Idk where the other people that think the \"computers aren't WOKE\" are coming from. It is just a confusion as to why that is happening and trying to prevent the algorithm from drawing conclusions that we know are false. Plus they are trying to analyse this study across different fields......things that all researchers do in our day and age.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2022-05-26 03:28:41",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "fugee99",
                                                    "body": "You don't seem to understand why that's a problem but still have a strong opinion about it.",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-25 20:10:41",
                                                    "replies": [
                                                        {
                                                            "author": "Funksloyd",
                                                            "body": "Do I have a strong opinion?\n\nWhy is it a problem?",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2022-05-25 20:24:56",
                                                            "replies": [
                                                                {
                                                                    "author": "Seasfuckdoll",
                                                                    "body": ">Why is it a problem?\n\nCause it is misled, as others have already pointed out.",
                                                                    "score": 3,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-05-26 03:29:14",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Funksloyd",
                                                                            "body": "What do you mean? It sounds like it's incredibly accurate.",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2022-05-26 04:48:52",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Seasfuckdoll",
                                                                                    "body": "[Read this answer if you are interested in why I mean that](https://www.reddit.com/r/samharris/comments/uxlet8/comment/i9zixj2/?utm_source=share&utm_medium=web2x&context=3)",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2022-05-26 05:10:53",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Funksloyd",
                                                                                            "body": "Nothing in any of those comments tells me how it's been \"misled\".",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2022-05-26 15:59:56",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "milkermaner",
                                    "body": "| our study showed that medical AI systems can easily learn to recognise self-reported racial identity from medical images, and that this capability is extremely difficult to isolate. We found that patient racial identity was readily learnable from medical imaging data alone, and could be generalised to external environments and across multiple imaging modalities. We strongly recommend that all developers, regulators, and users who are involved in medical image analysis consider the use of deep learning models with extreme caution as such information could be misused to perpetuate or even worsen the well documented racial disparities that exist in medical practice. Our findings indicate that future AI medical imaging work should emphasise explicit model performance audits on the basis of racial identity, sex, and age, and that medical imaging datasets should include the self-reported race of patients when possible to allow for further investigation and research into the human-hidden but model-decipherable information related to racial identity that these images appear to contain. |\n\nThis is the conclusion I saw and from what I can read, it says that the AI is good at figuring out races based on the information given to it. And that we're still not sure why. This could potentially be used to make wrong conclusions on things we know that already exist. And finally that they want to include race information in future test in an attempt to figure out why the AI can come to the conclusions it does.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2022-05-25 17:17:50",
                                    "replies": [
                                        {
                                            "author": "Seasfuckdoll",
                                            "body": "Yeah OP seems to be drawing conclusions from their own biases projected on to the study. It is not political inconvenience but rather the AI drawing well-known wrong conclusions from data that the researchers think it shouldn't be looking at.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2022-05-26 03:35:00",
                                            "replies": [
                                                {
                                                    "author": "Funksloyd",
                                                    "body": ">AI drawing well-known wrong conclusions\n\nSounds like maybe you've got your own political bias here?",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-26 04:51:13",
                                                    "replies": [
                                                        {
                                                            "author": "Seasfuckdoll",
                                                            "body": "Well it is written in the article and the paper that the AI is doing so and they don't know why etc. Things already mentioned above",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2022-05-26 05:07:34",
                                                            "replies": [
                                                                {
                                                                    "author": "Funksloyd",
                                                                    "body": "What are the \"wrong conclusions\"?",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-05-26 05:13:46",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "milkermaner",
                                    "body": "Sorry when I said paper, I read the article, and that's how I interpreted it, I'll have a look at the paper now and get back to you.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2022-05-25 13:53:34",
                                    "replies": []
                                },
                                {
                                    "author": "Seasfuckdoll",
                                    "body": ">I'd say the paper is pretty conclusively about the \"threat\" of neutral AI detecting racial differences which are politically inconvenient.\n\nIt is not political inconvenience but rather the AI drawing well-known wrong conclusions from data that the researchers think it shouldn't be looking at. At on top of that, they are trying to include the advice of researchers from other fields as well. Something that is all too common in research and academia.\n\nEdit: A word",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2022-05-26 03:37:14",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gorilla_eater",
                    "body": "What does it mean for an AI to \"respond appropriately\" upon identifying a person's race?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2022-05-25 18:13:39",
                    "replies": []
                },
                {
                    "author": "Flaky-Illustrator-52",
                    "body": ">the intrusion of politics into science\n\nI actually think this is a great concern and a monster that really needs a light shined on it. [Politics is why a special brand of Lamarckism prevailed over Darwinism in the Soviet Union](https://www.smithsonianmag.com/science-nature/when-the-soviet-union-chose-the-wrong-side-on-genetics-and-evolution-23179035/), and detractors of it were purged (edit: sent to gulags and/or \"disappeared\"). These purged detractors were more correct in hindsight than their counterparts though, scientifically speaking.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2022-05-25 23:54:17",
                    "replies": [
                        {
                            "author": "Seasfuckdoll",
                            "body": "You are right on that. But our research is relatively a free and open space, where questioning is often allowed and encouraged. So it is not anywhere near as it was in the Soviet Union. Though yes seeping in of politics into research is a big concern.\n\nAnother point that I would like to raise is the politicisation of scientific findings. And specifically the factions that bring up non-research related topics in to question it, or try to politicise it to gain a political following (trying to divide people with misinformation). Not political movements that are based on the findings of research and support it, but the ones that oppose it using reasons that are non-academic and unfalsifiable.\n\nBoth of these points are justified if one looks at the shit-storm that was the political maneuvering around covid. From claiming that there was no chance that it was developed in a Chinese lab (even though that was FAR from conclusive) and that Covid itself was a hoax/mask weren't necessary (or any version of that).",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2022-05-26 03:59:37",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "well-ok-then",
            "body": "Would be interesting if it can also predict birth month too. Scanning … Libra detected",
            "score": 2,
            "depth": 0,
            "timestamp": "2022-05-26 09:54:39",
            "replies": []
        },
        {
            "author": "atrovotrono",
            "body": "\"Hand wringing\" is pretty dismissive, I think it's a reasonable concern. I oppose racial profiling on humanist/libertarian/individualist-ish grounds, and don't think it becomes okay once we build a machine to do it rather than a human. We need to be careful our AI's aren't doing things, unbeknownst to us, which we would consider wrong if humans did them, especially as those AI's end up having more and more effective control over more and more areas of life. Dismissing those concerns is reckless at best when we can feel the technopticon rising up around us every day.",
            "score": 3,
            "depth": 0,
            "timestamp": "2022-05-25 16:01:25",
            "replies": []
        },
        {
            "author": "Seasfuckdoll",
            "body": "The amount of people that comment without reading the study or the paper is astounding. Or maybe it isn't, given that it is Reddit. But one would think that since this part of the web prides itself on being more contrarian and intellectually honest, they would actually read the article and study before commenting.",
            "score": 3,
            "depth": 0,
            "timestamp": "2022-05-26 04:09:07",
            "replies": [
                {
                    "author": "zemir0n",
                    "body": "Thanks for your comments on this post.  Sorry you're getting downvoted.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2022-05-26 08:10:21",
                    "replies": [
                        {
                            "author": "Seasfuckdoll",
                            "body": "I disturbed the hivemind??...idk. It's life",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2022-05-26 10:35:13",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sadiecat777",
                    "body": "This sub is full of hysterical people, consumed by the “culture wars,” that don’t read the articles, have little knowledge of what they’re talking about, and who can’t wait to pounce on the latest example of “THE WOKE LEFT BAD.” \n\nThis entire thread is very concerning and eye-opening to me, because machine learning is a field that I happen to be somewhat educated in. It’s embarrassing that Sam Harris has cultivated these types of people as fans, with such anti-intellectual and incurious minds. It really makes me question my own opinions on Sam.\n\nThanks for commenting all over this sub, and getting the word out that many commentators are simply unjustified in their reactions to this article.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2022-05-26 11:36:58",
                    "replies": []
                },
                {
                    "author": "TaoZenDollars",
                    "body": "If you assume people haven't read it simply because they don't agree with your take on it you will have an inflated sense of how many commenting on it haven't read it.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2022-05-26 09:03:17",
                    "replies": []
                }
            ]
        },
        {
            "author": "arandomuser22",
            "body": "the whole ai race debate made no sense to me, it was  a hypothetical like \" if a self driving car had no choice but to run over a white or black person who should it chose..\n\nand im just thinking wow what a shitty AI that you cant just program it to not run over people in the first place, like honestly is that even a realistic scenario that would even EVER occur? like have you seen a human driver who ran over someone say \" oh it was between a black or white perrson and i chose to run over the white person. it just dosent exist- i just think these hypotheticals are designed to gin up culture war takes for no reason",
            "score": 3,
            "depth": 0,
            "timestamp": "2022-05-25 16:13:03",
            "replies": [
                {
                    "author": "oversoul00",
                    "body": "A human driver probably doesn't have the computational capacity to consider the options like an AI would. \n\nIf a car stopped in front of you would the AI be running off an algorithm that prioritized swerving into a guard rail, slamming into the car in front of you or swerving into another lane that may or may not have traffic? A human would be running on instinct in the heat of the moment but an AI would be running off preprogrammed priorities. \n\nI'd assume we'd tell the AI that the guardrail is the correct choice, now let's say it's cars on either side of you, now what? If you are going to hit a car which car should you hit? The AI will have the time to factor in all kinds of data that a human wouldn't, like maybe the safety data associated with each vehicle. That sounds pretty ethical but it could be another factor altogether and that has to be fed to the AI.  \n\nFrom a human perspective it'd be like if time slowed down and you were faced with some variation of the trolley problem wouldn't it? \n\nI'd agree that choosing between a black or white person is probably a little outlandish but it's not hard to imagine some variation of the issue at hand.\n\nWe'd have to essentially build the AI instinct from the ground up and the question is what do we prioritize.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2022-05-26 03:52:23",
                    "replies": []
                },
                {
                    "author": "Seasfuckdoll",
                    "body": "The debate was over our collection of sample data that was largely white/western oriented. That is why they needed data from other races and cultures. For better and accurate results. Facial recognition for example was skewed in the favour of people with lighter skin being recognised much easily that people with darker skintones.\n\nEdit: Added the last clause",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2022-05-26 04:02:20",
                    "replies": []
                }
            ]
        },
        {
            "author": "Flaky-Illustrator-52",
            "body": "Is it really racist if it's correct a high percentage of the time though? Pretending that someone's category of genetic constitution/race is no different than another's has its place, but pretending it doesn't matter at all in the field of medicine is just dumb. The smallest details of the body matter",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-05-25 23:44:50",
            "replies": [
                {
                    "author": "Seasfuckdoll",
                    "body": "I don't think that is what the article or the study says. To quote another comment:  \n\n\n>it says that the AI is good at figuring out races based on the information given to it. And that we're still not sure why. This could potentially be used to make wrong conclusions on things we know that already exist. And finally that they want to include race information \\[form experts from other fields\\] in future test in an attempt to figure out why the AI can come to the conclusions it does.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2022-05-26 04:06:16",
                    "replies": []
                }
            ]
        },
        {
            "author": "Kr155",
            "body": "How is this hand ringing. The study is about trying to figure out what mechanism the ai is using to determine race. Even when they tried to control for physical differences the ai was still getting the correct answer. \n\nDo we understand why we need to know this mechanism to know that this is going to be a useful diagnostic tool?",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-05-26 12:47:33",
            "replies": []
        },
        {
            "author": "TaoZenDollars",
            "body": "Objective facts can be racist 🤔",
            "score": 0,
            "depth": 0,
            "timestamp": "2022-05-25 18:40:16",
            "replies": [
                {
                    "author": "Seasfuckdoll",
                    "body": "No. And that is not what the article or the paper says",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2022-05-26 04:00:13",
                    "replies": [
                        {
                            "author": "TaoZenDollars",
                            "body": "I think it is. Your impression of the article isn't the only one possible.\n\nIt seems to me that the author isn't really concerned about \"hidden bias\" so much as the fact that race can be reliably predicted by an AI from x-ray images.\n\nIt reminds me a lot of the sort of reactions I've seen from people when they heard about machine learning algorithms that could reliably predict unknown reported mental states from fMRI images of known reported mental states. Some people found this deeply disturbing because they just didn't like the idea that our thoughts are indeed dependent upon brain activity; they want the mind to be somehow independent from the brain because of this is not the case it's hard to imagine the former surviving the death of the latter.\n\nI think there's something similar going on here, but the thing they're afraid of being affirmed here is that race isn't merely an arbitrary social construct.\n\nI e even see some of the same exact objections. For example, I heard many people attempt to downplay the significance of the reported mental state predictions ok the basis that they were merely \"reported mental states\" as though this rendered the entire study insignificant. In this thread I see at least one person raise the exact same objection; that the algorithm was predicting people's _reported_ race in an apparent attempt to shield the cherished \"race is an arbitrary social construct\" narrative.\n\nAlso, t seems to me the article conflates the x-ray study with other studies in which there might have been some genuine bias involved (though some of the examples linked to in the article are _not_ the clear cut cases of _racial_ bias corrupting algorithms they're presented as).",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2022-05-26 09:23:48",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KingstonHawke",
            "body": "Headline of the thread is a little misleading. \n\nIt’s important people know this is dealing with self-reported racial identity. Not any inherent ideas about race.",
            "score": 0,
            "depth": 0,
            "timestamp": "2022-05-26 04:44:06",
            "replies": [
                {
                    "author": "TaoZenDollars",
                    "body": "Did you suppose there were pale skinned blue eyed blonds identifying as blacks? 🤔",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2022-05-26 21:01:46",
                    "replies": [
                        {
                            "author": "KingstonHawke",
                            "body": "Tell me you are an idiot without telling me you are an idiot.",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2022-05-26 21:11:17",
                            "replies": [
                                {
                                    "author": "TaoZenDollars",
                                    "body": "You're resorting to ad hominem nonsense.\n\nUntil you can do better, I win.\n\nTry again.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2022-05-26 21:13:36",
                                    "replies": [
                                        {
                                            "author": "KingstonHawke",
                                            "body": "No. I’m refusing to explain the obvious to a complete idiot that might actually be trolling me.\n\nNow go take whatever you think you won and see how much they’ll give you for it at your local pawn shop.",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2022-05-26 21:18:29",
                                            "replies": [
                                                {
                                                    "author": "TaoZenDollars",
                                                    "body": "Wrong answer.\n\nYou're just being uncivil, which violates the rules of this forum.\n\nYou have just insulted me personally, rather than presenting an in good faith argument for your position.\n\nIf this sub has any credibility, you shall be admonished by moderation and possibly banned.\n\nI don't really care about that though.\n\nI just find it interesting that you can't support your position with argument or evidence, just ad hominem attack.\n\n🤔",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-26 21:26:37",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Seasfuckdoll",
                    "body": "True as well.",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2022-05-26 05:14:48",
                    "replies": []
                },
                {
                    "author": "Funksloyd",
                    "body": "How does it know their self reported racial identity?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-05-26 22:32:41",
                    "replies": [
                        {
                            "author": "KingstonHawke",
                            "body": "It’s AI that’s been trained by humans to be better than humans at seeing common traits (and differences) between white black and yellow people. \n\nSo it’s basically looking at body parts and saying “this is more amongst black people” or “this is more common amongst yellow people”. Makes sense that if we do that with noses and eyes, that a more sophisticated tool could do the same thing with less visible body parts.\n\nIt’s fascinating, but not nearly as remarkable as the very misleading title makes it seem. I actually wonder if most people (including OP) even at least skimmed the article.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-05-27 06:13:27",
                            "replies": [
                                {
                                    "author": "Funksloyd",
                                    "body": "It's true that the article isn't \"*entirely* hand wringing\", but I think it is weird how it opens with talk about AI racial bias, as if this is an example of that and some kind of big problem. Imo like you say, the finding is more fascinating than worrying.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-05-27 14:23:37",
                                    "replies": [
                                        {
                                            "author": "KingstonHawke",
                                            "body": "The AI racial bias part is very important to understand because in the past when we’ve tried to use AI in this way, we’ve gotten really inaccurate results. It speaks to how when we program AI, even if we don’t think we’re being very racially biased, those biases sneak into the algorithm anyway.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2022-05-27 16:08:22",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "YourFairyGodmother",
            "body": "No, AI can't distinguish race, not based on _anything_.  That's because race is a _social_ concept with _no biological basis_.  The very idea of “race” is a lie: The American Society of Human Genetics, the largest professional organization of scientists in the field, said in an essay “The science of genetics demonstrates that humans cannot be divided into biologically distinct subcategories.”  The traditional concept of different races of humans as biologically separate and distinct is bullshit. This is validated by many decades of research.   \n\nThere is a “broad scientific consensus that when it comes to genes there is just as much diversity within racial and ethnic groups as there is across them.”  The Human Genome Project has confirmed that the genomes found around the globe are 99.9 percent identical in every person. The very idea of different “races” is nonsense.  \n\nStanford scientists examined the question of human diversity by looking at the distribution across seven major geographical regions of 4,000 alleles, the different “flavors” of a gene. They found that over 92% of alleles were found in two or more regions, and almost half of the alleles studied were present in all seven major geographical regions.  If separate racial or ethnic groups actually existed, we would expect to find “trademark” alleles and other genetic features that are characteristic of a single group but not present in any others. However, the 2002 Stanford study found that only 7.4% of over 4000 alleles were specific to one geographical region. Furthermore, even when region-specific alleles did appear, they only occurred in about 1% of the people from that region! Thus, there is no evidence that the groups we commonly call “races” have distinct, unifying genetic identities. \n\nThe big brains at MIT need to be aware of  cognitive scientist George Lakoff's demonstration that simply using the word “race,” even when criticizing racism, actually reinforces the false belief that human beings belong to fundamentally different groups.  That’s because the more a word is used, the more that certain brain circuits are activated and the stronger that metaphor becomes.  So please, MIT, get your fucking shit together. \n\n\nEthnicity is real, and what the AI is picking up on is almost certainly ethnicity, wrongly thought to be the same thing as race.  There are indeed minor differences between ethnic groups, between populations, but there is no such thing as “race”—only racism. And the consequences of racism—from the African slave trade to the European genocide of First Nations in the “New World” to Nazi Germany to today’s refugees—are horrific.   So please, MIT and everyone else, please please please stop propping up the bogus and pernicious idea of different human races.",
            "score": -3,
            "depth": 0,
            "timestamp": "2022-05-26 11:54:42",
            "replies": [
                {
                    "author": "Funksloyd",
                    "body": "I mean, is ethno nationalism better than racial nationalism? If I were to list off a bunch of ethnicities which I don't like or which I think are inferior, is that any better than just saying that I don't like coloured people?\n\nSeems like you're just introducing a euphemism treadmill.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-05-26 22:30:44",
                    "replies": [
                        {
                            "author": "YourFairyGodmother",
                            "body": "> ethno nationalism better than racial nationalism\n\nThe point is that there is NO \"biological nationalism\" nor is there any such thing as \"ethnic nationalism.\"  \n\nI'm a white guy of northern/western European ancestry.  So is my next door neighbor.  We could be more genetically dissimilar to each other than we  each are  to a random Asian, or more genetically similar to a random African than we are to each other.  Ethnicity is _sort of_ what scientists - geneticists, anthropologists, etc -  refer to as \"populations,\" but looking at populations, there is SO much blurriness and non-specificity that very often one can only say \"this person _probably_ has North African ancestry, but the same markers that lead to that conclusion are found widely in Greek, Turkish, and middle Eastern populations.\"  \n\nIn summary, there are no well defined \"race nations,\" there are no well defined \"ethnic nations,\" and any randomly selected  pair of people share 99.99% of their genes, and the 0.01% that may be different cannot be attributed to any particular place of origin.  Genetic variaations which are limited to one region tend to be rare within that region, variaions that are common within a region tend to be shared across the globe, and most differences between individuals, whether they come from the same region or different regions, are due to global variants. \n\ntl;dr:  the problem is nationalism itself, the very common but mistaken notion that one is a member of some (imagined) nation and that other (imagined) nations are  inferior to yours.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-05-27 07:56:50",
                            "replies": [
                                {
                                    "author": "Funksloyd",
                                    "body": "Re your tldr, I don't disagree, but doesn't that make the plea for people to talk about ethnicity rather than race kind of pointless? It's not the word that people use that's the problem, the attitude is. \n\nRe the rest of it, I think this is still such a ineffectual way of fighting racism. For one it just flies in the face of common lived experience. Yes, there are times when it's hard to tell whether someone's from southern Europe or northern Africa - that doesn't mean people (and now machines!) can't easily tell the difference between black and white and Asian Americans. It also does nothing to stop a racist from talking about populations instead of races or ethnicities. Hell, maybe they even believe that southern Europeans are inferior too. Indeed, Nazi racial theories differentiated whites into a bunch of different sub groups.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-05-27 14:46:34",
                                    "replies": [
                                        {
                                            "author": "YourFairyGodmother",
                                            "body": " >the plea for people to talk about ethnicity rather than race \n\nWhat plea?  I don't recall making any such plea.  Nor would I, when IMO the problem is the very idea that people who don't look like you are fundamentally different in some way that matters.   \n\nThis is way simplified but:  Our ancestors who left Africa two million years ago had brains that evolution  had  shaped to answer the challenges of dealing with things and animals.  The anterior portions of our brains, where all the social domain processing occurs, evolved over the subsequent million+ years, as the challenge that faced us was us.  By the time modern humanity came on the scene about 200,000 years ago, evolution had given us brains with pretty amazing social skills.  But human society at that time was comprised of  small bands of hunter gatherers.  And so it would remain until only about 10,000 years ago, when we started farming and building cities.  Our brains really suck at dealing with the challenges posed by societies (ethnicities that are numerous and  visually different than our own.  That manifests in, among other ways, as distrust and even animosity, and more fucking nasty behaviors.   Many of us are stupid and ignorant fucks who tend to not even much use what half-ass social skills we do have, instead interacting with the world mostly under the influence of the more ancient portions of our brains, what psychologists call \"our lizard mind.\" (I have to stop here but I encourage you to look up reputable articles  about political alignment and brain structure.  My  fairly recent comment history has some links to such articles, including a very interesting one where the researchers claim to have turned conservatives into liberals, albeit temporary and in a very limited scope.  \n\nThe tl;dr this time is that racism is kind of built into many of  us and at a fairly fundamental level. Defeating racism is a very very very big challenge and I dont know how to go about it except maybe on an individual basis. But then, many people are far more imaginative than I am ,- maybe somebody will figure it out.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2022-05-27 17:08:54",
                                            "replies": [
                                                {
                                                    "author": "Funksloyd",
                                                    "body": ">What plea? \n\nYour first comment:\n\n>The big brains at MIT need to be aware of cognitive scientist George Lakoff's demonstration that simply using the word “race,” even when criticizing racism, actually reinforces the false belief that human beings belong to fundamentally different groups. [...] So please, MIT and everyone else, please please please stop propping up the bogus and pernicious idea of different human races.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-27 17:39:13",
                                                    "replies": [
                                                        {
                                                            "author": "YourFairyGodmother",
                                                            "body": "That's not a \"plea for people to talk about ethnicity rather than race.\"  I said nothing therein regarding ethnicity.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2022-05-27 19:25:46",
                                                            "replies": [
                                                                {
                                                                    "author": "Funksloyd",
                                                                    "body": "I feel like you're being a bit disingenuous - right after you said that, you also said \"Ethnicity is real, and what the AI is picking up on is almost certainly ethnicity\". \n\nBut whatever. What word should they have used instead of race or ethnicity?",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-05-27 19:38:36",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "oenanth",
                    "body": "> The American Society of Human Genetics, the largest professional organization of scientists in the field, said in an essay\n\nI've read those statements and similar ones.  They're full of politically contrived messaging and none of their arguments are relevant to how infraspecific categorization is actually practiced.  Go ahead and pick out what you consider the strongest argument from that particular statement so I can explain to you its irrelevance.\n\n>They found that over 92% of alleles were found in two or more regions, and almost half of the alleles studied were present in all seven major geographical regions. If separate racial or ethnic groups actually existed, we would expect to find “trademark” alleles\n\nThis is dead wrong, if only for the simple fact that we don't have comprehensive genomic sequencing for the vast majority of organisms with infraspecific designations.  So this 'expectation' has no basis in zoological practice.  Infraspecific categorization is not based exclusively on genetic sequences, for the simple fact that we have no idea what most genes do and how they relate to the selective phenotypic differences used to categorize populations.  Only looking at the presence of alleles is also misleading: if one allele is present in 1 % of one population, but 99% of another; it's present in both populations and yet can still indicate significant trait differences.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2022-05-27 22:11:43",
                    "replies": [
                        {
                            "author": "YourFairyGodmother",
                            "body": "If you can give a rigorous and thorough argument why race might be a valid scientific concept, please do so.  Until I see that brilliant exposition, I'm going to go with the scientific consensus that race is a social construction.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2022-05-28 08:39:50",
                            "replies": [
                                {
                                    "author": "oenanth",
                                    "body": "If your baseline argument is simply uncritical appeal to authority even when the flawed basis is specifically articulated, I'm mystified why you ever thought it worthwhile to cite any empirical facts.  \n\nThere are various definitions of race within biology (geographic, ecological) none of which are incompatible with human population structure. An ecotype for example is defined as a population (or subspecies or race) that is adapted to local environmental conditions.  How is that incompatible with human race?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2022-05-28 11:56:04",
                                    "replies": [
                                        {
                                            "author": "YourFairyGodmother",
                                            "body": "Still waiting to hear your argument that biological race is a valid scientific concept.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2022-05-28 18:33:45",
                                            "replies": [
                                                {
                                                    "author": "oenanth",
                                                    "body": "I provided an ecological definition of race.  If you're unaware of any incompatibility therein with human population structure, and yet still refuse to accept human race then you're arguing from an article of faith and no scientific argument can undo that.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2022-05-28 20:43:54",
                                                    "replies": [
                                                        {
                                                            "author": "YourFairyGodmother",
                                                            "body": "No, you didn't.  You gave one one loose description of a poorly defined notion of race.  I'm still waiting, but not expecting.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2022-05-30 05:58:17",
                                                            "replies": [
                                                                {
                                                                    "author": "oenanth",
                                                                    "body": "The *Encyclopedia of Genetics, Genomics, Proteomics, and Informatics* defines an ecological race as follows:\n\n>  A distinctly adapted group of an organism without sexual isolation from the ancestral form\n\nErnst Mayr in his *Animal species and evolution* defines ecological race as follows:\n\n> Local populations that are particularly conspicuously adapted to a local habitat are often referred to as \"ecological races\"\n\n\n*Fundamentals of Biogeography* define geographical races and ecological races:\n\n> *Geographical races* either live side by side and may grade into each other, or else live separately (that is, have a disjunct distribution). An example is the **human species** that has marked geographical racial variations - Amerindian, Polynesian, Asiatic, European, African, and so on. *Ecological races* have different genotypes and phenotypes, are interfertile with numerous intergrades in zones of contact and live together (have sympatric distribution)\n\nDo you take issue with these definitions as well?  What components do you believe they are lacking?",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2022-05-30 11:17:10",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "adr826",
            "body": "Its not that AIs may be secretly racist. Its that there may be implicit biases that cant be detected in the code and this can lead to bad outcomes for people. AIs are notoriously bad when it comes to black people. It leads to all kinds of increasing inequalities whether facial recognition software or computerized policing AIs have been very bad for blacks. If we are somehow programming into our AIs a way to determine race even when we are trying to exclude its a problem. Its not hand wringing. There are real dangers for black people where computers are being used. Its just a fact.",
            "score": 1,
            "depth": 0,
            "timestamp": "2022-05-28 21:22:15",
            "replies": []
        }
    ]
}