{
    "post_title": "CMV: Political polarization and job loss from AI are the greatest threats facing our American Republic in the coming years, but this could be turned around with a bipartisan, grassroots push to link UBI adoption with AI & robotics.",
    "post_timestamp": "2025-05-03 11:44:05",
    "last_comment_timestamp": "2025-05-03 15:16:09",
    "time_difference": "3:32:04",
    "comments": [
        {
            "author": "DeltaBot",
            "body": "/u/Apprehensive-Let3348 (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/1ke0rxj/deltas_awarded_in_cmv_political_polarization_and/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-03 15:16:09",
            "replies": []
        },
        {
            "author": "MercurianAspirations",
            "body": "Even if you're right, the more imminent threat must then be the upper classes, who, realizing everything that you've laid out here, will make moves to pre-empt the spread of any such ideology or movement even if it means completely destroying democracy. The billionaire class will never let such as thing as UBI come to pass as it would deprive them of, as you put it, wage-slaves. So if they realize that this is what is going to happen they will take every action necessary to prevent it from happening",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-05-03 12:18:36",
            "replies": [
                {
                    "author": "Apprehensive-Let3348",
                    "body": "Why would they want to? Their base of wage slaves isn't going anywhere; they are simply being replaced with robots, and can now be expanded at-will.\n\nLet's say that they implement an annual tax on AI usage, such that the business pays whatever they were previously spending on paying employees, and then added an additional 1-5% of annual revenue to secure against future growth. Under that system, you can buy twice as many robots as you had employees and triple your profits in the first year while selling your products to the same customers for full price, and then pay the tax and still come out with doubled profits.\n\nLooking to the future, that same business could use that excess profit to buy more AI units and grow the business, receiving ever-increasing profit margins as they produce more, *as long as there are still enough people with money around to buy the products.* That can only happen if this plan is implemented, which is why it brings *everyone* together.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-03 12:34:05",
                    "replies": [
                        {
                            "author": "MercurianAspirations",
                            "body": "Because they care about power as much as they care about profit. An empowered middle class that lived comfortably through UBI is a threat to their power",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-05-03 13:03:11",
                            "replies": [
                                {
                                    "author": "Apprehensive-Let3348",
                                    "body": "It isn't a threat to their power; it is a *check* to their power. In fact, this is the explicit benefit of having a strong middle class in the first place: it is the only thing that allows Democratic power to exist, by acting as a check against greedy Aristocrats turning into Oligarchs (we can vote them out).\n\nArguably, we the People have a stronger Democratic seat of power than we have ever had, as our voting base has never been larger or more diverse in the history of the US. We have the power to make this happen, but only together. Separately, this polarization will tear our Republic apart. Together we rise, separately we fall.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-03 13:30:16",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Own_Government7654",
                    "body": "Shucks. This is it then. Wrap it up humanity.  We'll never be able to come together and topple our ever changing man-made social hierarchies. If only we could outnumbered the wealthy more than our existing 100 to 1, only then might we stand a chance against these literal billionaire Gods.\n\n*picture of elon with his shirt off*",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-03 12:35:25",
                    "replies": []
                }
            ]
        },
        {
            "author": "kyngston",
            "body": "the world is competing at multiple levels.  citizens of a country are competing for jobs and compensation, and would benefit from UBI.  at the same time, countries are competing against each other, and restrictions that hinder the development of AI makes it more likely to lose on the international stage.  \n\nhow would the world be different, if the US decided that the development of nuclear weapons should be slowed out of concern for its impacts to society, and Germany developed the weapon first?\n\nAGI has the potential to be more impactful than the invention of nuclear weapons.  Any country that can be the first to develop and control it will have a huge advantage over every other country",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-03 12:40:29",
            "replies": [
                {
                    "author": "Apprehensive-Let3348",
                    "body": "I'm not proposing for the slowing of AI development, not at all! In fact, this post was inspired by another post that suggested banning AI development. I think that AI will--and should--continue advancing. \n\nFurther, I think that my plan to tax businesses based upon replacement of workers with AI will actually lead to an *increased* rate of development, because if we base an annual tax upon the prior year's employee cost plus a small percentage (1-5%) to secure against inflation and future growth (perhaps subtracting the cost of the AI units?), then they could buy 2-3 times as many AI units and produce significantly more products at a lower cost. This drastically increases their profits, such that they are more than overperforming by the end of the year, and the tax is a drop in the pond. \n\nThis provides a strong incentive for businesses to encourage AI development, reduces the incentive for people to discourage its development (as the economic issues disappear), and creates a system that *supports* the adaptation of AI by businesses.\n\nETA: It's also the only way that I see those businesses continuing to be able to grow, like they want to: as more people become unemployed, they won't have enough customers to support any growth. That is why the tax needs to grow as a percentage of their gross revenue: so that the UBI can accommodate more consumers.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-03 12:53:37",
                    "replies": [
                        {
                            "author": "kyngston",
                            "body": "two companies in different countries are competing in the same market.  both can replace workers with AI, but one is forced to redirect a portion of their profits into UBI for the displaced workers, while the other is free to reinvest in the company. \n\nwhich company has the advantage?  which company has more incentive to fund AI development?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-03 13:00:44",
                            "replies": [
                                {
                                    "author": "Apprehensive-Let3348",
                                    "body": "The one with UBI, because guess who is going to be the target of strong tarrifs from everyone else if they try this? For the most part, the upper class isn't made up entirely of fools.\n\nIf they forced everyone out of the country due to unemployment, leaving only the AI and businesses exporting to other countries, then other countries would both have to take in the refugees and deal with their impossible-to-compete-with margins. \n\nThe natural response would be massive unilateral tarrifs on the country choosing to expel their middle class--both as a means of protecting local businesses and paying for the care of refugees--and then the subsequent collapse of whatever is left of the upper class, as there is no more local economy to hold them up without exports.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-03 13:45:19",
                                    "replies": [
                                        {
                                            "author": "kyngston",
                                            "body": "we’ve got a similar situation with climate change.  its an existential threat to the survival of humanity.  you would think that countries would unite to stop the worst greenhouse gas emitters.  \n\nyet thats not happening….  why?",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-03 14:40:17",
                                            "replies": [
                                                {
                                                    "author": "Apprehensive-Let3348",
                                                    "body": "That's just it: climate scientists by-and-large agree that the effects will be devastating, but humanity and life at-large will survive it. It's the media playing up the story for engagement that turns it into an apparent existential threat. Humans have survived in the arctic, in the desert, in the tropics, anywhere, and everywhere on Earth--in every climate--for centuries. We are the ultimate generalist survivors.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-03 14:43:42",
                                                    "replies": [
                                                        {
                                                            "author": "kyngston",
                                                            "body": "we are already witnessing the impacts of climate change.  once in a lifetime natural disaster are just annual events now\n\nand yet there is no political will to do anything about it.  \n\nbut here you think countries will rise up to take action against countries that don’t offer UBI to their own citizens?",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-05-03 14:46:26",
                                                            "replies": [
                                                                {
                                                                    "author": "Apprehensive-Let3348",
                                                                    "body": "Certainly so, yes, because they have no other immediate options. It isn't out of some sense of moral superiority that they would enact unilateral tarrifs. It is because their local businesses would not be able to compete with imports, and their resources would be extremely strained with that big of an influx of refugees. Their own economies would collapse if they *didn't* all enact tarrifs.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-05-03 15:09:46",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "unhinged_centrifuge",
            "body": "What about climate change?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-03 13:02:22",
            "replies": [
                {
                    "author": "Apprehensive-Let3348",
                    "body": "I think it is definitely a threat in the longterm, and something that does need to be addressed, but I believe that this polarization is a *much* more imminent threat to civilized society. \n\nClimate change is going to cause some extreme stress on society in the next 100-200 years; there may even be mass migrations of humans towards the poles as temperatures shift and water-levels rise. \n\nHumans, being the generalist survivalists that we are, will endure, but it's going to be rocky either way. Would it not be better to have this society thing in a reformed, improved state before we have to start dealing with the worsening effects from all of that?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-03 13:39:16",
                    "replies": []
                }
            ]
        },
        {
            "author": "Objective_Aside1858",
            "body": "Oh this again\n\n\nOk OP, let's do some math:\n\n\n* What UBI rate would you set?\n* How much would taxes need to be increased to pay for that?\n* How many voters are going to support that?\n\n\nAbsent an actual post-scarcity economy, UBI will never happen. Nowhere near enough voters would support \"their taxes going to support the lazy\", or whatever the slogan that can be astroturfed against it",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-03 14:02:33",
            "replies": [
                {
                    "author": "Apprehensive-Let3348",
                    "body": "Okay, I support this line of argument; let's throw some numbers around.\n\nAnnual tax for *businesses* calculated by the current year's employment cost burden, minus the prior year's employment cost burden, minus the cost any purchased AI units, plus 3-5% of reported revenue to secure against future growth and inflation.\n\nBegin with a rate of $40,000 per year to those who are shown to have been laid off due to being replaced with AI, or who can otherwise show that their unemployment is a direct effect of AI adoption by businesses. As this grows, AI takes more jobs, and more people enter the system, it transitions into a proper UBI where everyone gets a set amount that would be roughly equivalent to the median wage (currently $42,000).\n\nThis smooth transition would also allow us to be more precise about what exact values would work best once we reach proper UBI, and would reduce feelings of resentment towards those receiving it in the interrem, because their trade--their means of putting food on the table for their family--was directly taken away from them and others can start to see AI coming for their own. I think people would support that, behind the right candidate. \n\nETA: AI *is* coming for their jobs in the course of time, though it may be many years yet for some careers. Is it not better to embrace that reality in a positive way? I really do think people will be more than ready to support this once AI begins to take factory worker jobs.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-03 14:17:42",
                    "replies": [
                        {
                            "author": "Objective_Aside1858",
                            "body": ">Begin with $40,000 a year to those who are shown to have been laid off.... due to AI\n\n\n\n\n.....\n\n\n\n\nWhat do you think the \"U\" in UBI stands for?\n\n\nYou're going to get *even less* support for \"a welfare program for people that can't adapt to the future\"",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-03 14:32:16",
                            "replies": [
                                {
                                    "author": "Apprehensive-Let3348",
                                    "body": "Did you miss the part of my comment where I argued for exactly how it *would* adapt into UBI over time? Or the part where I gave values both before and after it was a true UBI? There is no adaptation to be made with AI; that is the entire point of its design. \n\nAnd again: it's a tax on businesses, not individuals. Yea, I'm certain people will support this when those same people start being laid-off in droves. \n\n\nI thought we were going to do some math. What happened to that line of argumentation? I was intrigued.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-03 14:34:50",
                                    "replies": [
                                        {
                                            "author": "Objective_Aside1858",
                                            "body": "Ok, so you have unemployment with extra steps that inventivizes people not to seek more employment \n\n\nLet's say it impacts 5% of the population in the United States, or 8.5 million out of ~170 million working adults\n\n\n8.5 million x $40 K is $340 billion, annually. Or ~20% of total current revenues. Which will decrease, since 5% of the working population isn't paying income tax any longer \n\n\nAnd since people are being paid not to work, that number will increase, while revenues decrease \n\n\nYeah, goooood luck getting that sold when the current safety net programs are about to be brutally cut back",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-03 14:44:52",
                                            "replies": [
                                                {
                                                    "author": "Apprehensive-Let3348",
                                                    "body": ">Ok, so you have unemployment with extra steps that inventivizes people not to seek more employment \n\nWhere would you suggest a factory worker look for a job when factory owners start looking to make the change en masse? Change field entirely, and learn an entirely new skillset, only for that job to be automated too 2 years later? That simply does not stand up to reason. \n\n\n>Let's say it impacts 5% of the population in the United States, or 8.5 million out of ~170 million working adults\n\n>8.5 million x $40 K is $340 billion, annually. Or ~20% of total current revenues. Which will decrease, since 5% of the working population isn't paying income tax any longer \n\n>And since people are being paid not to work, that number will increase, while revenues decrease \n\nYou neglected to take the tax on businesses into account, but I appreciate the number to start with. So, if that 5% of the population is laid off as a result of AI, then the businesses that made the change will essentially pay the cost of those employee's annual salaries, minus the cost of any AI units they purchased that year, and all businesses will be taxed (let's go high) 5% of their annual revenue.\n\nThe Fortune 500 accounts for roughly $18.8 trillion in revenue as of 2024, and 5% of that is going to come out to $940 Billion in revenue alone. That helps to offset the early adoption being paid for by the government (as it is subtracted from the tax), and still leaves plenty to distribute to the people who had their livelihood taken away. \n\nThat's without taking into consideration that the individual businesses doing the replacing will *also* have the additional minor burden of paying the cost of the former employee's salaries directly for a year, which would add more to the pool.\n\nEdit: Actually, partial !delta because this has illuminated the fact that--after the first year--revenue would drop back to the 5% level. That tax on businesses would necessarily have to rise, equal to the unemployment rate.\n\nETA: To add on to this, I'm thinking that the real starting rate is likely to be closer to 30%, because--historically--that is around the point where people start rioting in the streets and trying to overthrow governments. Let's try to aim just a little below there, and keep improving on this plan in the meantime.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-03 15:00:41",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Apprehensive-Let3348",
                                                    "body": "Partial !delta, because this line of reasoning has illuminated the fact that the business tax on revenue would have to rise alongside the unemployment rate in order for this to make economic sense. While I still believe it to be possible, that does make it harder to sell to businesses and the upper class, and is something I had not considered. \n\nOn the other hand, it does give the innovative businesses time to profit highly off of the low-cost labor in the process, before the tax goes up. This may also help regulate how many people are still employed after UBI gets implemented in-full, who would effectively become the upper class.\n\nETA: The rest of my math is in the other comment, I had to make this one to properly award the comment.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-03 15:15:26",
                                                    "replies": [
                                                        {
                                                            "author": "DeltaBot",
                                                            "body": "Confirmed: 1 delta awarded to /u/Objective_Aside1858 ([11∆](/r/changemyview/wiki/user/Objective_Aside1858)).\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-05-03 15:16:09",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}