{
    "post_title": "AI is ruining education",
    "post_timestamp": "2025-05-09 11:58:32",
    "last_comment_timestamp": "2025-05-15 03:34:04",
    "time_difference": "5 days, 15:35:32",
    "comments": [
        {
            "author": "westgazer",
            "body": "It’s bizarre to me that people want to use this to teach themselves things. Its outputs aren’t getting more accurate—just the opposite. Of course this will happen as GenAI will train from GenAI generated slop. We’re definitely cooked though with how dependent people are on a glorified guess-bot.",
            "score": 28,
            "depth": 0,
            "timestamp": "2025-05-09 15:55:42",
            "replies": [
                {
                    "author": "Journeyman42",
                    "body": "A lot of students would rather just get the assignment done with as little effort as possible instead of actually learn something",
                    "score": 11,
                    "depth": 1,
                    "timestamp": "2025-05-09 21:18:49",
                    "replies": [
                        {
                            "author": "Gilgamesh_78",
                            "body": "They don't understand that learning something is the actual point of the assignment. They think the goal is to write down stuff, not to understand it.",
                            "score": 8,
                            "depth": 2,
                            "timestamp": "2025-05-10 02:02:30",
                            "replies": [
                                {
                                    "author": "Journeyman42",
                                    "body": "They think the goal is getting a 100% score",
                                    "score": 8,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 08:26:53",
                                    "replies": [
                                        {
                                            "author": "RoadDoggFL",
                                            "body": "I was always a terrible student because I thought the purpose was to learn, so I always struggled with homework that covered what I already knew. I don't really see how kids who think the goal is to get a 100% are even wrong.",
                                            "score": 6,
                                            "depth": 4,
                                            "timestamp": "2025-05-10 10:30:50",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PaintingThat7623",
                                    "body": "I'm both a teacher and a student at the moment.\n\nI've been a teacher for 7 years. I was forced to do Uni by my principal because of some law changes - they now require masters degree. The uni teaches me stuff that I either already know, or is useless theory not applicable in my work anyway.\n\nSo I see both ends of the spectrum. As a teacher I hate how my students cheat their way through assignments. As a student I have no interest in learning useless information, so instead of spending 4 hours on a single assignment I use AI.\n\nThe problem (at least in my country) is that we have a seriously overloaded education system, it has no regard for your time. At the very least 50% (personally I think it's much higher) is something my students (or me) won't use a single time in real life.\n\nThat's the problem. Education should be useful and interesting. Since it's not, people cheat and I don't blame them.",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2025-05-11 07:25:54",
                                    "replies": []
                                },
                                {
                                    "author": "syndicism",
                                    "body": "Factory model of education at work, basically. \"Make X number of widgets as an input, get rewarded with score Y as an output.\" \n\nAnd given that many students end up being given a lot of busywork in their younger years they're not necessarily even wrong.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 15:39:26",
                                    "replies": []
                                },
                                {
                                    "author": "BeltOk7189",
                                    "body": "If you understand learning is the goal, even something like AI giving inaccurate information can still be effective for some people.",
                                    "score": -2,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 09:48:49",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Much-End-3199",
                            "body": "Because learning isn't the value gained from education in our decaying capitalist society, it's the opportunities being educated can get you that is the value. If the barrier to getting out of poverty, or even just improving your situation, is test scores and gpas  then of course people are going to cheat. Especially the younger they are, not fully understanding the full scope of the issue. If getting an A in a class was the difference between getting into a school or not and a student doesn't feel they can get that, they'll cheat. Education was sold to my generation as the way to get a good paying job. It wasn't about the learning it was about the earning.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-13 14:32:29",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "syndicism",
                    "body": "The problem is that identifying AI slop as AI slop requires you to already have relatively advanced skills in academic reading, writing, and research. \n\nMany people don't, and so they are less likely to challenge the AI slop because it's 1) convenient, 2) seems \"good enough\" at first glance, and 3) correctly mimics the written aesthetics of professional-level academic language even if the content is inaccurate. \n\nEducators tend to be nerds who did well academically, and are thus more skeptical. But you have to put yourself into the mindset of someone who has a functional 6th grade reading level in everyday life, doesn't have extensive experience writing research papers, and doesn't have the time, skills, or inclination to skeptically fact-check every piece of information that the machine feeds them.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-05-10 15:37:13",
                    "replies": [
                        {
                            "author": "PaintingThat7623",
                            "body": ">Educators tend to be nerds who did well academically, and are thus more skeptical.\n\nThere's actually something interesting here I've noticed.\n\nAt my school there are basically 2 kinds of teachers - the ones that did well at school and liked it so much that they stayed there as a teacher and the ones that didn't do well at school, didn't like it and stayed there to \"make things right\".\n\nThe first group are typically very angry, controlling and drunk on power they have over other students. they frequently say things like \"pff, when I was at school I was far better at x than you are\".\n\nThe second group are - by far - the best teachers. Empathetic, because they've been there, they experienced bullying by students and/or teachers first hand.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-05-11 07:30:41",
                            "replies": []
                        },
                        {
                            "author": "Hot-Pretzel",
                            "body": "You nailed it!",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-10 21:03:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MourningCocktails",
                    "body": "Oh my god… I had reviews come back on a paper I submitted, and a reviewer took major issue with something I said about a particular disease. Except his objections were blatantly wrong. I couldn’t even figure out where he was getting his facts from because they made 0 sense… until about a month later when I was trying to look up something else. Dude had never heard of the disease and based his entire criticism off of the incorrect summary GoogleAI gives.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-05-10 11:25:15",
                    "replies": []
                },
                {
                    "author": "Oreoskickass",
                    "body": "I’ve seen the google AI answer a search completely wrong. It was for something legal, too! Always check the actual results!",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-05-10 14:54:15",
                    "replies": []
                },
                {
                    "author": "Next-Transportation7",
                    "body": "I don't know what you are using, but Gemini 2.5 Pro is excellent. Now I have kids, and I am teaching them to use AI, but they still focus on critical thinking, discussion, and pedagogy (i.e. you get better at writing by writing, better at reading by reading, math by doing mathematics etc.) Also, I explain to them they should still care about developing their own brain even if AI can do everything faster and more precisely. Take pride in being a human and be the best you are capable of being.\n\nI also go heavy into philosophical discussion, especially religion. We are Christians. We discuss other worldviews and think through why we believe what we believe.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-05-10 10:23:24",
                    "replies": [
                        {
                            "author": "Hot-Pretzel",
                            "body": "That's awesome what you're doing with your kids, but I think you're in the minority in approaching AI this way.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-10 21:04:30",
                            "replies": [
                                {
                                    "author": "Next-Transportation7",
                                    "body": "Probably, but I talk to everyone I can as often as I can, especially at work just letting people know where we are in AI and where I think it's heading. I wish our society and government would step up.\n\nOne of my big concerns is China and the U.S. are in a car going 100 mph off of a cliff and fighting over the driver's seat. Additionally, AI companies are focused on being first and best and maximize profits and then another sub section of the corporate have a transhumanist worldview and feel compelled to usher in a post human world.\n\nIt's so dangerous. I want average people to get a vote because this tidal wave is coming and there comes a tipping point where you can't reverse the damage or slow down.\n\nWe are sacrificing our dominion as humans for the pursuit of maximum optimization, efficiency, and logical reasoning as if that is all that matters in this life (it isnt).",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 21:42:03",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Vegetable-Two-4644",
                    "body": "I mean, to be fair I've learned a lot of coding from it and have managed to use that knowledge to create my own app",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-05-09 17:12:57",
                    "replies": []
                },
                {
                    "author": "WorkingTemperature52",
                    "body": "If you are actually using it to teach you things, and not just give you the answer, AI is a very effective tool for most subjects. It’s when you want it to answer specific questions such as solving an equation where it fails. Answering things at a conceptual level and explaining them is where AI is actually pretty accurate.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-05-11 00:35:15",
                    "replies": []
                },
                {
                    "author": "CallidusFollis",
                    "body": "Smart people are certainly using AI to become more efficient, more capable, more productive. They're able to discern good and bad results. \n\nThe same can't be said for the rest.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-05-12 18:39:08",
                    "replies": []
                },
                {
                    "author": "Abstract__Nonsense",
                    "body": "It’s better at some things than others, but for many subjects it can be fantastic for working on your conceptual understanding. Besides that point I don’t know why it would be “bizarre” to you that people would want to use it. Being able to ask questions about a subject in plain language to address things you’re confused about is pretty valuable, and plenty of people don’t have access to a personal tutor 24/7 as an alternative to that.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-05-12 18:53:18",
                    "replies": []
                },
                {
                    "author": "tobias_hund",
                    "body": "I think it's a great tutoring tool. It can teach math wonderfully by sourcing resources or explaining it in a different manner. \n\nGreat for foreign language learning (generating interesting dialogue - tailored to the user's preferences)\n\nSure, it can be used to get through a course if there is no real testing on the material. But it's a great tutor when used properly.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-05-13 19:42:42",
                    "replies": []
                },
                {
                    "author": "tollbearer",
                    "body": "I almost never find its ouputs are wrong, and when they are, it's usually very obvious where and why its producing a hallucination, because there isnt a clear answer to the question or its sparsely represented in its dataset. Ask it about categorical stuff, and it will be accurate 99.9% of the time.",
                    "score": -4,
                    "depth": 1,
                    "timestamp": "2025-05-09 18:19:49",
                    "replies": [
                        {
                            "author": "lavegasepega",
                            "body": "It’s really, really bad at any real world math. Astonishingly bad.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-05-09 18:56:25",
                            "replies": [
                                {
                                    "author": "Archetype1245x",
                                    "body": "If you use a reasoning model (o4-mini-high is what I typically use; alternatively, Gemini 2.5 pro is also great, but has worse LaTeX formatting), it's actually pretty solid. \n\nFor example, I've used o3-mini-high (and o4-mini-high after it released) to help myself learn various aspects of combinatorics and to double-check my homework assignments over the past few months. I think it has only given me incorrect logic or a bad answer 2-3 times over the course of the semester, which represents less than 3-4% of the total combinatorics questions I've asked. Additionally, the incorrect answer/logic is usually just a simple mistake that it fixes once I mention it looks wrong.\n\nIt certainly does help if you generally already know the material somewhat and are using it as a tool for clarification.\n\nThat said, I saw you mentioned in your other comment further down that you have it generate problems, and I can see how it might struggle here.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-13 20:57:54",
                                    "replies": []
                                },
                                {
                                    "author": "tollbearer",
                                    "body": "I've found it to be excellent. No idea what model you're using, or what math you're talking about.",
                                    "score": -3,
                                    "depth": 3,
                                    "timestamp": "2025-05-09 19:15:51",
                                    "replies": [
                                        {
                                            "author": "lavegasepega",
                                            "body": "I teach 5th grade special education. So I ask it to generate problems for me sometimes and I’m amazed how many errors there are. Not high level math, at all.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2025-05-09 19:19:56",
                                            "replies": [
                                                {
                                                    "author": "tollbearer",
                                                    "body": "are you talking about arithmetic? It's terrible at arithmetic for the same reason you would be if you weren't allowed to think about it. remember, it has to one shot the response without a calculator or any way to to do it in its \"head\". It literally guesses the results of addition. you can use o3 and ask it to verify the results and it will get more accurate, but it has no actual way to access a calculator, so dont rely on it for arithmetic. It's really good at pure math though.",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-09 19:29:37",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "lavegasepega",
                                            "body": "Chat GPT 4o",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-09 19:17:20",
                                            "replies": [
                                                {
                                                    "author": "sidagikal",
                                                    "body": "You need a reasoning model like o3.",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-10 00:27:52",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "tollbearer",
                                                    "body": "Well, thats the weakest current model, but even still I rarely encounter problems it cant handle even doing pretty complex math? What do you find it struggles with? Are you doing cutting edge math research with it?",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-09 19:24:47",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Oreoskickass",
                            "body": "I asked it a pretty cut-and-dry legal question, and it got it wrong! This was the google search AI, so I don’t know how other ones work.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-05-10 14:55:36",
                            "replies": [
                                {
                                    "author": "tollbearer",
                                    "body": "the google search one is really, really bad. They're not making any money from it, so it's a very cheap model.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 15:23:59",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ocashmanbrown",
            "body": " it’s worth pointing out that the problem isn't AI itself. It's how we choose to integrate it into the classroom. Right now, many schools are still treating AI like some sudden, uncontrollable force instead of treating it like a tool that can be managed, just like calculators, phones, or even Google itself when it first became widespread.\n\nThere are simple ways to reduce students misusing AI. Make more of the work classroom-based and discussion-heavy. Have students explain their thinking verbally or in writing. Require handwritten drafts or in-class brainstorming before allowing typed work. Create assignments that AI can't easily complete (personal connections, classroom-specific references, critical thinking questions).\n\nAlso, I think it is essential that we teach students how to use AI responsibly. Most adults I know use it for lesson planning, writing and editing emails, reports, resumes, coding help and debugging, language translating, etc. etc.\n\nI don’t think we're heading toward total brain-mush dystopia. I think we're facing a challenge that schools and educators can meet if we start adapting. We should be teaching how to use AI as a tool. It isn't going to disappear.",
            "score": 37,
            "depth": 0,
            "timestamp": "2025-05-09 13:35:56",
            "replies": [
                {
                    "author": "phoenix-corn",
                    "body": "So the teacher at my university who says all the things you just said claim that their students now totally would never use AI. I sing in the university choir and often sit behind and amongst students. I have watched a student use AI on every assignment in that person's class this term in all sorts of ways that are not allowed by them.",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2025-05-09 16:01:42",
                    "replies": [
                        {
                            "author": "ocashmanbrown",
                            "body": "I think you might have misunderstood my point a bit. I'm not saying students don't use AI to cheat. They absolutely do. My point is that the problem isn't AI itself, it's how we choose to respond to it as educators. We can either treat it like an unstoppable threat and spiral into despair, or we can adapt our teaching methods to make sure students are still learning, even in an AI-rich world.\n\nThat student in your choir using AI on every assignment? That's not a tech problem, that's a classroom management and accountability problem. The solution isn't to ban AI from existence, it's to get smarter about how we structure learning and assessment.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-05-09 16:51:34",
                            "replies": [
                                {
                                    "author": "TarantulaMcGarnagle",
                                    "body": "The problem is AI itself.\n\nNobody asked for it.  We don’t need it.  It is a tool for cheating.",
                                    "score": 11,
                                    "depth": 3,
                                    "timestamp": "2025-05-09 22:29:43",
                                    "replies": [
                                        {
                                            "author": "Archetype1245x",
                                            "body": "Honestly, this is a terrible and naïve way of looking at things, and people who have this mindset are going to be left behind.\n\nI'm going to assume you're talking about LLMs specifically and less about other uses of machine learning, so I won't address those.\n\nIt isn't a \"tool for cheating\" - it's a tool, period. Can it be used for \"cheating\"? Yes. The same way a calculator can be used to cheat on an exam that is supposed to test your ability to add, subtract, multiply, or divide. Are calculators \"needed\"? We can do all of those calculations manually, after all.\n\nMy point is, when utilized properly, and LLM can be an incredibly effective tutor. Alternatively, if you rely on it to do all of your work (or in place of actually learning, to stay on topic for this post), of course you're going to have a bad time. The same can be said for other \"tools.\"\n\nIf you take the time to properly learn the material, LLMs allow users to utilize their time much more efficiently. If you're speaking as an educator - helping students learn how to use LLMs as an aide (rather than an answer machine) will go a long way, as will adjusting your lectures or in-class work such that critical thinking is encouraged.\n\nSimply trying to label it as a \"cheat\" is going to result in students still using it - many of them in a manner that doesn't help them learn.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-13 21:31:44",
                                            "replies": []
                                        },
                                        {
                                            "author": "ocashmanbrown",
                                            "body": "It's also a tool for drafting emails, cover letters, and resumes, writing and debugging code, generating lesson plans and classroom materials, creating study guides, tests, and quizzes, writing objectives, brainstorming, translating text into different languages, translating text into different reading levels, writing SQL queries and Excel formulas, analyzing datasets, turning raw notes into clean documentation, etc., etc.\n\nIt's a great tool for all sorts of things. Students should be taught how to use it properly.",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2025-05-09 23:53:44",
                                            "replies": [
                                                {
                                                    "author": "TarantulaMcGarnagle",
                                                    "body": "I call all of those “adult cheating”.\n\nEverything you just listed instantly became less valuable the minute a machine learned “how to do it”.\n\nI don’t ever want to read an email written by a computer.  If someone wants to tell me something, I want to hear their voice.\n\nAccording to g to your metric, students are learning “how to use it properly”.  I just consider that usage to be cheating.",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-10 08:18:06",
                                                    "replies": [
                                                        {
                                                            "author": "ocashmanbrown",
                                                            "body": "Then you should also include as \"adult cheating\" these things: Spellcheck, calculators, translator apps, resume builders, text-to-speech software, and citation generators. If you define cheating as using any tool that improves efficiency, clarity, or execution, then nearly all modern work is adult cheating. \n\nThe reality is the world runs on augmented work. We use tools to be more efficient with our time. I agree, copy-and-pasting an entire email generated by AI is gross. But if someone has writers block and needs to get a complicated email started, AI can definitely help that person out with ideas.",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2025-05-10 10:15:29",
                                                            "replies": [
                                                                {
                                                                    "author": "level1807",
                                                                    "body": "Spellcheck and calculators don’t replace the entire process of cognition in a task. AI is used in a way that lets students not have a single original thought while completing an assignment, and no amount of interactive guidance and assignment crafting will change that if that’s how they approach any intellectual work. Moreover, even if you do manage to transfer some of these activities into the classroom and dialogue, the skill of writing by itself is crucial in many fields and will get decimated.",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-05-10 11:48:36",
                                                                    "replies": [
                                                                        {
                                                                            "author": "ocashmanbrown",
                                                                            "body": "The key distinction lies in how the tool is used. If a student relies on AI to generate content without engaging with it critically or creatively, then, yes, it becomes a shortcut that undermines learning. But when AI is used to support the thinking process (like overcoming writer's block, organizing ideas, trying ideas out) it can actually help develop skills like problem-solving and critical thinking. And this is where teachers come in, to teach how to use AI as a tool. \n\nThe goal is not for students to replace their own thought processes, but to leverage tools that enhance their ability to communicate more effectively and efficiently. And in the real world, being proficient with these tools is a valuable skill. The future of work will require adaptability, and students should be prepared to work with the tools that will inevitably shape their careers.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-05-10 13:37:41",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "hce_06",
                                                                                    "body": "And they also need to understand that they are not simply passive passengers who “adapt.” They shape the world they’re in, and they need to realize these AI companies are out for one thing: making money.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-05-11 16:01:37",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "level1807",
                                                                                    "body": "What people are trying to explain to you here is that that’s a fantasy. It’s not being used that way and you have absolutely no power to make the students use it that way.",
                                                                                    "score": 0,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-05-10 20:44:52",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Archetype1245x",
                                                                                            "body": "It's only a fantasy if educators keep approaching LLMs as if they are some terrible, unavoidable, \"cheat.\"\n\nSure, you can't control the usage outside of the classroom, directly anyway. That said, you absolutely do have control over what happens in your classroom (barring administrative BS).\n\nThe reality is that LLMs are here to stay, and we need to be adjusting how we approach designing both in-class lessons as well as homework. Homework that consists of just answering questions or writing some generic essay is likely going to be drastically reduced in favor of homework that encourages critical thinking about the subject.",
                                                                                            "score": 0,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2025-05-13 21:48:37",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "level1807",
                                                                                                    "body": "the time that you have inside the classroom is utterly insufficient for any kind of quality education. Be serious and think for more than a second. If you're advocating abolishing the institution of in-school education as currently constituted, to allow for guaranteed 1:1 ratio of students to full-time teachers, then sure, but we all know that's not happening.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2025-05-13 23:54:13",
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "madesense",
                    "body": "> phones\n\n\nWorth noting that many schools (my own included) are banning phones",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2025-05-09 17:32:29",
                    "replies": [
                        {
                            "author": "ocashmanbrown",
                            "body": "which is weird to me. I don't see why students shouldn't be able to use their phones during lunch or breaks. Or before or after school on campus. \n\nWe just have a policy that they can't use them in class. And sometimes we use their phones in class to do Kahoot, Booklet, and Flip. It's pretty simple to enforce. If their phones are put away, no problem. If a phone is out, I take it and they get it back at the end of class or at the end of the day.",
                            "score": -4,
                            "depth": 2,
                            "timestamp": "2025-05-09 18:28:50",
                            "replies": [
                                {
                                    "author": "BIG_IDEA",
                                    "body": "It’s because these anti AI pearl-clutchers are going full fascist to defend what they think is “important education” instead of looking in the mirror and realizing the triviality of the entire educational system.",
                                    "score": -8,
                                    "depth": 3,
                                    "timestamp": "2025-05-09 19:35:46",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SecretSphairos",
                    "body": "There is more to it than that though.  I teach advanced mathematics.  In the last decade there have been a slew of amazing programs that are wonderful for helping teach math.  Even software that allows you to give adaptive or forgiving tests, such as questions that change in difficulty and ward different levels of points, or even just giving them immediate feedback and a second chance at an answer to correct a missed positive or negative sign.  This is all amazing for the progress of education, and it is single handled destroyed by the proliferation of AI.  Simply googling a question can yield an answer now.  So all assignments that can be done outside of class will be cheated on easily.  Leaving little progress unless we do it in class.  Here’s the thing though: In our day, we could find our answers through Google.  We had to figure them out on our own or from someone who did and could explain it.  Even if you copied work, that work had to be done by someone.  We also weren’t given much time if any to work on assignments in class.  So our classes progressed faster.  Immediately that means classes will be slowed down by needing to take away time to do all the assignments in class.  The other consequence is that they won’t get as much practice as we did, because we can be sure any work assigned to be done at home won’t be done by them.  There is also a push to make assignments weighted more than tests now.  At my school the push is do 50/50. So we have students finishing 100% of their work through AI but then can only manage a 20% on their tests.  The thing is, though that 20% test score will get them a passing grade and a diploma.  Since they didn’t really do their work, these essentially failed a test and passed a class.  We then push these through to graduate and the ones who can’t even do that? The guidance puts them in these programs that let them work on them at home and somehow these failures get an entire semester’s worth of education and credit done in a week’s worth of time so they can still graduate.  That 50/50 set up that allows a 20% test score to pass? From my survey of fellow teachers we seem to have only about half of our students actually reaching that that easy pass rate.  The rest either get extra credit opportunities to make it up or those programs I mentioned earlier.  That’s how we have that many students failing at any given point and yet somehow boast graduation rates in the 90’s.\n\nMost of these kids we are pumping out of schools with a diploma are no where near as qualified to have it as those from 00’s, 90’s, or before.  You might as well upgrade every high school diploma from before 2010 to a bachelor’s degree to represent the difference in their intelligence.\n\nIt’s really bad, and if they continue this way… then generations of unqualified people with hardly any academic knowledge will be taking over the workforce.  The only way to combat it is to require teachers to be overly strict or get rid of all the advancements we have made in education and require them all to strictly read and write their work.  When we require these teachers to teach about 33% more students than before though, that leaves a lot of students unseen and able to sneak their phones to do that written work anyways.\n\nThere has to be a change, and the first needs to come from zero tolerance of cell phones in school.  Some counties have implemented this and it has been very effective.  The second needs to come from school issued devices that are heavily secured to prevent any and all access to outside sources.  Even then though, this limits things like research reports for the students because the only way to keep them honest is to take away the access to the World Wide Web that were such a boon of a resource for the students of the 90’s and 00’s.\n\nIt would be great if there was a way to eliminate the access of AI to students, but that would require a concerted effort from the AI companies who quite frankly probably don’t care about any of this.",
                    "score": 11,
                    "depth": 1,
                    "timestamp": "2025-05-09 14:57:25",
                    "replies": []
                },
                {
                    "author": "TarantulaMcGarnagle",
                    "body": "Students have been putting lead in their chromebooks all week because of a tik tok trend called “.3 GPA Activities”.  So it is titled something that is actively stupid, and they copy that behavior.\n\nThe brain mush is already here.\n\nWe are the problem, but AI is a problem on the hands of children.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2025-05-09 22:31:50",
                    "replies": [
                        {
                            "author": "ocashmanbrown",
                            "body": "Sure, some kids are doing dumb things. That's not new. TikTok didn't invent bad judgment, it just broadcasts it faster. Writing students off because a few follow a trend is lazy. A vast majority of kids aren't idiotic.\n\nAI in kids' hands is only a problem if we refuse to teach them how to use it. It's no different than letting kids loose with cars, chemicals, or credit cards without guidance. We will serve them best if we teach them how to use AI.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-05-09 23:57:31",
                            "replies": [
                                {
                                    "author": "TarantulaMcGarnagle",
                                    "body": "Giving a kid a car is not the same as giving him a machine that will remove his ability to think.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 08:19:12",
                                    "replies": [
                                        {
                                            "author": "ocashmanbrown",
                                            "body": "AI isn't like a car. It's more like giving a kid access to a library that talks back, or a calculator that explains its steps. It doesn't act on the world directly; it acts on ideas. AI nothing like car. A car is not a tool that mirrors what we feed it. AI is. We can either pretend kids won't touch it or teach them how to use it well.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-10 10:07:03",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "syndicism",
                    "body": "Time to bring back the blue books! \n\nThe antidote to AI plagiarism already exists and it's very ancient technology -- it's called \"taking a handwritten, open-book (actual books) comp exam in a little blue composition notebook.\"",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-05-10 15:42:13",
                    "replies": []
                }
            ]
        },
        {
            "author": "meteorprime",
            "body": "AI is fucking dog shit for physics.\n\ncan’t even reliably do high school level shit correctly\n\nToday it told me that if you try to compare the buoyancy of liquids: liquids with less density require more weight for you to sink in them \n\nThat’s just fucking wrong\n\nI told it to double check 10 times and it still kept outputting the wrong answer.",
            "score": 7,
            "depth": 0,
            "timestamp": "2025-05-09 18:37:11",
            "replies": []
        },
        {
            "author": "OkShower2299",
            "body": "In law school your entire grade depends upon how well you do on the final exam. In a proctored setting you have to know the material or you do poorly. If cheating on assignments is that big of a deal, time to make grades more dependent on exams. Sorry to kids with bad memory.",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-05-09 23:49:03",
            "replies": [
                {
                    "author": "guyonacouch",
                    "body": "This has been the only legitimate idea I’ve had so far and it is holding my current students more accountable.  However, we’re already seeing kids move to online classes so they don’t have to do anything except copy the tests into AI. Our local community college offers dual credit online courses and teachers of those classes are being guaranteed enrollment and an easy paycheck so many of them are doing nothing to hold those kids accountable. I can’t compete with that because I know if I make my course more difficult to cheat in, kids will just transfer to an easier path and I’m eventually out of a job. \n\nI am constantly reading opinions that teachers need to “teach students how to use AI properly.”  So does that mean that kids don’t need to know stuff anymore?  I know that rote memorization is bad practice but people need to learn and memorize some things don’t they? I’m trying not to be a Luddite but what the hell is proper usage of AI?  Is it exporting any critical thought? AI is absolutely creating problems that we don’t have any legitimate solutions for and I’m starting to worry about what the final 20 years of my career will look like.",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2025-05-10 07:37:02",
                    "replies": [
                        {
                            "author": "YellingatClouds86",
                            "body": "Honestly, I think as educators we need to get BACK to memorizing things.  Learning things/retaining them and then applying them IS what empowerment is all about.  Farming out all the \"facts\" and whatever else to devices is not productive and makes people weak.  Just my two cents.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-05-10 12:16:47",
                            "replies": [
                                {
                                    "author": "syndicism",
                                    "body": "For its flaws, one of the things I admire about the Chinese education system is that they positively assert that being able to memorize information and build an intrinsic foundation of knowledge available \"on command\" is a useful skill that should be developed.\n\nPart of it may just be a natural consequence of the language, where memorization of 3000+ ideograms is a prerequisite for becoming literate. And there are of course drawbacks to a system that invests a lot of time in low-engagement, rote learning. \n\nBut I've noticed that educated Chinese adults in my life are just more likely to have a foundational body of knowledge about things in their field, and that they don't have the same aversion to focusing their time and attention on memorizing large quantities of new information.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 15:57:23",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "syndicism",
                    "body": "You can mitigate the memory issue by allowing students to bring in a page of hand-written study notes. \n\nThey won't know the questions ahead of time, so the notes should be pretty general in nature. You can also make certain reference materials available -- i.e. a physics exam could have some of the relevant formulas written on the board, but without any context about how and when to apply them. \n\nAnd you make the questions more about demonstrating analysis and understanding of the material and less about gotcha questions on minor details. Which is basically good \"test writing\" practice anyways.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-05-10 15:50:49",
                    "replies": []
                }
            ]
        },
        {
            "author": "TheGoshDarnedBatman",
            "body": "Counter point: AI is in fact without benefit.",
            "score": 7,
            "depth": 0,
            "timestamp": "2025-05-09 14:49:21",
            "replies": [
                {
                    "author": "YellingatClouds86",
                    "body": "I mean it's basically destroying the gains of the environmental movement.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-05-10 12:17:06",
                    "replies": []
                },
                {
                    "author": "DAmieba",
                    "body": "This 1000x. Sometimes people go too far in thinking everything has good and bad. I've seen practically zero positive uses of AI and a lot of really bad ones. We should ban it entirely",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-09 16:14:25",
                    "replies": [
                        {
                            "author": "Archetype1245x",
                            "body": "As an easy example, check out how AI has helped various aspects of medical advancement. From things like condition detection to helping better understand the human genome, it's hard to overstate how beneficial it's been.\n\nFor a more personal example, it's been incredibly helpful as a learning-aide for some of the online courses I've been taking. In my Combinatorics course, I've used it to explain certain parts of the textbook in a different manner - often times, I felt that the re-written explanation was better and/or more detailed than what was presented originally in the text.\n\nI can list plenty of other examples, but the point is that there are indeed good and bad ways of utilizing it, as their are with any tool. I can certainly acknowledge that it creates an issue for students who don't care/want to *learn* the material, but for those who DO want to learn - it's a fantastic tool.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-13 22:23:36",
                            "replies": []
                        },
                        {
                            "author": "thicchamsterlover",
                            "body": "I don‘t think so. For research it‘s great to get some pointers when starting the research - maybe even get a quick look into the consensus on a topic (which you then take as a basis for further research).\n\nI tried to disassemble a washing machine some time ago and I just couldn‘t get this one piece off and couldn‘t understand which way it was held on… I asked GPT and it actually gave me an answer where it described the exact mechanism (a plastik hook on the undersite you had to push in) which helped me take it off whithout destroying the mechanism.\n\nAI doesn‘t give answers. But it can give pointers very well.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-05-10 05:11:35",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "iAMtheMASTER808",
            "body": "At least they’re actually doing something. Half my students still barely hand in anything",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-05-09 15:12:04",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Notice wherever this topic comes up, it’s either pro ai or anti ai as if those are the only two options. Stands to reason since people seem to be extremist in all views these days. Nuance is dead. The answer to whether ai is good or bad will depend on the circumstances. If all we’re doing is teaching people to use ai, then all we’re going to get is a bunch of ai operators. You wouldn’t use a self driving car to teach a person to drive. You shouldn’t consider ai a tool and then neglect the tool between your ears.\n\nAlso, if ai could fix this goddamn swipey keyboard autocorrect fucking up every other word, I’d be most grateful.",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-05-09 17:48:36",
            "replies": [
                {
                    "author": "level1807",
                    "body": "FYI, the swipey keyboard already is AI.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-10 20:51:51",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "noooooooooooooooooooo",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-10 20:57:51",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Quizleteer",
            "body": "As a parent with two children (8yo and 9yo) in elementary school, this is a huge concern of mine. Thankfully, they only do pencil on paper writing assignments for now. I don’t give them access to computers or other screen devices at home, thus, they don’t have access to internet. They do have limited use of chromebooks in class for learning programs that I’m ok with. I plan to delay their interaction with generative AI products for as long as I possibly can. As they move forward in school, I intend to make sure they put in the effort to read and complete writing assignments on their own without AI assistance. Obviously, there will be peers that will be using AI as a crutch. I’m sure that my kids’ papers will not read as eloquent or articulate as these classmates. Teachers will likely be able to differentiate between what is student-written and what is AI-generated. How will this affect the way a teacher would grade these assignments? I’m just curious as to how educators will approach this.\n\nEdit: spelling and clarity",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-09 16:18:16",
            "replies": [
                {
                    "author": "Archetype1245x",
                    "body": "It's hard to tell where LLMs will be in a few years - it's already quite good at generating text that fits a specific student demographic, assuming you create a good enough prompt (most kids can't or don't bother to). That said, if a teacher has some pieces of genuine/original work from the student (something done entirely in-class), they can often compare it to the style of writing in a homework assignment and get a solid idea of whether or not the student wrote it. Also, to be fair, the student can do the same thing - give the LLM a few pieces of their original writing and have it use those as a basis for how to write something else - and it will usually spit out something that resembles their writing reasonably well.\n\nI think what we will ultimately see is a fundamental shift in what homework assignments consist of - less direct answers, generic essays, etc, and more critical thinking. It's rough, because doing typical homework assignments still has a role to play, and moving that sort of thing to the classroom means teachers will have less time for other things.\n\nRegardless of what happens, it sounds like you are a parent who cares more than most do, so I'm sure your kids will come out in a great place.\nAlso, you mention specifically writing assignments - it may be worth noting that LLMs can definitely do a lot of harm if utilized improperly (just generating answers) in ANY/every school subject, not just writing. I've seen people completely unable to start a math problem they *should* be able to do, simply because they relied too heavily on LLMs to always start the problem for them. This is especially true for word problems.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-05-13 22:41:25",
                    "replies": [
                        {
                            "author": "Quizleteer",
                            "body": "Thanks for your detailed and well thought out response. Lots of things to think about…and to be fearful of 😬 I hope we can find a way to combat this existential threat before it’s too late. Unless it already is.\n\nEdit: more info; fixed punctuation",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-13 22:56:45",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bunmyaku",
            "body": "My first assignment of the year is a stud word memoir.  They need to come up with a six word sentence that summarizes their view of life.  First assignment of the year, and they were using AI for it.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-09 16:20:38",
            "replies": [
                {
                    "author": "BIG_IDEA",
                    "body": "See, this is a *perfect* example of the type of trivial assignment that *should* be offloaded to AI. \n\nNot using AI on an assignment like this would be a huge mistake.",
                    "score": -2,
                    "depth": 1,
                    "timestamp": "2025-05-09 19:18:36",
                    "replies": [
                        {
                            "author": "Archetype1245x",
                            "body": "Is this sarcasm?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-13 22:42:02",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shrimp123456",
            "body": "My main concern is that it's increasing the gap between good students and bad students. I notice good students are using it for help understanding something, or organising things (both which i see as good uses of AI) while lower level students are increasingly reliant on it for everything. When a pen and pencil assignment comes up, or I ask them to explain something, the difference is really showing.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-09 21:44:20",
            "replies": [
                {
                    "author": "Archetype1245x",
                    "body": "This. 100%.\n\nIf used as a tool to actually aid in the learning/understanding of the material, LLMs are great. If used as an answer-machine or a crutch, they're awful, and they drag down any students who utilize them this way.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-13 22:44:04",
                    "replies": []
                }
            ]
        },
        {
            "author": "Felis-lybica",
            "body": "I hate how AI is being pushed out in schools. AI is not \"just a tool\" when it gives out horribly incorrect information that *sounds good* when you don't know a lot about the subject. A calculator isn't going to give you blatantly wrong answers like (4+4)÷16 = 24. People are using it to replace valuable skills like learning how to research information, or heck, just \"thinking\" and \"doing something you don't feel like doing because it's boring\". \n\n\nKids already struggle with apathy and learned helplessness. How can they possibly survive in \"the real world\" without basic, fundamental life skills of being able to parse information,  think for themselves, even if it doesn't give an instant dopamine hit? Because your cognition and skills are definitely a \"if you don't use it, you lose it\" situation. Unless we're aiming for an uneducated population that just bases all their decisions on vibes and works on an assembly line where all you need to know his how to insert tab A into slot B.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-10 00:42:12",
            "replies": []
        },
        {
            "author": "marcopoloman",
            "body": "My students can't use AI in class. All essays are written in class by hand and dictionaries.  I keep all unfinished work after class. This prevents the use of anything.  Once it is finished I grade it and then they can type it. Then I compare to the written version. If it's changed significantly, they get a zero",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-10 00:53:02",
            "replies": [
                {
                    "author": "kmovfilms",
                    "body": "So you communicate the purpose of this approach to the students? What’s the result so far?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-10 20:45:02",
                    "replies": [
                        {
                            "author": "marcopoloman",
                            "body": "Day one we go over everything. My kids have far higher grades and are better behaved compared to any other classes.  I have the strictest rules and the most kids signing up for my classes. Discipline is not the enemy of enthusiasm",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-05-10 21:18:15",
                            "replies": [
                                {
                                    "author": "kmovfilms",
                                    "body": "I commend you for the approach. Sounds like it conveys your passion and commitment to their learning as well.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-11 03:16:54",
                                    "replies": [
                                        {
                                            "author": "marcopoloman",
                                            "body": "I'm lucky to be at a school that allows me to implement and teach my own lessons and plans.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-11 03:18:30",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Zealousideal-Ease126",
                    "body": "I just pray that there are enough teachers like you that are willing to hold the line on this.  It must be so tempting to take the easy road and let kids short-circuit their future while their brains are still developing.  I genuinely am worried about how uneducated and AI dependent are populace will be in 10-20 years.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-11 21:49:23",
                    "replies": []
                }
            ]
        },
        {
            "author": "FindingLegitimate970",
            "body": "Education is going to be very different going forward. It has to change with AI as a corner stone to the learning process",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-10 00:57:35",
            "replies": []
        },
        {
            "author": "Jellowins",
            "body": "AI is not ruining education. Teachers need to learn how to use AI in the classroom. Teachers your children how to use it in constructive ways. But first, you have to learn the same.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-10 08:11:04",
            "replies": []
        },
        {
            "author": "AggressiveSand2771",
            "body": "Ai is saving me time to enjoy more passionate interests. Taking classes is not gonna pay my bills.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-10 09:54:48",
            "replies": [
                {
                    "author": "ProbablyHomoSapiens",
                    "body": "But not learning the topics of those classes makes them a waste of time. At the age where you're worried about your bills - why attend them if you don't care for what they teach?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-05-12 17:15:35",
                    "replies": [
                        {
                            "author": "AggressiveSand2771",
                            "body": "People are getting in debt to get masters degree just to get paid more.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-14 18:10:37",
                            "replies": [
                                {
                                    "author": "ProbablyHomoSapiens",
                                    "body": "Yes, and in that way classes DO get their bills paid in the long run. And you haven't answered my question",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-15 00:26:11",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "marks1995",
            "body": "It's changing the landscape, but there are ways to prevent the cheating. But it's going to require teachers to get creative and move a lot of the material to in-class work and discussion.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-09 16:08:45",
            "replies": []
        },
        {
            "author": "enfrijoladasconqueso",
            "body": "Perhaps this in a way is wishful thinking but I think AI is the new “calculator.” At some point, calculators weren’t always a tool that teachers let students use. Perhaps they still are. Often we would hear how we have to learn the math and how to do it because “we weren’t going to have a calculator in our pockets” everywhere we went. Turns out that we do have a handy calculator everywhere we go in our pockets and sometimes on our wrist. \nNow, as much as I do believe that a calculator is a good tool it is also important to teach the kids the proper way to use it and to teach them to still know how to do simple math in their head. \nAs a math teacher (middle school), I didn’t mind calculators but we did learn how to work out problems without the calculator and later I would teach them how to use it efficiently. Since scientific calculators are different we would work on correct syntax for each type we had in the given classroom. In my opinion, it worked out well and when calculators were not “appropriate” for some assignments or tests the students wouldn’t mind.\nNow, AI may be a similar tool. As teachers we can learn to navigate this new tool in order to teach our students the appropriate time to use it. I do not think AI will be gone ever, it already is in our pockets much sooner than the calculator ever was so we need to either work with it or be doomed by it.\nIt may be intimidating to grasp it perhaps but nothing is impossible to learn if we give it a try. I’m sure teachers who experienced the introduction of computers and the internet in schools had similar feelings as they weren’t used to it but they got through it.\nMaybe I’m just way off but I do think growth happens when you’re the most out of your comfort zone so maybe AI isn’t all too bad. \nJust my thoughts.u",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-09 19:47:03",
            "replies": [
                {
                    "author": "duperfastjellyfish",
                    "body": "While calculators are amazing for cognitive offloading the computational work, I think it's invaluable to be able to do simple math in your head with at least some degree of accuracy, and especially to train your intuition to detect when a result seems unreasonable. I suppose there's good reasons for why schools do not allow calculators before becoming proficient in arithmetic. \n\nMy worry is that cognitively offloading reasoning, analytical work and using it in domains where you have insufficient knowledge to question its very convincing output, that's when we get in trouble.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-05-10 05:36:56",
                    "replies": []
                }
            ]
        },
        {
            "author": "MuseWonderful",
            "body": "AI is a tool. In the future, AI will not replace humans but humans that use we’ll AI will replace humans that don’t know how to use it. It is inevitable and it is best to teach them early on how to use it effectively.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-09 18:35:21",
            "replies": [
                {
                    "author": "smileliketheradio",
                    "body": "teaching kids how to use AI to better prepare for future job markets ≠ letting kids use AI for every single task and domain you possibly can in a classroom.\n\nhave AI classes. teach kids how LLMs actually work. teach them the difference between generative AI and traditional AI (models used for e-commerce advertising, for example, or, ironically, fraud detection), the difference between genAI and machine learning...\n\nbut why would districts make investments in those kinds of curriculums when theyre the same ones throwing their kids to the wolf in sheep's clothing that is the Chromebook monopoly because it's so (in the short term) cost-effective?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-05-13 13:59:59",
                    "replies": []
                },
                {
                    "author": "meteorprime",
                    "body": "Here’s how you use it effectively: you dont\n\nUnless you’re trying to create a funny script of Donald Trump arguing with a raptor or create a funny picture of Donald Trump riding a raptor. \n\nIt’s dog shit for facts/math/science",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-09 18:37:53",
                    "replies": [
                        {
                            "author": "ShadyNoShadow",
                            "body": ">Here’s how you use it effectively: you dont\n\nEmployers are requiring their workers to use AI today, even though it's only an AI enabled LLM in a very basic larval stage. At a teacher, if it's your job to graduate students who are ready for their next step in life, then showing them what an AI is (and most especially isn't) capable of is essential.\n\nAnd it's dogshit for math and science because it's an AI enabled LLM, basically a really advanced Google. It gives wrong output that looks an awful lot like right output. Unless you already have expert knowledge of what you're asking it to do, you won't be able to tell the difference. And if you have expert knowledge, you should probably just do it yourself.\n\nBut telling the next crop of graduates \"just don't use it\" is doing them a disservice. There were teachers who doubled down on classroom encyclopedia sets and cursive writing in the 90s too. They were also wrong.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-10 07:27:58",
                            "replies": [
                                {
                                    "author": "YellingatClouds86",
                                    "body": "Except not all subjects we teach are vocational based in the way you suggest.  And our entire education system should not be vocational heavy.\n\nK-12 education is about learning the basics.  Teachers are not being given ANY trainings on \"incorporating AI,\" just told to do so. And honestly, introducing it to certain ages before they've mastered/learned basics is counterproductive.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 12:18:50",
                                    "replies": [
                                        {
                                            "author": "ShadyNoShadow",
                                            "body": "They said the exact same thing about computers in the 90a. Word for word. ",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-10 12:27:42",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ConnectAffect831",
            "body": "Education as it is in its current state… is an overpriced scam. In my opinion, that is.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-05-09 18:55:09",
            "replies": [
                {
                    "author": "duperfastjellyfish",
                    "body": "In large parts of the world, education is state ran non-profit organizations. So if they are not making money, what is the scam?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-10 05:43:39",
                    "replies": [
                        {
                            "author": "ConnectAffect831",
                            "body": "In the US. Idk about other parts of the world. The scam is the quality of education and cost.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-10 06:07:58",
                            "replies": [
                                {
                                    "author": "ShadyNoShadow",
                                    "body": "Your solution is to spend less?",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 07:29:23",
                                    "replies": [
                                        {
                                            "author": "ConnectAffect831",
                                            "body": "I don’t claim to have the solution. Some thoughts and ideas: revamp the entire education system to properly match curriculum and cost. Reduce the amount of fees colleges are charging. Not force students to live in dorms and buy meal plans and expensive books they don’t use, restructure programs to be more hands on learning, add certifications/licensure as part of program, incorporate more work programs that help offset tuition, open the door to creative learning rather than a reused content, stop allowing corporations to buy the students and tailor courses through foundation donations, stop allowing foundations to invest or use funds that have no direct benefit to the students, mandate full disclosure to students regarding the entire process by adding financial literacy to orientation… better yet.. add it to curriculum in high schools, lower the interest rates and create a standard funding system… no more unsub, sub, plus, loan, etc. Do not segregate low income from those whose parents make more money because it’s the parents money, not theirs. Treat each student as their own and stop using parent income. If one group of students gets free education, then all of them do. Don’t pick and choose. Offer support services until students are hired and in repayment status rather than tossing them to the streets, create compliance and governance mandating a level of quality, create incentives or certain honors that comes with being an educator and normalize self care and burnout prevention strategies, modernize the delivery, systems, etc. all around to o match our current world. How’s that’s for a start?",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-10 08:23:51",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Distinct_Impression5",
                            "body": "A month cannot go by in my country where the \"education\" is \"free\" (not actually free, but paid by working people taxes), without news about money laundering universities, fake diplomas, etc. All of this while the stuff being taught there does not really correlate with what is the reality in business.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-10 06:11:02",
                            "replies": [
                                {
                                    "author": "duperfastjellyfish",
                                    "body": "Is that legal or are we talking about corruption? Moreover does it happen in lower and trade school, or academia? Academia is not supposed to correlate, its theoretical exploration.\n\nMay I ask which country?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 06:23:14",
                                    "replies": [
                                        {
                                            "author": "Distinct_Impression5",
                                            "body": "Corruption. Depends on what you mean by academia - anywhere from bachelors degrees to god knows where. Instances where so many politicians obtained diplomas without studying. People faking Erasmus trips to pocket money and the list goes on and on. \n\nI get your theoretical exploration comment. However I met multiple students of PhD programmes in finance and taxes who did not know how the tax system works in our country. Make it make sense. Overall I think AI is not as big of a problem as it is portrayed here.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-10 06:33:23",
                                            "replies": [
                                                {
                                                    "author": "duperfastjellyfish",
                                                    "body": "That honestly sounds pretty terrible. I don't have that experience where I live (Norway). AFAIK there are no reported money laundering or financial fraud cases, and my experiences as a student at two different universities is that the quality is very high.\n\nIf someone has a PhD in finance and taxes and don't understand how the tax system in their own country works, that's horrifying to the point of disbelief.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-10 06:41:42",
                                                    "replies": [
                                                        {
                                                            "author": "Distinct_Impression5",
                                                            "body": "I am not surprised, Norway is known for very good education even here (Czech Republic). I think a lot of it has to do with our communist/socialist history imo. Good luck with your studies ☘️",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-05-10 06:52:30",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ConnectAffect831",
                            "body": "Just because something is labeled as non-profit doesn’t mean they’re not making a profit.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-10 08:27:55",
                            "replies": [
                                {
                                    "author": "duperfastjellyfish",
                                    "body": "By \"making money\" I mean that surplus cannot be taken by private parties and must be reinvested in the mission. I think you understood that.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 08:51:19",
                                    "replies": [
                                        {
                                            "author": "ConnectAffect831",
                                            "body": "You’re right.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-10 09:02:59",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok-Confidence977",
            "body": "I don’t see any tail off in the quality of my students as thinkers or people. I have been doing this job at the level of high school science for more than 2 decades. \n\nDiscourse around students in these circumstances usually rings my “ick” bells, and reminds me of the entire history of older humans crapping on younger ones. And I really wish teaching had less of that.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-09 19:29:18",
            "replies": []
        },
        {
            "author": "Interesting-Arm-2503",
            "body": "I think you said it quite well. Not bat shit crazy at all. ",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-09 22:03:56",
            "replies": []
        },
        {
            "author": "apollo7157",
            "body": "Yep. We're totally screwed. \n\nThere really are no good solutions other than completely redefining what education means and how it is done. Even if AI improvement stopped tomorrow it would take decades to fully feel the ripple effects of what has already occurred.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-09 22:34:11",
            "replies": []
        },
        {
            "author": "Lakerdog1970",
            "body": "Oral exams and failing grades are the only answer.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-10 00:30:19",
            "replies": []
        },
        {
            "author": "cosmic_collisions",
            "body": "Our method of teaching will need to dramatically change, essentially (I'm guessing) into discussion/debate instead of worksheet/plug and chug questions. However, that will require a tremendous change in the students and curricula directors.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-10 00:35:02",
            "replies": []
        },
        {
            "author": "mexican_robin",
            "body": "My school allows laptops in class. The students can't stop playing. Yes teachers scold them but they can't stop playing.\n\n Some teachers integrate the PC on their classes others don't. \n\nI think making school projects could work better",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-10 02:27:55",
            "replies": []
        },
        {
            "author": "KitFalbo",
            "body": "To be fair, when the music classes play AI generated animation/music for the kids to dance to, it doesn't set a good example.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-10 09:12:41",
            "replies": []
        },
        {
            "author": "plexluthor",
            "body": "\"You can send me to school, but you can't make me learn.\" If students want to learn, AI is one way to do it, but a kid without AI who wants to learn is also going to be just fine. If you don't want to learn, there's no helping it, with or without AI.\n\nParents who care about learning will help their kids use tools well, whether that is AI or Google or the library. Parents who care only about grades (or about zero marginal cost babysitting) will see AI as a relief since they need to put in less effort. \n\nSo, I agree, but I don't actually think AI is changing much. It's a better tool, but the main problems with education aren't with the tools.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-10 10:08:24",
            "replies": []
        },
        {
            "author": "likecatsanddogs525",
            "body": "AI = 1st Draft\n\nAn AI generated response is not an answer. Prompting is a new skill that can lead to deep and rigorous discovery. If kids are only going one level deep with little effort, you get a weak answer. \n\nThey need to use gen AI more iteratively to get better results.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-10 10:30:18",
            "replies": []
        },
        {
            "author": "Hr192331",
            "body": "Several of our department heads unilaterally decided to make the switch back to paper/pencil (Tx Middle School in Dallas). \n\nStudents have long been willing to expend more effort cheating than actually learning basic skills (exacerbated by technology even in the early 2000’s). Now, we’re sure over half of them are completely reliant on AI. At our magnet school, especially, many students consistently miss a day of instruction each week for some school activity. \n\n“I’ll just do it at home, I concentrate better there anyway”\n\nGood luck buddy. From now on, it’s pencil, paper, and due at the end of class.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-10 15:51:51",
            "replies": []
        },
        {
            "author": "thickmuscles5",
            "body": "I think with good parenting ai can be a tremendously strong tool for studying and learning instead of being a bad influence , other than that 100% it's a bad thing especially if you literally use ai for every single question you get that's when you become stupid lol",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-10 18:18:02",
            "replies": []
        },
        {
            "author": "socialjulio",
            "body": "Schools and parents need real support right now. I wrote “Raising Kids in the Age of AI” to help with this. It’s on Amazon, but if you want a free PDF copy, just DM me.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-11 10:01:35",
            "replies": []
        },
        {
            "author": "Advanced_Addendum116",
            "body": "AI is ruining many things. Almost as if the sales people selling it are lying?!? OMG!",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-11 12:38:53",
            "replies": []
        },
        {
            "author": "wuboo",
            "body": "I’m confused why teachers can’t change the way kids are getting graded. More in-class writing with pen and paper, take home projects that involve way more than ChatGPT spitting out a rote answer, in class graded discussions and oral quizzes, no access to laptops and phones, and so on. ",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-11 18:26:06",
            "replies": [
                {
                    "author": "hce_06",
                    "body": "Just because generative AI exists doesn’t mean the things for which students are using it (to avoid actually learning those skills) aren’t worth learning anymore. \n\nIn other words, your confusion seems to be based on the wholesale acceptance of the notion that this technology should drive every decision educators make when, from the perspectives of many of us, that is the wrong way of looking at it. \n\nThere is still value in, say, writing a paper (on your own) for which you spend time preparing outside of class. The existence of GenAI doesn’t change that.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-11 18:49:02",
                    "replies": [
                        {
                            "author": "wuboo",
                            "body": "There’s value only if students are using their time that way. I don’t know what share of kids are willing to do that, that’s on educators to figure that out and course correct as needed",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-11 19:58:36",
                            "replies": [
                                {
                                    "author": "hce_06",
                                    "body": "It is up to everyone. This GenAI issue affects everyone.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-11 20:06:00",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tvmaly",
            "body": "It will catch up to them. Like muscles that atrophy when not used, their brain won’t improve. My 11 year old daughter refuses to use AI to do her work, but plenty of the kids in her school use it to write essays.\n\nI don’t know how we solve this problem.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-11 19:54:03",
            "replies": [
                {
                    "author": "Zealousideal-Ease126",
                    "body": "Thank you for doing the right thing with your daughter.  \n\nThe effect AI is having on education bums me out so much.  Completely reckless of Sam Altman and co. to release it the way they did, either not considering the effect it would have on education or, much more likely, not caring as long as they go rich.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-11 21:54:18",
                    "replies": []
                }
            ]
        },
        {
            "author": "EmbarrassedTruth1337",
            "body": "I honestly believe most assignments should be handwritten. Doesn't eliminate the problem but it might help. And it would improve the writing some kids have.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-12 03:11:42",
            "replies": []
        },
        {
            "author": "Ting-a-lingsoitgoes",
            "body": "Yeah we’ve really done kids a massive disservice. \n\nI was talking with a student nurse recently who told me writing book reports was a useless skill now. Something to the effect of “did that book report on great gatsby enhance your life? We have AI now”\n\nWhich was when I started explaining that if they didn’t think reading, synthesizing, explaining what they had synthesized, and defending that synthesis was useful, they should keep it to themselves. \n\nAI could be a powerful force for good in the world but in practice I think it’s going to destroy us.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-12 03:29:48",
            "replies": []
        },
        {
            "author": "CallidusFollis",
            "body": "I wouldn't say it's ruining it. It was already kind of ruined. We already saw a tremendous lack of curiosity well before LLM's became mainstream.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-12 18:37:41",
            "replies": []
        },
        {
            "author": "Sunaeydolit",
            "body": "You’re not crazy at all—your frustration is incredibly valid, and a lot of educators feel the same way but don’t say it out loud. The system was already fragile, and now with AI so easily accessible, it’s creating a whole new layer of challenges that we’re not fully equipped to manage—especially in K–12.\n\nThe big issue you’ve touched on is the difference between using AI as a learning tool vs. using it as a shortcut. That line is blurry, and unfortunately, most younger students don’t have the self-regulation to use it responsibly without clear boundaries and guidance.\n\nYou’re also spot on about how older forms of “cheating” often forced us to actually engage with the content. Now it’s just copy-paste, and the result is what you’re seeing: students who don’t understand what they wrote and can’t explain their own answers.\n\nThat said, I don’t think the solution is to block AI altogether—it’s to teach students how to use it ethically and critically. Just like calculators didn’t replace learning math concepts, AI shouldn’t replace thinking. But students need to be taught how to use it with purpose, and that’s where schools are falling short.\n\nThere are platforms like Gradehacker that use AI responsibly to help non-traditional students (like working adults) understand academic material, improve their writing, and develop time management. But it’s always positioned as a learning partner—not a replacement for thinking.\n\nIf we want the next generation to be informed, articulate, and independent thinkers, then AI literacy needs to be a skill, not a crutch. And honestly, it starts with educators like you who are willing to speak up and push for change. You’re absolutely not alone in this.\n\nLet’s keep this conversation going—because you’re right: what we do now will shape the world we live in 10 years from today.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-12 19:47:34",
            "replies": []
        },
        {
            "author": "SawAll67",
            "body": "They are dumming down the young people and children with this AI garbage.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-13 15:24:27",
            "replies": []
        },
        {
            "author": "Altruistic_Reveal_51",
            "body": "Between the attacks on the press, science and higher education in the United States by the Trump Administration, and the proliferation of misinformation on the internet, the use of AI language generators which are subject to hallucinations, I fear we are headed for another Dark Ages where the majority of the population is ignorant and easily manipulated by propaganda, while advances in academics, science, research and medicine stalls.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-14 06:18:13",
            "replies": []
        },
        {
            "author": "MickyFany",
            "body": "education was ruined a long time ago “no child left behind”",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-09 16:09:31",
            "replies": []
        },
        {
            "author": "CO_74",
            "body": "We just need to go back to technology free schools. We taught that way for a few hundred years. It can be done again.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-09 20:07:59",
            "replies": [
                {
                    "author": "ocashmanbrown",
                    "body": "That's like saying we should navigate cross-country using the stars because that worked for a few hundred years too. \n\nAI, like any tool, magnifies intent. In the hands of a thoughtful educator, it's a force multiplier. In the absence of guidance, it can make things worse. But abandoning the tool because we don't yet know how to manage it isn't wisdom. It's fear disguised as nostalgia.\n\nWe're not going backward. That's not how time works.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-05-10 00:10:58",
                    "replies": [
                        {
                            "author": "CO_74",
                            "body": "The tool isn’t in the hands of the educator. It’s in the hands of the student.  I don’t want educators to be without screens and technology. I want students to be without them. \n\nYour analogy is wea, but there is a better one. The tech isn’t akin to navigational tech for sailing. It’s like the hover wheelchairs from Wall-E.  Why make people walk if they can hover around in a chair that makes moving around the spaceship so much easier and faster? Well, because they turn into fat, unmotivated losers incapable of doing much else outside of hovering from place to place. They can no longer walk because they have relied on the tech to do their walking since childhood. \n\nStudent achievement has dropped every year since student screens were introduced into the classroom. It started absolutely plummeting when students began using mobile phones. \n\nTech billionaires are paying thousands in tuition to send their children to tech free schools. And by far, the smartest and most capable students in my middle school are the students whose parents have not yet purchased them a smartphone. \n\nAlcohol and marijuana are legal. But we do not allow children to use them until they reach the age of 21. We have plenty of studies showing the effect that screens have on children. \n\nAnd as far as research-based studies go, there are exactly ZERO that support the idea of increased student screen-time increasing mastery of any state or national standard. Not a single one. The absolute most generous studies show that there is at best, no effect at all with limited screen use. Most studies show that it is detrimental. \n\nThe fact is that chromebooks and screens are used because it is cheaper for districts and more convenient for teachers. It is NOT better for students and there is ZERO evidence to support the idea that it is. There is a mountain of evidence supporting the idea that it is not.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-10 07:44:47",
                            "replies": [
                                {
                                    "author": "ocashmanbrown",
                                    "body": "You're arguing that because some tech use has been poorly implemented, all student-facing tech should be scrapped. We don't banning books because some students read garbage. You've confused correlation with causation and turned a managerial problem into a moral panic.\n\nYes, screens can be harmful when used without structure or purpose. But blaming declining student achievement solely on tech is reductionist. Achievement has also dropped because of underfunded schools, rising inequality, pandemic disruption, and collapsing trust in public education. \n\nYour Wall-E analogy misses the point. Students don't get \"fat and lazy\" from screen use. They disengage when they're given empty tasks and no meaningful reason to think. AI isn't a hoverchair; it's a power tool. Rather than take away the tool, raise expectations and give students real problems worth solving.\n\nAs for screen time, there are different types of screen time. You're lumping all screen time together. As if scrolling TikTok, texting during class, using Desmos to graph functions, writing code in Python, programming a 3D printer and reading historical primary sources online are all the same thing. They're not. There is useful screen time. Screen time that fosters creation, inquiry, collaboration, or problem-solving is categorically different from screen time that just entertains or distracts.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 10:29:42",
                                    "replies": [
                                        {
                                            "author": "CO_74",
                                            "body": "You are welcome to provide any research-based evidence to any of your arguments, not just your theory. I am guessing you won’t do that. \n\nI spent 20 years in IT building and installing the AI workforce technology that’s taking decision making away from the masses and placing it into the hands of the wealthy. I absolutely did not know I was doing it at the time until I watched as employees in industries like mortgage, finance, and customer service were told, “You don’t need to know about that. We can have the computer make that decision for you.”  \n\nTwenty years ago a good mortgage broker handled 50 mortgages at a time, proceed excellent customer service, and made a decent living wage. Now, thanks to workforce management, they handle 300 mortgages, never talk to a soul, and make (adjusted for inflation) less than half of what they used to make. \n\nI sat in those meetings and listened as the tech guys were figuring g out how to squeeze money out of education. They have a fantastic plan, they’re executing it, and you’re falling for it.\n\nYou’re about to be demoted to Chromebook repair specialist for half your pay while kids are taught by a teacher that probably isn’t even a real person with eye-tracking technology on their cameras to make sure they’re watching the correct part of the screen. Believe it or not, that’s how we already monitor workers all over the world. And because the tech companies will buy the testing companies before they implement their plan, the results will show that the kids do better when we keep piling up the technology. They will create an enslaved class that’s not job is to keep the machines that empower the wealthy running well. \n\nIt is absolutely the reason that student achievement has cratered in inverse proportion to the rise of technology in the classroom. You can theorize all you like, but there are few other expectations. Hell, 10 years ago you used to see so many people saying how smartphones were going to be great tools for kids to use in schools / they said the same stuff you’re saying now. Now we have to ban them because students are too distracted. Chromebooks ought to be next. \n\nI went back to school 8 years ago to become a teacher and do what I could to maybe stop all that from happening. I finally switched professions 5 years ago. I dont think I am going to be successful, but “rage against the dying of the light” as Keats said right. \n\nI know you will laugh, point, and tell everyone I am full of shit and that you know better. I hope you’re right. But as a cynical old Gen X-er over 50, I will leave you with a quote from Trent Reznor:\n\n“Bow down before the one you serve. You’re going to get what you deserve.”",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-10 12:08:16",
                                            "replies": [
                                                {
                                                    "author": "ocashmanbrown",
                                                    "body": "You're right that tech has been used to squeeze labor, strip human judgment from decision-making, and serve profit over people. And I don't doubt a word of your experience in IT. But that's not an argument against students learning how AI works. It's an argument for it. The more opaque the systems become, the more essential it is that the next generation can read the code behind the curtain.\n\nThe dystopia you're describing isn't the fault of technology. It's the result of handing tech development and deployment over to people whose only goal is profit. That only becomes inevitable when we raise students to be passive consumers rather than critical users and creators.\n\nI'm not falling for anything. if we don't teach kids how this stuff works, what it can do, what it shouldn't do, and how to push back when it overreaches, then we're handing the next generation over to the worst-case scenario you described. If you think kids are going to be empowered by banning them from using the very tools shaping the economy, you're mistaken. You don't fight systems of control by producing kids who don't know how to code, prompt, interpret output, or ask the right questions.\n\nBlaming technology for declining student achievement is simplistic and misguided. The real issue is poor implementation, not the existence of tech itself. The root causes of disengagement and underachievement are broader: Lack of relevance in curriculum, inadequate teaching style and instructional methods, lack of student autonomy, school and classroom environments, bullying, mental health struggles, family problems, overemphasis on test performance, marginalized backgrounds, lack of positive relationships with teachers, social pressures, group dynamics, and so forth. \n\nThat's not theory there is plenty of evidence to back that up. \n\nI point you to:\n\n* Craft, A. M., & Capraro, R. M. (2017). Science, technology, engineering, and mathematics project-based learning: Merging rigor and relevance to increase student engagement. Electronic International Journal of Education, Arts, and Science, 3(6), 140-158.\n* Bergdahl, N., & Bond, M. (2022). Negotiating (dis-) engagement in K-12 blended learning. Education and Information Technologies, 27(2), 2635-2660.\n* Loukas, A., Ripperger-Suhler, K. G., & Herrera, D. E. (2012). Examining competing models of the associations among peer victimization, adjustment problems, and school connectedness. Journal of School Psychology, 50, 825-840.\n* Gage, N. A., & MacSuga-Gage, A. S. (2017). Salient classroom management skills: Finding the most effective skills to increase student engagement and decrease disruptions. Report on emotional & behavioral disorders in youth, 17(1), 13.\n* Von der Embse, N., Jester, D., Roy, D., & Post, J. (2018). Test anxiety effects, predictors, and correlates: A 30-year meta-analytic review. Journal of affective disorders, 227, 483-493.\n* Lawson H.A., Lawson M.A. Student Engagement and Disengagement as a Collective Action Problem. Education Sciences. 2020; 10(8):212.\n* Fredricks, J. A., Parr, A. K., Amemiya, J. L., Wang, M. T., & Brauer, S. (2019). What matters for urban adolescents’ engagement and disengagement in school: A mixed-methods study. Journal of Adolescent Research, 34(5), 491-527.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-10 13:31:36",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vegetable-Two-4644",
            "body": "This is no different than looking things up on Google when I was in sixth grade in 2003.",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-05-09 17:12:06",
            "replies": [
                {
                    "author": "cheetuzz",
                    "body": "> This is no different than looking things up on Google when I was in sixth grade in 2003.\n\nGenerative AI is much different than Google search in 2003.\n\nThat’s like saying Google search in 2003 was the same as looking up World Book Encyclopedia in 1983.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-05-09 21:18:16",
                    "replies": []
                },
                {
                    "author": "shockingmike",
                    "body": "That is a lie.  You had to actually find the results to match your query.  There was not an algorithm spoon feeding you answers to your homework.\n\nHell Google stoll used boolean (sp) search parameters then.   Ask these nitwit to even separate their homework into keywords separated by a comma.  Go ahead.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-05-09 17:46:49",
                    "replies": []
                },
                {
                    "author": "guyonacouch",
                    "body": "Google has never known how to analyze and give opinions or compare and contrast or think critically or apply new knowledge to a variety of scenarios or interpret data sets and make inferences.   People will begin to blindly believe whatever AI tells them as the truth. AI will eventually have people with political interests having a heavy influence on what AI will spit out - This is not a good thing.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-10 07:42:53",
                    "replies": []
                },
                {
                    "author": "Zealousideal-Ease126",
                    "body": "It is different.  And to the extent that it is the same, looking things up on Google back in sixth grade in 2003 was also bad. \n\nBut this is 100x worse.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-11 21:50:45",
                    "replies": []
                }
            ]
        },
        {
            "author": "Impressive_Returns",
            "body": "Why are you attacking the technology and not leaning how to teach using it. AI is NOT going away and is the future. Just as calculators replaced slide rules and online learning/YouTube can teach students far more than you could you need to work with it instead of fight it.  Where I teach we encourage students to use AI.  It’s the future and students who don’t know how to use it will be at a disadvantage.",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-05-09 16:55:03",
            "replies": []
        },
        {
            "author": "Impressive_Returns",
            "body": "What’s destroying our education system in our President and the Christians agenda with Project 2025. Just look at what they have done and what they are trying to force upon us.",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-05-09 16:56:51",
            "replies": []
        },
        {
            "author": "Truth_Crisis",
            "body": "It’s not the students who are falling from grace because of AI.. it’s the teachers who are:\n\n1.\t⁠Stuck in old ways. AI has truly exposed the lurking conservatism of teachers and educators.\n2.\t⁠Becoming completely outmatched and outmoded by AI in terms of teaching prowess. 15 minutes with GPT can have a student understanding a concept better than a teacher could explain it in two hours.\n3.\t⁠Still failing to understand the triviality of their lesson plans and coursework, despite AI having exposed just how trivial they really are. AI is the mirror the education system didn’t want to look into.\n4.\t⁠Not understanding where their students learning needs reside, not meeting them where they are which is likely well beyond the elementary didactics of the 1960’s. Teachers have this tendency to think, “oh, they are not paying attention to To Kill a Mockingbird, their brains must be rotting!” Nope, they are craving for a different, more relevant type of knowledge. Comparatively speaking, TKMB is a meme at this point. Do your students know what Citizens United is?\n\nAI doesn’t help students cheat, it helps them reveal your weaknesses. You have to understand: from the teacher’s perspective, the homework assignment contains problems for the student to solve. From the student’s perspective, the homework assignment is the problem. You’re never going to be able to reconcile that difference. You either make the leap to the other side, or sacrifice your ability to educate them at all.",
            "score": -2,
            "depth": 0,
            "timestamp": "2025-05-09 19:10:16",
            "replies": [
                {
                    "author": "Journeyman42",
                    "body": "I feel like this was written by AI",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2025-05-09 21:26:35",
                    "replies": [
                        {
                            "author": "Truth_Crisis",
                            "body": " No, it’s 100% mine. But your accusation is why teachers are being instructed not to accuse students of using AI… you’re wrong a lot of the time.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-05-10 06:58:14",
                            "replies": [
                                {
                                    "author": "Journeyman42",
                                    "body": "There are valid concerns about students using AI to learn, especially when it's misused or relied on improperly. Here are some of the key reasons why this can be problematic:\n\n* Dependency and Lack of Deep Understanding: If students rely too heavily on AI tools for answers, they may not develop critical thinking, problem-solving, or research skills. They might get the \"what\" without understanding the \"why\" or \"how.\"\n* Academic Dishonesty: Using AI to complete assignments, write essays, or answer test questions without doing the work themselves can lead to cheating, plagiarism, and misrepresentation of a student's actual ability.\n* Erosion of Writing and Communication Skills: When students use AI to write for them, they miss out on practicing how to organize thoughts, build arguments, and develop a personal writing style.\n* Inaccurate or Biased Information: AI tools, especially those not specifically designed for education, can sometimes provide incorrect, outdated, or biased information, leading to misconceptions if not cross-checked.\n* Loss of Motivation and Engagement: If learning feels too easy or outsourced, students may become passive participants in their education rather than active learners.\n* Equity and Access Issues: Not all students have equal access to advanced AI tools. This can deepen existing educational inequalities if some students gain an unfair advantage through better resources.\n* Privacy and Data Concerns: Some AI platforms collect personal data. Students (especially minors) may unknowingly share sensitive information, which raises ethical and legal concerns.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-10 09:00:24",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "YellingatClouds86",
                    "body": "Helps reveal my weakness?  Get out of here with that bullshit.\n\nStudents usually don't like to learn.  So if you give them a big cheating tool they never will.  Hard stop.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-05-10 12:19:54",
                    "replies": []
                }
            ]
        },
        {
            "author": "Boysterload",
            "body": "If your school is a Google Workspace shop, your IT department shouldn't have Gemini t turned on for students under 13. Honestly, it shouldn't be in at all for students. Your filters should be used to block AI content and sites. Your filter probably has a teacher module where you can see what is on your student's screens. You can use that to block your own sites or force browsing to only sites you require (ie block Google.com)  \nThis doesn't stop students using home computers to use AI, but you can control in class assignments at least. \n\nDevil's advocate, AI is the new reality and is only going to get more involved in our daily lives. Not teaching or blocking its use will put students at a disadvantage as they enter college or a career. Familiarity with AI can create all kinds of new interests at a young age so it should be cultivated and taught properly and purposely.",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-05-13 05:03:36",
            "replies": []
        },
        {
            "author": "sndrspk",
            "body": ">When I go over the questions with them, they cannot tell me how they got their answer. They don’t even know half of the vocabulary the Ai uses.\n\nThen give them a low grade. It's not just AI that's the problem., it's AI in combination with mismatched evaluation methods.  \n  \nFor knowledge subjects, give more evaluation weight to their their oral explanations and question answering, rather than the text they submitted.  \n  \nIf you want to test something like writing skills, deliberately choose for each assignment whether you allow technology (AI, as well as tools like spelling checker), and judge the output based on those conditions, or make additional efforts so that AI cannot be used (e.g., for a spelling test).\n\nThis means either accepting that technology will be used and putting the bar higher (like we did with calculators or spelling checkers), or resort to in-class paper-and-pen writing or in-class digital writing on locked down computers (which means more effort for you). It's a concious choice that you'll have to make before each assignment now. Not doing anything and hoping that students won't use technology when you don't want them to is not going to work.\n\nAI changed the world not only for students. It also requires us teachers to (re)consider our teaching and evaluation methods.",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-05-15 03:34:04",
            "replies": []
        },
        {
            "author": "Double-Fun-1526",
            "body": "This is ridiculous. We were failing 98% of students prior to AI. I was in a class of 440+ in a \"good\" suburban school. Not a single of one of us had a decent world and self model at graduation. Compared to what our plastic brainminds allow us to have. Yes. It requires massive cultural shifts and an acceptance of physicalism, plasticity, and unacceptable social institutions and social structures. It is conservative minded people blindly reproducing given cultures and selves. It is the fault of philosophy and psychology in the end.",
            "score": -1,
            "depth": 0,
            "timestamp": "2025-05-09 18:48:51",
            "replies": [
                {
                    "author": "Truth_Crisis",
                    "body": "Your comment was fun to read but I have no idea what you’re saying, can’t even tell if you’re pro AI or not.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-05-09 19:07:25",
                    "replies": [
                        {
                            "author": "Double-Fun-1526",
                            "body": "AI has nothing to do with failures in education. We were grotesquely failing in education before and we still are. Genes and IQ are not determining what student's knowledge (representations, world and self models) are at 18. It is merely not enough time spent in significant study and reading. The reason why students are not reading and studying enough are family structures and behavioral expectations and allowances. Generally speaking, cultural structures that we allow to blindly be reproduced (social and developmental psychology, social constructionism). \n\nStudents should be doing significant school work for 10+ hours a day by the age of15. We of course need to allow autonomy and self choice. But if students fail to put in work then significant cultural changes need to happen for the individual, the family, the school, and broader society. It is just the kind of focus that our brains need to absorb knowledge. \n\nThat means that you go into failing homes, criticize failing parents, and you go into cultural structures. That means you reject genetic determinism. That means we reject happenstance assortment. Say, reciprocal effects of IQ differences leading to behavioral differences (time in study). It means attacking cultures and family institutions. It means ending poverty of both students and their parents. UBI is a good start to that. It means ending \"American Culture.\" It means ending beliefs about identity. Our identities flow from arbitrary environments and social institutions. That includes all important parts of our selves. It is to recognize the complete plasticity of our brainmindselves.\n\nAI is good. And it will massively benefit education. Embrace it. End your culture.",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2025-05-09 19:20:31",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Journeyman42",
                    "body": "I feel like this was written by AI",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-05-09 21:25:46",
                    "replies": []
                },
                {
                    "author": "ocashmanbrown",
                    "body": "Ah yes, the classic \"everything is broken and it's all the fault of philosophy, psychology, and vaguely defined social structures\" take. A timeless genre. Somewhere between freshman dorm rant and manifesto scrawled on the back of a napkin.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-05-10 00:06:35",
                    "replies": []
                }
            ]
        }
    ]
}