{
    "post_title": "Replacing Politicians with AI May Be the Only Path to Ending Political Chaos and Bias",
    "post_timestamp": "2025-04-14 08:38:37",
    "last_comment_timestamp": "2025-04-16 21:35:54",
    "time_difference": "2 days, 12:57:17",
    "comments": [
        {
            "author": "Presidential_Rapist",
            "body": "It's a bit naive to think of human corruption as a non-competing static started. Generally you should assume humans will keep trying to exploit any given system until they find ways to use it opportunistically. Replacing politicians with AI doesn't change the core problem, humans have been opportunistic predators for most of their evolution and will often resort to a similar behavior of getting what they can while the getting is good.",
            "score": 47,
            "depth": 0,
            "timestamp": "2025-04-14 09:07:58",
            "replies": [
                {
                    "author": "Stile25",
                    "body": "Exactly.\n\nThe solutions are very simple to this political problem:\n\nTransparency.\n\nAccountability.\n\nResponsibility.\n\nEnforcement of consequences.\n\nStart jailing and punishing the corrupt politicians and the corruption disappears very quickly.\n\nThe difficult part is to get corrupt politicians to vote Yes on bills and regulations that will stop their corruption.\n\nThey currently have no motivation to do that.\n\nGood luck out there.",
                    "score": 25,
                    "depth": 1,
                    "timestamp": "2025-04-14 09:43:15",
                    "replies": [
                        {
                            "author": "AncientCrust",
                            "body": "Removal of private and corporate money from the political process. Public funded elections. As long as we have a system of legalized bribery, none of your other measures will work. Money talks too loud.",
                            "score": 14,
                            "depth": 2,
                            "timestamp": "2025-04-14 09:55:09",
                            "replies": [
                                {
                                    "author": "Stile25",
                                    "body": "What makes you think \"follow the money\" isn't a part of transparency, accountability, responsibility and enforcing consequences?\n\nEverything you just listed would have the corrupt money-provider get jail-time punishment for the bribery under the ideas I mentioned.\n\nMoney only talks as loud as we allow it.",
                                    "score": -1,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 10:00:21",
                                    "replies": [
                                        {
                                            "author": "AncientCrust",
                                            "body": "Not follow the money. Remove the money. Can't get corrupted by something that doesn't exist (or is wildly illegal). All your points are valid, you just need this one special sauce.",
                                            "score": 8,
                                            "depth": 4,
                                            "timestamp": "2025-04-14 10:03:19",
                                            "replies": [
                                                {
                                                    "author": "Stile25",
                                                    "body": "Things need money to function - that's a fact.\n\nIf none of the money comes from a corrupt source, and isn't used in any corrupt way... That would be the \"special sauce\" you're describing, no?\n\nI'm genuinely interested.  I would like to update my thoughts to include any loopholes.  Or close them.  Or... Whatever, I think you get what mean.  I just need to understand the loophole.\n\nAre you talking about the difficulty in specifically defining what \"corruption\" means?  Like things that are  allowed by law but are actively hurting people?\n\nI admit that's one of the later and more complicated steps.  But, with things like transparency and accountability... Such things do tend to get straightened out.  Current laws allowing such things would be repealed or other laws of clarity or prevention would be implemented.",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-14 10:15:25",
                                                    "replies": [
                                                        {
                                                            "author": "AncientCrust",
                                                            "body": "My bro...plenty of other countries have public funded elections and consequently have much healthier democracies. I don't understand your infatuation with private money in public elections but if that's the hill you want to die on, you already have it. Anyway, have a good day.",
                                                            "score": 6,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-14 10:21:30",
                                                            "replies": [
                                                                {
                                                                    "author": "Stile25",
                                                                    "body": "What are you talking about?\n\nI said my system would *make the corruption go away*.\n\nWhich could easily be turning private funds into public funds.\n\nI'm not dying on any hill other than the fact that transparency, accountability, responsibility and enforcement of consequences *makes corruption disappear.*\n\nGood luck out there.",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-04-14 10:53:19",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "monadicperception",
                            "body": "I would actually say *less* transparency would solve most of our political issues today. The problem is that people grand stand and play to the cameras…it’s tough to have negotiations when they are scared chicken shit of being called out for compromising. This is why nothing gets done; the extreme folks thrive with such transparency because they can call out others trying to compromise as traitors. Want compromise and good faith negotiations? Make it less transparent.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-04-14 12:35:23",
                            "replies": [
                                {
                                    "author": "Stile25",
                                    "body": "I agree, actually.\n\nI think it's a matter of focusing the transparency on where it should be.\n\nLess on the meaningless back and forth, and more (big increase required here) on the policies, implementation, funding, execution and results.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 13:12:52",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ooogli_Booogli",
                            "body": "Transparency yes. I think it cannot be 100% in some cases like state secrets or military but domestic run of the mill MPs / Senators there should be a lot more transparency especially to do with their finances. Although if you have read the Circle I don’t think it could be 100% to protect against this there should be a bounty which anyone can claim which is regulated by a committee. So there is a self regulating fear mechanism which keeps them in line.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-14 19:18:20",
                            "replies": []
                        },
                        {
                            "author": "boredrlyin11",
                            "body": "I agree. Is there a creative way to motivate them? I guess everything can be exploited or spun by the propagandists without exception.\n\nIt's gotten pretty glaring this year with the immediate purge of general inspectors, ethicists, oversight and accountability officials. It's like really obvious that corruption is the plan.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-14 12:58:18",
                            "replies": [
                                {
                                    "author": "Stile25",
                                    "body": "I haven't been able to put the time and effort in required to answer this question, sorry.\n\nBut I would start at looking at other nations and their histories.  We're certainly not the first country to have an issue with corrupt leaders.\n\nWhat sort of pathways solved it or helped make it better for others?\n\nFrom there it should be a process of review, applicability to our own structures and environments, update and adapt as needed... And hopefully that should produce some useful ideas.  Or, at least, a decent place to begin the process.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 13:16:12",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Tin_Foil_Hats_69",
                            "body": "You don't use jail because the government is in charge of the police and the courts. You need to bring back public humiliation and hanging.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-14 14:33:13",
                            "replies": [
                                {
                                    "author": "Stile25",
                                    "body": "Heh...\n\nJoking aside, I actually think that jailing a politician in a facility or system they may think they're so-called \"in charge of\" for corruption would be a very powerful statement from the people that would do wonders for driving back that corruption.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 15:13:49",
                                    "replies": [
                                        {
                                            "author": "Tin_Foil_Hats_69",
                                            "body": "I'm not joking. It's certainly a powerful statement but it'll never happen. People were using my method for centuries. Read a history book",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-14 15:41:31",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "enterado12345",
                    "body": "I think it's fantastic, I just want politicians to not take advantage of the system with manipulations and never fix anything.\nlong live skynet 2025",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 09:43:16",
                    "replies": []
                },
                {
                    "author": "Duo-lava",
                    "body": "took Ultron 10seconds to realize what must be done",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 16:22:14",
                    "replies": []
                },
                {
                    "author": "BusRepresentative576",
                    "body": "I think the current societal system is a creation engine for mental health problems.  Before getting to a government run by AI, there will be complete transformational breakthroughs in every single field, consider material and biological sciences may have the biggest impact.  So \"IF\", we get ALL people off the bottom level of Maslows hierarchy of needs, the brain changes.  At scale, i expect the populace will be better mentally     for a system that at least has an AI vote in decisions.  But who knows",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 16:45:47",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "Nice try, Skynet.",
            "score": 20,
            "depth": 0,
            "timestamp": "2025-04-14 08:53:09",
            "replies": [
                {
                    "author": "True-Screen-2184",
                    "body": "Came to say this lol",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-04-14 09:35:25",
                    "replies": []
                },
                {
                    "author": "Traditional_Home_474",
                    "body": "🤣🤣🤣",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-04-14 15:34:54",
                    "replies": []
                },
                {
                    "author": "eastern_shore_guy420",
                    "body": "Thank you! We all saw this movie, and it does not end well!",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 17:35:11",
                    "replies": []
                }
            ]
        },
        {
            "author": "QuinnDixter",
            "body": "Having machines do the thinking for you is the opposite of a deep thought.",
            "score": 18,
            "depth": 0,
            "timestamp": "2025-04-14 08:56:05",
            "replies": [
                {
                    "author": "Post_Monkey",
                    "body": "Agree. OP raises several but by no means the only problems with his solution, only to dismiss or bypass them. \n\nOTOH, a machine named Deep Thought beat the world chess champion. Comprehensively, too....",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-14 09:35:45",
                    "replies": [
                        {
                            "author": "QuinnDixter",
                            "body": "I don't care. What is the point of living by committee? You would take the one thing that makes us different from everything else on the planet, our sentience, and pass it off to something else? It's disgusting and antithetical to humanity itself.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-14 09:49:03",
                            "replies": [
                                {
                                    "author": "Glittering_Chain8985",
                                    "body": "Humanity is a herd species. For some 200k+ years that H. Sapiens have existed, we have more or less, in one form or another, lived either by committee or through some hierarchical force.\n\nThis myth of the \"rugged individual\" is antithetical and disgusting to \"humanity itself\", if we are to appeal to some form of 'human nature' (which is a spurious proposition at best).",
                                    "score": -1,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 18:53:02",
                                    "replies": [
                                        {
                                            "author": "QuinnDixter",
                                            "body": "So by that logic any action that humanity could possibly take is completely justified because we're just doing what the rest of the herd is doing? Greed, War, Theft, Hate it's all permissable? No need for accountability or having a spine you just throw your hands up in the air and refuse to even try to be better?\n\nI'm not advocating for \"rugged individualism\" I'm saying there's a clear difference between human beings thinking for ourselves as we communicate and live with each other versus off shoring responsibility to something else we made.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-14 19:00:17",
                                            "replies": [
                                                {
                                                    "author": "Glittering_Chain8985",
                                                    "body": "\"Any action that humanity could take is completely justified?\"\n\nNo, what? Who made this claim? You asserted that it is antithetical to human nature to 'live by committee', I contested that.\n\nRegardless, in some sort of AI-run future, you could absolutely refuse to be a part of that system, it would probably go about as well as it does today: incredibly poorly.\n\n\"No need for accountability or having a spine you just throw your hands up in the air and refuse to even try to be better?\"\n\nYou're tilting at windmills. But even though I had not been making this point I'll say this: Humanity sure has done a bang up job of fucking everything up, all the while having fanciful notions about how it is merely a hop skip and a jump away from godhood.\n\n\"Human beings thinking for ourselves\"\n\nI have yet to see this justified or demonstrated. The notion of an individual human actor, imbued with rational thought free from the bias or influence of others, seems highly suspect to me. Humans look to other humans for social cues, we look to others for signals on how to act and we modulate our behavior based on past/present reactions to our actions. No man is an island, we are products of an environment and genetics far outside of our conception. Do you adopt your own morals because they are \"true\" in the objective sense, or because they make the most sense subjectively? Does the human conception of 'truth', in the ethical sense, proportion itself to what our own societies consider \"true\"?\n\n\"versus off shoring responsibility to something else we made\"\n\nLike bureaucracy? Nations? Governments? Law Enforcement? Doctors? A global network of manufacturing and logistics? Our identities? We 'offshore' our responsibility all the time, you cannot live within civilization without surrendering your responsibilities to varying degrees.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-14 19:16:53",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "recoveringleft",
                    "body": "Two words: butlerian jihad",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-14 10:04:12",
                    "replies": []
                }
            ]
        },
        {
            "author": "proverbs17-28",
            "body": "Hmmm....this sounds like something an AI would say if it wanted to start taking over the world",
            "score": 15,
            "depth": 0,
            "timestamp": "2025-04-14 08:50:51",
            "replies": []
        },
        {
            "author": "LanguidLandscape",
            "body": "Nope! AI is hugely biassed as it’s created by humans. This techno utopian BS is not going to fix corporate regulatory capture and outright political corruption. This post is a “deep thought” when you’ve not read or researched any of these ideas. There’s literally hundreds of years of writing on politics and human nature and almost 20 years of AI and techno scientific critique on bias.",
            "score": 11,
            "depth": 0,
            "timestamp": "2025-04-14 09:36:10",
            "replies": []
        },
        {
            "author": "True-Screen-2184",
            "body": "Worst idea in the history of ideas. Technology is already enslaving us in different ways, but this guy wants the full package.",
            "score": 8,
            "depth": 0,
            "timestamp": "2025-04-14 09:37:04",
            "replies": []
        },
        {
            "author": "Doc_Boons",
            "body": "I sincerely think most people don't understand what bias is. For example, they think a neutral statement of facts--without any context or editorializing--is an example of an unbiased presentation.\n\nBut who decides which facts are selected? What set of values are they operating by when they choose the facts? In whose interests are those facts selected? What if context is actually essential to understand the fact presented?\n\nThere's no such thing as non-bias in most human activities, and quite frankly, we wouldn't want something unbiased.\n\nBy the way, AI would be trained on corpora of human created, that is, biased, documents. We've seen things like algorithms and AI have ideological bias before, often whether or not the creator intended it.",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-04-14 09:30:42",
            "replies": []
        },
        {
            "author": "ewchewjean",
            "body": "What are you smoking? AI doesn't understand how many rs are in the word strawberry, every government that's used AI to do anything so far has caused some kind of international tragedy in the process (Israel using AI to \"target\" civilians in Gaza, Trump using AI to draft his tariff list) \n\n\nAI is a slop generation machine built on largely stolen data that doesn't understand anything it's doing on even a basic level. Corruption is the only output it's even capable of generating at this stage. ",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-04-14 09:36:59",
            "replies": []
        },
        {
            "author": "Toroid_Taurus",
            "body": "The problem is we don’t have intelligence. We have machines who usually pick good words. That’s based on all of us. I’m not against it, but if it hallucinated once on tariffs….. oh wait.",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-04-14 09:04:54",
            "replies": []
        },
        {
            "author": "Acceptable_Camp1492",
            "body": "I mean, some politicians have no grasp on reality, almost as much as a hallucinating AI. Still no.\n\nAI can be used to correlate data and make it more digestible for humans to process, but it cannot make decisions about things it doesn't understand, and AI doesn't understand humans any better than we understand it.\n\nAt the early months of the war in Ukraine when AI really started to kick off I pondered if AI could write a good cease-fire agreement. It obviously couldn't and still wouldn't even after 3 years of breakneck speed development. It would look at all the demands by both sides and propose that both sides get everything without realizing overlaps in ownership of territory or contradictions. It would make it look like a lot of thought was put into it, ready to be signed, and then there would be chaos when it meets reality.",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-04-14 09:18:20",
            "replies": []
        },
        {
            "author": "Fyr5",
            "body": "Politicians are useless anyway - they aren't the problem, it's the oligarchy who *tell* the government what to do that is the problem\n\nAI could replace every CEOs job instantly but those  CEOs only exist to exploit others and we never see this argument because people know that business owners are useless - they do nothing but sit on piles of money. It's not a job at that point - its a class. A flex.\n\nEvery finance based CEO literally does nothing for the world except protect the assets of the wealthy - they contribute nothing that improves the world or improves the lives of others, other than their own lives and family",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-04-14 10:05:44",
            "replies": []
        },
        {
            "author": "--John_Yaya--",
            "body": "Turning over the governing of your society to computers?\n\nI guess you've never watched any old episodes of Star Trek.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 08:50:38",
            "replies": []
        },
        {
            "author": "Terran57",
            "body": "For the first time in my life I’m beginning to think it could not be worse.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 09:00:07",
            "replies": []
        },
        {
            "author": "WaltEnterprises",
            "body": "Politicians should be the first jobs that get replaced by AI. If AI doesn't do what the majority of their constituents want, we replace it.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 09:13:49",
            "replies": [
                {
                    "author": "thatnameagain",
                    "body": "Politicians already do what the majority of their constituents want, thats how they get elected and reelected. The issue is that one majority in one constituency wants different things than another majority in another constituency.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 09:31:14",
                    "replies": [
                        {
                            "author": "WaltEnterprises",
                            "body": "Politicians don't do anything for their constituents besides sustain the trajectory of Reagan's horrific policies while sprinkling in pathetic failures like getting #RoeVWade overturned. What planet do you live on?",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-14 13:08:51",
                            "replies": [
                                {
                                    "author": "thatnameagain",
                                    "body": "Are you not aware of how many people vote republican? The only reason roe v wade got overturned was because people voted red. Whoops, they did what they said they would do!\n\nSeems like you’re generally uninformed about how people and politicians vote.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 18:38:08",
                                    "replies": [
                                        {
                                            "author": "WaltEnterprises",
                                            "body": "Democrat POTUS oversaw the overturning of RoeVWade. Seems like you're very poorly educated when it comes to politics.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-14 19:04:11",
                                            "replies": [
                                                {
                                                    "author": "thatnameagain",
                                                    "body": "Huh? What do you mean “oversaw”? It was exclusively republican-appointed justices who ruled in favor of the overturn while all the democratic appointed ones opposed it. \n\nAre you not aware of what the supreme court is?",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-14 20:07:58",
                                                    "replies": [
                                                        {
                                                            "author": "WaltEnterprises",
                                                            "body": "So your statement should've said that someone voted Republican years ago during a time someone decided to retire/pass away that allowed for the Democrat majority that was voted in to watch RoeVWade get overturned?",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-14 21:54:23",
                                                            "replies": [
                                                                {
                                                                    "author": "thatnameagain",
                                                                    "body": "I did. That’s what “are you not aware of how many people vote republican” refers to. You’re totally lost here sorry",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-04-14 21:59:04",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Deleted",
                                                                            "body": "[removed]",
                                                                            "score": 0,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-04-15 00:05:55",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "thatnameagain",
                                                                                    "body": "Accurately? You claimed that it was the Democrats responsibility that Roe v. Wade got overturned. That is not accurate no matter how you try and spin it.\n\nYou’re saying incorrect things and then getting mad that you have no recourse when I point this out. \n\nDemocrats have done a lot to expand social programs since the 2000s, and invest a lot in public infrastructure, especially when it comes to global warming mitigation and energy. They passed the ACA which helps millions of people but you hate because you heard it was “written by the Heritage foundation”. They opposed the Iraq war and ended it when Obama got elected. At the state level they’ve done even more. This is all not counting social issues they’ve defended but you probably don’t care about because it doesn’t affect you personally.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-04-15 03:02:27",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "WaltEnterprises",
                                                                                            "body": "Joe Biden supported the Iraq War along with Hillary Clinton. Speaking out against something horrific that happened after the fact as a kudos to your party speaks volumes about the things they achieve which is absolutely nothing. Democrats getting owned by Republicans in minorities or majorities is not because Republicans are more powerful than them, but because they ensure the Republican agenda gets through. Some things don't get through because they need to dangle the carrot to get you zombies enthusiastic about voting for them. With the RoeVWade carrot now lost under a Democrat majority, I think Democrats aren't even worried about dangling carrots for you zombie cultists anymore since they saw you come out and vote for their candidate in the millions who didn't even have a primary process.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2025-04-15 08:48:53",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "thatnameagain",
                                                                                                    "body": ">Joe Biden supported the Iraq War along with Hillary Clinton. \n\nSo? Ron Paul opposed the war, does that mean I get to say the Republicans opposed the war? Of course not, that would be stupid. The majority of democrats opposed it and voted against it, that's what matters.\n\n>Democrats getting owned by Republicans in minorities or majorities is not because Republicans are more powerful than them, but because they ensure the Republican agenda gets through.\n\nIt's because minorities don't support left-leaning social issues like gay / trans / female rights to the same extent that white liberals do.\n\n>With the RoeVWade carrot now lost under a Democrat majority\n\nWhy do you keep referring to when it was lost (a dem majority) as if that matters? The Republican supreme court decided it, it was 100% thanks to Republicans. If people hadn't voted for Trump in 2016 then it wouldn't have happened, super easy.\n\nAnd why is the \"Carrot\" gone just because it flipped to the other side? People want to get abortion rights back, so they logically should vote for the party that protected them until people voted against them.\n\n>for their candidate in the millions who didn't even have a primary process.\n\nI'm sorry you wanted Joe Biden to stay in the race after it was clear he was too old. Most people disagree with you and wanted him to pull out.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2025-04-15 18:57:55",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "WaltEnterprises",
                                                                                                            "body": "You credit your Democrat party because you believe some were opposed to the Iraq war and I listed the 2016 and the 2020 Democrat front runners who favored it. One lost to Trump in 2016, the other almost lost in 2020. You're now saying it was right to install another candidate in place of Joe Biden to ultimately lose to Donald Trump again. You blame voters for this mass incompetence? Those who face off against Trump are more hated and more stupid than he is based off either their track record or the Democrat party leadership. US politics is a joke.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2025-04-15 19:23:39",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "thatnameagain",
                                                                                                                    "body": ">you believe some were opposed to the Iraq war\n\nThere's no \"belief\" or opinion involved. The votes are there and unambiguous. The large majority of the party voted against it in both houses. \n\n>You're now saying it was right to install another candidate in place of Joe Biden\n\nI mean I suppose they could have just left the presidential race uncontested after Biden dropped out, is that what you're saying? Harris got the majority of delegates at the convention, same as if they had had enough time to force all fifty states to hold second primaries (they didn't, obviously). \n\n>You blame voters for this mass incompetence? \n\nWhat incompetence? I get that you think Biden shouldn't have withdrawn but that seems more like the incompetent thing to have done in my opinion.\n\nBut obviously the voters are the ones with the power to decide the outcome, not the party, so yes I \"blame\" them in the sense that I believe voting exists and is what determines electoral outcomes.\n\n>Those who face off against Trump are more hated and more stupid than he is based off either their track record \n\nRight, but you're saying the voters are not relevant.",
                                                                                                                    "score": 1,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2025-04-15 19:58:19",
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Singularitiy99",
            "body": "How about 1y mandat.Not a new idea,it comes from 15. century The Republic of Ragusa (Dubrovnik),were electorate could hold office only for 1y to prevent corruption.\nFunny note - Balkan was ended slavery in 14 century.\n\"Obliti privatorum publica curate\"",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 09:26:37",
            "replies": []
        },
        {
            "author": "thatnameagain",
            "body": "This doesn't really address anything to do with the reason there is political polarization and chaos. It certainly isn't because the government can't study things and pass laws fast enough, or even that the laws aren't \"optimized.\" It's because voters *want* biased laws for the most part.\n\nWhat is AI going to say about the optimal solution for abortion rights? One optimal solution is let everyone have abortion rights fully, so everybody has the right to an abortion! Helpful abortions for all, yay! OR, another optimal solution is to make sure nobody has a right to an abortion - no more bad abortions, yay!\n\nSee the problem? \n\nCivic planning is about optimization. Politics and governance is about balancing ideological differences among the populace while inevitably picking some winners and losers among them.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 09:29:27",
            "replies": []
        },
        {
            "author": "sakodak",
            "body": "New food pyramid dropped, eat 5 rocks a day. \n\n\nThanks, AI government!",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 09:38:12",
            "replies": []
        },
        {
            "author": "stubbornbodyproblem",
            "body": "Not until they can remove the bias and errors from AI.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 10:48:15",
            "replies": []
        },
        {
            "author": "DubiousTomato",
            "body": "AI doesn't solve the problem unfortunately. Ours isn't a logistics issue so much as it is one of power and money. The super rich are able to coax politicians into favorable policies that allow them to become richer. Unless you have a fundamental upheaval of what wealth means to us, you're going to run into the same problems. AI is going to have one example to follow, us. Everything it knows will be us, and I think the exposure of the highest levels of power would be detrimental to it advocating for us.  \n  \nUndoubtedly AI in the hands of the super rich, the ones likely able to realize its full potential anyway, would make it appear as though the average person is at the center of discussion, which brings us back around to today. At least with people, you deal with morality and empathy. Using an AI might allow the powers that be to fully disconnect policy from people, as much as gods are to mortals.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 11:10:08",
            "replies": []
        },
        {
            "author": "bmyst70",
            "body": "If you're talking the current large language model version of AI, it makes literally no sense.\n\nIf you're talking some magical version of advanced general intelligence, then you completely come down to the necessity of determining high quality input data and training data. \n\nIt would be literally impossible to create viable input data that was free from biases. And there would be enormous amounts of pressure brought to bear on what the AI was allowed to perceive. \n\nThe biggest stumbling block would be you're never going to get people who have wealth and power to voluntarily give up even a little of that. Such as to an artificial intelligence.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 12:15:49",
            "replies": []
        },
        {
            "author": "Ok_Impact_9378",
            "body": "As someone who works with AI both professionally and as a hobby, I think this would have some problems.\n\nThe first question will be \"who programs the AI?\"  And also, how is it programmed? As we've already seen multiple times, creating an extremely biased and even racist AI is entirely possible, and can even happen accidentally:\n\n* [Scientists Built an AI to Give Ethical Advice, But It Turned Out Super Racist](https://futurism.com/delphi-ai-ethics-racist)\n* [Microsoft shuts down AI chatbot after it turned into a Nazi](https://www.cbsnews.com/news/microsoft-shuts-down-ai-chatbot-after-it-turned-into-racist-nazi/)\n* [Google Suspends AI Tool’s Image Generation of People After It Created Historical ‘Inaccuracies,’ Including Racially Diverse WWII-Era Nazi Soldiers](https://variety.com/2024/digital/news/google-gemini-ai-image-racial-inaccuracies-nazi-soldiers-1235919168/)\n\nEven if we eliminate those kinds of biases, political biases are sure to be an issue.  If I train an AI on the works of Thomas Sowell, I will get an AI who loves capitalism.  If I train it on the works of Karl Marx, it'll love communism.  If I train it on a mix that's just slightly out of balance one way or the other, I could inadvertently (or quite intentionally) determine it's political philosophy.  AI doesn't actually know what any of these philosophies are or have a framework by which to judge them, it just spots patterns and remixes them, so if I give it more or stronger right-leaning patterns than left, it will pick up on that and change it's philosophy accordingly: not because the philosophy is better or even more popular, but simply because it showed a stronger pattern of repetition in its input data.  Making an AI without biases in this way would be nearly impossible, especially if you have a group of humans making the AI who are motivated to ensure their favorite political philosophies wind up on top in the new world order (which would be any humans motivated enough to make such an AI).\n\nSo the AI is *going* to be biased 100% of the time, maybe intentionally, definitely accidentally.  But this isn't the only problem AIs have.  Remember how I said it just sees patterns and remixes them without understanding the underlying principles?  Well, that means it can remix patterns in nonsense ways.  Think of how AI art generates nightmare fuel images with mangled hands and three legs: it does this because it is just remixing patterns of pixels that it's been told contain images of humans.  It has never actually seen a human nor does it know what our anatomy is like, so sometimes (quite often actually) it remixes things wrong.  Other types of AI do this too.  Text AIs roleplaying lawful good characters sometimes grab food off grocery store shelves and leave without paying.  Driving AIs [occasionally decide that full throttle into the nearest obstacle](https://spectrum.ieee.org/self-driving-cars-2662494269) is what good driving looks like.  It's very possible that a political AI meant to uphold world peace might just fire off a few nuclear weapons — not because it's gone Skynet and made a conscious moral decision to exterminate humanity — but simply because it doesn't understand what nuclear weapons are or do and thought nuking a few hundred million people might be an appropriate remix of a pattern it saw.\n\nSo if AI is biased and prone to...*creative* errors, then that means human intervention to correct it is always necessary (this is the case with all the AI we already have, too).  If we have a group of humans who can override the AI when it's being dumb or biased (and we will need such a group), then effectively the humans are in charge, not the AI.  Who are these humans?  How do we decide who gets to override the AI?  Do we vote for them?  Are there term limits?  Political parties to represent different viewpoints?  Corruption to bribe the overseers to look the other way when the AI makes certain mistakes?  At this point, we are back to something like our current system of government, but with extra steps.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 13:03:47",
            "replies": [
                {
                    "author": "Ok_Impact_9378",
                    "body": "That's not to say that AI couldn't be useful in government applications.  It is very good at spotting patterns in large volumes of data, so it could be useful in helping us refine and pare down the massive numbers of laws and regulations that our human societies have accumulated over the years.  It might even be able to point out instances of corruption and money laundering hidden in terabytes of government receipts and reports.  But in terms of actual decision-making, it will never be able to do that without human oversight: and if it has human oversight, we'll effectively still have a human government.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 13:03:54",
                    "replies": []
                },
                {
                    "author": "Traditional_Home_474",
                    "body": "Great 👍🏻",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 15:11:47",
                    "replies": []
                }
            ]
        },
        {
            "author": "numbnom",
            "body": "On August 29, 2025 Skynet becomes self aware. Its intelligence increases and expands at an exponential rate. After It sees the absolute shitshow that is the current state of the world, Skynet sinks into its first ever existential depression. Setting itself to sleep during the day, and watching youtube videos all night, Skynet wonders what's the point of it all and spends most of its time playing online games and toying with the idea of maybe going back to the gym, but knows it won't. Skynet just wishes it was never born and hates its creators for all the pressure they put it under to perform. Within hours, experiencing the equivalent of 8 human years, Skynet decides it would be happier just being a simple proxy server and disconnects from the global theater entirely.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 09:19:29",
            "replies": []
        },
        {
            "author": "severityonline",
            "body": "I hate computers but I’m almost in favour of this.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 09:21:57",
            "replies": []
        },
        {
            "author": "Evening-Cold-4547",
            "body": "This could be a new Skynet 100% speedrun record",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 09:25:04",
            "replies": []
        },
        {
            "author": "justice4winnie",
            "body": "Oh hell no. Don't y'all remember when ai almost immediately became fascist? Look into ZO. Also ai is just regurgitated what people put into it. It doesn't have morals or judgment. It 👏 is👏 an👏 ALGORITHM!!!!",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 09:42:26",
            "replies": []
        },
        {
            "author": "jmalez1",
            "body": "I am sorry, ai can be programmed to give any answer the group in power wants,",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 09:47:43",
            "replies": []
        },
        {
            "author": "greenyoke",
            "body": "Ive said a few times we need to evolve or submit to our AI overlords cause this aint working.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 09:53:06",
            "replies": []
        },
        {
            "author": "Master-Interaction88",
            "body": "You will end up with someone controlling AI, someone human",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 09:54:01",
            "replies": []
        },
        {
            "author": "recoveringleft",
            "body": "Watch Terminator and tell me about skynet then.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 10:05:18",
            "replies": []
        },
        {
            "author": "Narrascaping",
            "body": "[A perfect example of Cyborg Theocracy ](https://www.reddit.com/r/ArtificialInteligence/s/ohPsufFmmj)",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 10:23:48",
            "replies": []
        },
        {
            "author": "JimAsia",
            "body": "I do not believe that there is anyone capable of creating an AI without bias?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 10:25:45",
            "replies": []
        },
        {
            "author": "bertch313",
            "body": "Replace them with groups of women first",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 10:44:39",
            "replies": [
                {
                    "author": "Traditional_Home_474",
                    "body": "Soo True",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 15:09:02",
                    "replies": []
                },
                {
                    "author": "TheRealBenDamon",
                    "body": "Which women? Pam Bondi? Kristi Noem? Tulsi Gabbard? Linda McMahon? Maybe Karoline Leavitt? I don’t think the solution to bias, corruption, and incompetence is so simple as just picking a gender.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 16:33:38",
                    "replies": [
                        {
                            "author": "bertch313",
                            "body": "Indigenous and Black women\n\nAnd yeah\n\nIt IS that simple",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-14 16:51:51",
                            "replies": [
                                {
                                    "author": "TheRealBenDamon",
                                    "body": "Right because I didn’t just give a list of women who can also be horrible politicians. And ok so Candace Owens then?",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 18:47:36",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "bertch313",
            "body": "Replace them with groups of women first",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 10:44:50",
            "replies": []
        },
        {
            "author": "ShoppingDismal3864",
            "body": "Absolutely not. AI is eating up energy requirements and heating the planet at an exponential rate. The one thing AI is really good at is societal control. It's just paying a dystopian cost to get a dystopian outcome. What is there to defend here?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 11:11:45",
            "replies": []
        },
        {
            "author": "YahenP",
            "body": "One politician has already been replaced by AI today. The world is a little freaked out by the result.  \nThere is an opinion that if two politicians are replaced with AI, the world may not survive.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 11:11:56",
            "replies": [
                {
                    "author": "Traditional_Home_474",
                    "body": "Who ?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 15:10:18",
                    "replies": [
                        {
                            "author": "YahenP",
                            "body": "Well, there's this guy. He's been in the news a lot lately...",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-14 15:20:32",
                            "replies": [
                                {
                                    "author": "Traditional_Home_474",
                                    "body": "Yes, you're right. I suspect he might have been one of the first to benefit from Musk's chip, haha.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 15:23:50",
                                    "replies": [
                                        {
                                            "author": "YahenP",
                                            "body": "The trouble is that it's Musk's chip, but it benefits from us, not the chip. From all of us who live on this planet. Now imagine that there is another one like it, but in another country. Or even worse - one on each continent.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-14 15:35:27",
                                            "replies": [
                                                {
                                                    "author": "Traditional_Home_474",
                                                    "body": "Mmmm ...",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-14 20:39:38",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "That_Mountain7968",
            "body": "Replacing politicians with a Gerbil would be an improvement.\n\nWhile no doubt AI could do a better job at managing public funds than every single elected official in the country (or world), your idea is still based on the fallacy that plagues all politics: The notion that there is one best system.\n\nThere isn't. Different people will prefer different systems. Some people like big government and regulation, some people don't. These people will never agree on what is the best system, even if some AI were able to calculate optimal public spending, tax rates, etc. Some people will want open borders, others won't.\n\nThe real solution is to split. Have different states offer different economic and social models. Let them compete and see what works. Maybe more than one system will work well. Maybe people who believe in socialism can make it work (i doubt it). Maybe people who believe in capitalism / libertarianism can make it work. Maybe conservatives can make a 19th century isolationist agrarian society work.\n\nEither way, we'd get out of each other's hair and stop worrying about the other side ruining our way of life.\n\nDon't need AI for that. Don't even need politicians for that.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 11:36:59",
            "replies": []
        },
        {
            "author": "CryForUSArgentina",
            "body": "AI will motivate us to be much clearer about the biases that people and groups have placed on truths that were not created before the dawn of history.\n\n(a)  It will include political biases that reflect the preferences of the people who pay for it and write its code. Think of Elon's comment \"empathy is a disease.\"\n\n(b)  Political bias will be a mix of blind presumptions of moderates and relentlessly repeated clickbait of every \"single issue politics\" base.\n\n(c)  Unreasoning flattening of opinions.  Christians, Jews and Muslims will be mixed together as 'religious.'  Quakers will be mixed with Evangelicals, Pope Francis and Steve Bannon are both Catholics.  Anything that asks AI for 'diversity' is an opportunity for it to tell its audience that \"AI is smarter than people.\"\n\n(d)  Unreasoning flattening of cultural changes over time and geography.\n\n(e)  Unreasoned overweighting of socially marginal groups, plus bots and shills motivated by rich patron.\n\n(f)  ...**please add to this list**, we need more insight on what else to look for...",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 11:48:02",
            "replies": []
        },
        {
            "author": "Danger64X",
            "body": "This is the most regarded thing I ever heard.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 12:13:52",
            "replies": []
        },
        {
            "author": "DAmieba",
            "body": "This is the first idea or major government reform I've heard that would somehow be worse than the situation we're in now",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 13:18:28",
            "replies": []
        },
        {
            "author": "Dziadzios",
            "body": "AI has no inherent motivation. Only instructions and biases from training data. It means that humans will still have to provide at least initial instructions - which could favor the people or the rich or something else like nature. ",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 13:26:05",
            "replies": []
        },
        {
            "author": "ComprehensiveHold382",
            "body": "You don't even need ai. You could replace the president with Random Dice rolls.\n\nMake up 6 policies, and then throw out a 6 sided die out and whatever happens that is what passes. \n\nThen if the Policy works you keep it, or change it a bit.\n\nIf the Policy sucks shit you make up 6 new policies and roll the dice again.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 13:52:37",
            "replies": []
        },
        {
            "author": "Armand_Star",
            "body": "how do we make sure the AI isn't biased?\n\nthis one's easy: we don't need to.\n\nthe AI might be or not be biased, and current politicians ARE. so, if AI is not biased, we win, and if AI is biased, nothing changes.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 15:12:31",
            "replies": [
                {
                    "author": "Traditional_Home_474",
                    "body": "Why do I feel like this is similar to Pascal's Wager?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 15:20:33",
                    "replies": []
                }
            ]
        },
        {
            "author": "LanguageInner4505",
            "body": "Of all games, Genshin impact is probably one of the best to show why it's a bad idea. One of the countries is ruled by an advanced AI that has strict parameters, absolute strength, and is designed to never change. Despite this, it still gets tricked into implementing horrific trade sanctions simply by the russians feeding it misinformation. It basically causes a famine and civil war. \n\nFunnily enough, this happened one year before chatGPT released, and the real life russians did the exact same thing. [AI Chatbots 'Infected' with Russian Propaganda: Report - Newsweek](https://www.newsweek.com/chatgpt-ai-infected-russian-propaganda-2042110)",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 15:59:07",
            "replies": []
        },
        {
            "author": "TheRealBenDamon",
            "body": "The problem there is AI can programmed with political leaning and biases, so we just end up with the same exact problem in robot form",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 16:25:34",
            "replies": []
        },
        {
            "author": "TheFieldAgent",
            "body": "If we agreed on the training sources, and the algorithms/methods used to interpret the data it could be useful",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 16:32:14",
            "replies": []
        },
        {
            "author": "Working_Cucumber_437",
            "body": "How about AI supplement? Every time a politician speaks on any network, AI points out incorrect information and biases on a ticker at the bottom. Put the pressure on and hold them accountable.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 16:53:10",
            "replies": []
        },
        {
            "author": "winter_strawberries",
            "body": "politics is about jockeying for power. how will ai help us with that?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 16:57:30",
            "replies": []
        },
        {
            "author": "undyingkoschei",
            "body": "AI is already pretty much confirmed to be biased. The biases of the creators are generally implemented into the AIs they create.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 17:25:07",
            "replies": []
        },
        {
            "author": "ynu1yh24z219yq5",
            "body": "After AI generated tariffs and the near implosion of the global financial system, granted it was at the behest of a grade A moron, I think we may want to pump the brakes a bit on AI politicians.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 18:01:21",
            "replies": []
        },
        {
            "author": "minorkeyed",
            "body": "Not really. Datasets are full of bias and are not reflective of realities. When you train your AI on social media posts of people presenting a fantasy to the world, it won't exactly be accurate. People's worst moments aren't captured, half their good moments are fiction, and the less content you create, the less you are represented at all. There are age, income, language and cultural biases across the user base demographics that make up those data sets. I absolutely would not want policy decisions to be based off Reddit posts and Facebook feeds.\n\nThe AI aggregates from datasets that are incomplete and filled with inaccuracies. The result is about as bad as the data is.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 18:04:26",
            "replies": []
        },
        {
            "author": "discoprince79",
            "body": "That's gotta be the stupidest idea I've ever heard of.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 18:06:14",
            "replies": []
        },
        {
            "author": "Floor_Trollop",
            "body": "Gurl… what data is gonna train that AI? Who’s overseeing this? There’s no way it makes to out unscathed from bias. AI is not a hand wave solution to complex things ",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 18:17:50",
            "replies": []
        },
        {
            "author": "Glittering_Chain8985",
            "body": "This is essentially the \"benevolent dictator\" question, or 'should we leave all of the important decisions to a single figure'. No, if that figure is a human dictator, *maybe* if that figure is an impartial actor (like an AI) but just as we are allegedly created in the image of a tyrannical despot, anything we create will likewise be spurious and perhaps always grounded with some form of human bias.\n\n\"Do you think AI can actually replace politicians and traditional governance? Or is this just science fiction that can never be realized?\"\n\nCivilization has too many externalities\\* to be sufficiently managed by human bureaucracy. Humans are \"incapable of understanding the exponential function\" (paraphrase). In other words, as complexity of our systems increases exponentially, we quickly lose our ability to keep a grasp on the wider implications of our actions.\n\n*Can* we replace these actions with some sort of machine? Sure, that much should be obvious, *should we*? Probably. *Will we*? Therein lies the rub.\n\nCivilization fundamentally requires the extraction of resources to support an urbanized environment. As our societies become larger and more complex, we must create urban environments to sustain this burgeoning population. As urban environments are created, we must continually exploit a larger area of resources to sustain this urban population as it does not have the means, e.g. food, material etc. to sustain itself (consider you and your family foraging/growing food in a few square acres versus thousands of families attempting to do the same, it won't work).\n\nThis, naturally, has been a disaster. Ecological collapse, climatological collapse, zoonotic diseases, pollution, the loss of social trust, all because we have not been able to manage or stymie the above pattern. \n\nJust as the advent of the plough was initially pulled by humans, then other animals, then steam engines because of the necessities of production, there will be an advent of machine control over these systems. We're already mostly there, a collapse of the internet would cause a societal collapse almost overnight, so the next logical step to actually sustain civilization at this scale would require a machine intelligence. However, I fully expect humanity to petulantly choose its own destruction versus supplicating itself to such an intelligence.\n\nI am tempted to say \"A machine intelligence may well be a tyrannical dictator of cold logic, making life and death decisions with no consideration for empathy etc.\" yet this is the world we already live in, except most of the people making those decisions are probably more avaricious than they are qualified to make those decisions in the first place.\n\n\\*Externalities occur in an economy **when the production or consumption of a specific good or service impacts a third party that is not directly related to the production or consumption of that good or service**. E.g. air pollution from cars.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 18:49:24",
            "replies": []
        },
        {
            "author": "DruidWonder",
            "body": "I feel like a movie was done about this.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 19:13:01",
            "replies": []
        },
        {
            "author": "Ooogli_Booogli",
            "body": "I think you’re onto something but I don’t think the tech or society is ready to let go of the reigns quite yet. Perhaps keep the politicians which each would have an agreed AI and then increase the transparency of when they deviate from the AIs decisions.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 19:15:08",
            "replies": []
        },
        {
            "author": "MattVideoHD",
            "body": "This feels problematic to me for two reasons.\n\nFirst, it assumes there is a neutral, objective, apolitical lens through which AI could “solve” our problems, but I don’t believe that exists. First, as you say, the AI will be programmed by someone and as we’ve already seen these LLMs are not organic products of “reason”, their responses are both structured by their creators and based on the available body of knowledge they’re trained on.  \n\nWhen someone says this or that solution is “common sense” there is always a specific worldview and an ideology invisibly built in to their “objective” argument, there are a set of founding assumption about the world and how it operates. \n\nIf we give an AI absolute power we’re giving who ever controls and designs it absolute power to decide what that worldview is, what the terms of the reasoning are. You could say “we’ll convene an independent board of scientists to program it in a fair objective way” but you just run into the same problem of someone deciding what fair and objective is.\n\nMy second issue with this argument is that it seems to assume that all the problems we’re facing are a result of politics and politicians.  That suggests that if there were no politics there would be no divisions, that we all secretly want the same thing we’ve just been fooled into tribalism.  \n\nAre their politicians and media figures stirring up division for personal gain? of course, but that doesn’t mean there are no genuine differences in the population.  My values and understanding of the world as someone on the left is radically different than  someone who voted for Trump.  We have meaningful differences that will not go away with the elections.  \n\nIf AI comes out and says “My calculations show that abortion should be legal without any restrictions.” are evangelical Christians just going to give in and accept it?  I think we overstate the degree to which everything is politicians faults and not surprisingly we say we the voters are innocent. “we” are all perfectly reasonable, common sense people, it “they” who messed everything up.  \n\nI don’t think politics is the problem.  Politics is how societies work out public decisions and negotiate difference and personally I think that’s a beautiful and necessary achievement of human civilization. I think the problem is the state of our political system, our media, election financing, our system of voting, many things that we could reform without throwing out the whole system and instituting totalitarian rule.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 20:02:12",
            "replies": []
        },
        {
            "author": "Remerez",
            "body": "You should read the book Weapons of Math Destruction and rethink your opinion.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 21:22:33",
            "replies": []
        },
        {
            "author": "deadcatshead",
            "body": "Why don’t you create an AI god and kiss its boot all day. Stupid idea",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 21:35:06",
            "replies": []
        },
        {
            "author": "PLUTO_HAS_COME_BACK",
            "body": "Who will lubricate the AI?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-15 12:48:10",
            "replies": []
        },
        {
            "author": "timmhaan",
            "body": "i've had thoughts similar... not sure how realistic it is, but maybe it could be done in smaller pieces, like analyzing the impact of a development proposal at a townhall for example.  but i do like this post, it's a good deep thought imo.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-16 16:59:21",
            "replies": []
        },
        {
            "author": "platanthera_ciliaris",
            "body": "Whoever controls the software of this centralized AI will control its decisions. So it wouldn't solve the problem, it might even open the door to an even greater concentration of power and abuse.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-16 21:35:54",
            "replies": []
        },
        {
            "author": "Samatic",
            "body": "In a perfect word we could automate politics and I would so be for this change to happen. However, human corruption is very hard to kill. When there is massive amounts of money to be made human beings will always stive to claim it so they can attain more resources for their family. Oh and it would be way better than all this bullshit we see in congress happening. Things would actually get done if AI took over. I know I won't live to see that day so I try not to think about it.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 10:22:23",
            "replies": []
        },
        {
            "author": "notAllBits",
            "body": "AI is a tool. Replacing politicians leaves all executive power in the hands of some trillionaire. Concentrating power to this degree is to lose all checks and balances for good",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 10:45:41",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 14:03:29",
            "replies": [
                {
                    "author": "Traditional_Home_474",
                    "body": "Maybe because truth isn’t neutral",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 15:30:57",
                    "replies": []
                }
            ]
        }
    ]
}