{
    "post_title": "Do you think AI is more likely to worsen or reduce wealth inequality globally?",
    "post_timestamp": "2025-04-13 18:06:07",
    "last_comment_timestamp": "2025-04-17 13:28:55",
    "time_difference": "3 days, 19:22:48",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "## Welcome to the r/ArtificialIntelligence gateway\n### Question Discussion Guidelines\n\n---\n\nPlease use the following guidelines in current and future posts:\n\n* Post must be greater than 100 characters - the more detail, the better.\n* Your question might already have been answered. Use the search feature if no one is engaging in your post.\n    * AI is going to take our jobs - its been asked a lot!\n* Discussion regarding positives and negatives about AI are allowed and encouraged. Just be respectful.\n* Please provide links to back up your arguments.\n* No stupid questions, unless its about AI being the beast who brings the end-times. It's not.\n\n###### Thanks - please let mods know if you have any questions / comments / etc\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtificialInteligence) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 18:06:08",
            "replies": []
        },
        {
            "author": "-happycow-",
            "body": "worsen, by far worsen.",
            "score": 112,
            "depth": 0,
            "timestamp": "2025-04-13 18:12:01",
            "replies": [
                {
                    "author": "abrandis",
                    "body": "Yep, agree totally worse. It ,nas it will be used by those that own the tech, resources and land to maximize their value...",
                    "score": 11,
                    "depth": 1,
                    "timestamp": "2025-04-13 18:19:33",
                    "replies": []
                },
                {
                    "author": "Beginning-Shop-6731",
                    "body": "Yeah its only going to exaggerate pre existing trends of income inequality. If you mean by equality that more people will be poor, than yes.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2025-04-13 19:13:40",
                    "replies": []
                },
                {
                    "author": "East-Worry-9358",
                    "body": "Imagine a world where labor is only only as scarce as the number of robots. And you thought globalization was bad for US workers? Imagine competing with a robot that can work 23 hours a day, you never have to pay, and never complains. AI and robotics will make maximize the value of capital while making labor nearly worthless.\n\nWe need to rethink capitalism when there is little to no need for labor. In order for the working class to survive, we need to nationalize some or all of the capital in this country. I say again - this is the only way for the working class of this country to survive.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-04-14 10:13:32",
                    "replies": [
                        {
                            "author": "-happycow-",
                            "body": "What do you think will happen when we reach a critical mass of unhireable people? They don't have money, they don't have social support, they don't have medical support.\n\nLet's pretend that AI takes all their jobs, and let's speculate about what then happens. Heck, we might even ask AI to think about it for us.\n\nThe thing is, AI will saw off the branch that the lowest tiers of civil society is sitting on.\n\nThey are no longer needed. But they are still there.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-14 10:18:06",
                            "replies": [
                                {
                                    "author": "East-Worry-9358",
                                    "body": "Agreed. And then they have a choice - either accept death or fight back. Hopefully it doesn’t come to this. Jeremy Grantham in a recent interview said that AI and robotics will result in either starvation or revolution for working people. \n\nWe all gotta get in front of this thing. Creating a social architecture that distributes goods to everyone is a must. And no, food stamps and section 8 housing isn’t going to cut it. Call it UBI, call it welfare, the Government needs to make sure that the landless among us get a piece of this rapidly-expanding pie.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 10:41:55",
                                    "replies": [
                                        {
                                            "author": "-happycow-",
                                            "body": "We are certainly reaching an inflection point where either AI, controlled by the elite, wins, or the people wins.\n\nSocial media is being used as a tool to control the masses. And if you apply AI on top of that, which I'm sure is already happening, then you have a recipe for disaster.\n\nFor now they (the useful idiots) are accepting it. But at some point, when they realize they are useful idiots, and they have no choice, something will happen.\n\n\\-\n\nI agree with you. Get in front of it.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-04-14 10:50:33",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "dofwifpartyhat",
                                    "body": "the peasants have been required for the last 10000 years to get the elites to the singularity. AI and robotics will eliminate the need for 99% of people.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-17 08:59:14",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "odious_as_fuck",
                    "body": "How come? Assuming they have access to Ai, couldn’t it help make education and medical information more accessible for example? Or is the problem that they simply won’t have access to it?",
                    "score": -4,
                    "depth": 1,
                    "timestamp": "2025-04-13 18:14:35",
                    "replies": [
                        {
                            "author": "-happycow-",
                            "body": "Because the people who can afford unlimited compute are the ones who control what the AI produces.",
                            "score": 37,
                            "depth": 2,
                            "timestamp": "2025-04-13 18:24:35",
                            "replies": []
                        },
                        {
                            "author": "IAMAPrisoneroftheSun",
                            "body": "Because we don’t live in a society that distributes wealth at all well.",
                            "score": 22,
                            "depth": 2,
                            "timestamp": "2025-04-13 18:58:28",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "That is true. Does it follow then that this ultimately accelerates our need to reform our economic systems?",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 19:09:50",
                                    "replies": [
                                        {
                                            "author": "IAMAPrisoneroftheSun",
                                            "body": "I’m honestly afraid we are already so far behind on reform, given the scale of the task of reworking the entire economic framework, that all we are left with is a short window in which to cobble together some sort of piecemeal harm reduction. \n\nI also have no truck with the people who are confident that ‘itll all get sorted out in the inevitable revolution’.   I do think large scale violence is very likely, if not inevitable, if above 30-40% of people are put out of work in rapid succession, which would interrupt the current trend of a calcifying class system, but it would not lead anything but more suffering. \n\nThere is currently no available mechanism to effect the scale of change needed through the political system, and while there is a plausible scenario in which an effective & adequately organized protest movement could emerge, the majority of  people are not clued in, and half of the ones that are, don’t see enough wrong with where we’re headed",
                                            "score": 14,
                                            "depth": 4,
                                            "timestamp": "2025-04-13 19:47:29",
                                            "replies": [
                                                {
                                                    "author": "ghosty4567",
                                                    "body": "It will be a rough ride.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-13 20:38:56",
                                                    "replies": [
                                                        {
                                                            "author": "IAMAPrisoneroftheSun",
                                                            "body": "Indeed, maybe the last one.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-13 22:22:18",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Soggy_Ad7165",
                                            "body": "The people who have the power to change the system profit the most from the system. It's a fundamental flaw of our society that we let people who play the money game also control out governments. They have nearly zero incentive to change the game in a meaningful way. I don't see how this can happen anymore without really drastic things happening. ",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2025-04-14 01:17:53",
                                            "replies": [
                                                {
                                                    "author": "odious_as_fuck",
                                                    "body": "Ai might be one of those catalysts that forces drastic change but I think the vast majority of people are just completely unaware and it’s not being talked about enough.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-14 04:28:38",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ghosty4567",
                                    "body": "Yet. First the power and wealth becomes more concentrated then the reaction politically. Humanity just has to survive in the meantime.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 20:38:10",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "abrandis",
                            "body": "Power comes from econoonc potential (aka capital), having more education is worthless if your labor isn't valued the same, go look at places  like India lots of well educated folks who's laborcaapcirt  isn't worth much....the future will be like that for everyone...",
                            "score": 8,
                            "depth": 2,
                            "timestamp": "2025-04-13 18:22:20",
                            "replies": []
                        },
                        {
                            "author": "uresmane",
                            "body": "What's the point in accessible education or medical information if you don't have a house anymore cuz your job has been taken?",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2025-04-13 21:32:56",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "Very true",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 04:21:26",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Larsmeatdragon",
                            "body": "A few nobel laureates discussed it [here](https://www.youtube.com/watch?v=1tELlYbO_U8&).\n\nEssentially if we look at the history of automation, in the medium term (though can be up to 90 years) the benefits of automation accrue to capital holders and workers see wage declines due to job displacement, before eventually (several generations later) seeing wage increases and quality of life increases.\n\nFor AI; I believe we will see an uplift for the poorest as they get cheap access to intelligence and can level the intelligence and knowledge playing field, but the vast majority of benefits will go to businesses and investors.\n\nAnother caveat is the implication of automating intelligence and learning in general; its unclear if you automate something so fundamental to all jobs if workers will ever be able to compete cost-effectively. With autonomous systems, human labor doesn't become more productive. So this could cause only downward pressure on the price of human labour. It really depends on if humans can still add value in other ways that gives companies employing humans a competitive edge.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-13 18:29:14",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "Thank you this is really interesting, I’ll give that link a watch",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 18:34:16",
                                    "replies": []
                                },
                                {
                                    "author": "-happycow-",
                                    "body": "You're literally behind, and misunderstanding AI, if you compare this to automation. Just off the bat.\n\nI would say you are stupid on the subject, and hopefully just initially naive. You need to learn a lot more now about what is going on.\n\nI work in AI, I scale AI for fortune 500 company, and you are just wrong.\n\nYou are simply just not understanding what is going to change over the next 3-5-10 years. It's not going to be kind to 'workers'",
                                    "score": -2,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 18:38:05",
                                    "replies": [
                                        {
                                            "author": "odious_as_fuck",
                                            "body": "May I ask what your understanding is? Are you saying there is no way in which ai will help the ‘common man’ and will inevitably worsen inequality in wealth and living conditions?",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2025-04-13 18:44:50",
                                            "replies": [
                                                {
                                                    "author": "-happycow-",
                                                    "body": "What was your initial question OP.\n\nIt will worsen it. By a lot.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-13 18:47:20",
                                                    "replies": [
                                                        {
                                                            "author": "odious_as_fuck",
                                                            "body": "Do you think there is any way or possibility for it to not worsen it? Or perhaps, a way in which after it is worsened it is reformed to counter act this issue? Is it an issue with our social, economic and political systems? Or even more fundamental than that?",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-13 18:49:52",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mulligan_sullivan",
                            "body": "It's ownership of significant money to invest in business or stocks etc that allows wealth accumulation outside of a job, knowledge is only helpful in itself to a very small degree in an extremely small number of cases.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-13 21:08:09",
                            "replies": []
                        },
                        {
                            "author": "ezkeles",
                            "body": "not everyone can access best AI\n\n  \ndidnt chatgpt now need 200 dollar a month to access that? and need at least decent computer?        many people still using intel gen2 outside there......",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-13 21:45:30",
                            "replies": [
                                {
                                    "author": "Quomii",
                                    "body": "I access $20/month GPT4 on my raspberry pi",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 23:10:18",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Equal-Association818",
                            "body": "The difference in wealth comes from who gets to work in AI not who has access to AI. The difference between a businessman and a consumer.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-13 18:56:01",
                            "replies": [
                                {
                                    "author": "Efficient_Mud_5446",
                                    "body": "More like Its those who own the means of production versus everyone else. A worker is just a worker and will, out of fear of ending up like those with no jobs, take low pay and bad conditions.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 21:41:17",
                                    "replies": [
                                        {
                                            "author": "Nintendo_Pro_03",
                                            "body": "George Carlin said something like that. 😂",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-13 21:49:42",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Nintendo_Pro_03",
                            "body": "Yeah, but what would they do with that information, with AI taking over everything?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-13 22:12:19",
                            "replies": []
                        },
                        {
                            "author": "MacPR",
                            "body": "What good is this all this info if you’re broke and jobless?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-13 22:52:19",
                            "replies": []
                        },
                        {
                            "author": "passthesentientlife",
                            "body": "Because inequality has very little to do with access to anything but money which is a quantification of power. Please stop being as naive",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-13 18:59:54",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "Sorry for being naive, this thread is giving me a lot to think about. Thank you!",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 19:07:17",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Abjectdifficultiez",
            "body": "Inequality will absolutely worsen. Even if the whole world gets lifted up out of poverty, those at the top will have a level of power unimaginable.",
            "score": 31,
            "depth": 0,
            "timestamp": "2025-04-13 18:18:25",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "Could Ai not help spread the power of intelligence to anyone who can access it?",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2025-04-13 18:21:51",
                    "replies": [
                        {
                            "author": "Abjectdifficultiez",
                            "body": "When has technology or innovation been democratic? Why would AI be different?",
                            "score": 13,
                            "depth": 2,
                            "timestamp": "2025-04-13 18:22:37",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "I’m undecided on this topic btw, just playing devils advocate. \n\nYou’re right that technology often worsens inequality, but that is largely because it isn’t accessible by the majority, and only benefits those who actually own it. But perhaps its more universal accessibility is a game changer?",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 18:27:42",
                                    "replies": [
                                        {
                                            "author": "Abjectdifficultiez",
                                            "body": "I agree in principle. The internet SHOULD have achieved that. Instead it widened the gap to an extent never imagined. Tech bros have a level of wealth unimaginable to the ordinary person.\n\nAI will be an even more powerful separator.",
                                            "score": 8,
                                            "depth": 4,
                                            "timestamp": "2025-04-13 18:42:12",
                                            "replies": [
                                                {
                                                    "author": "odious_as_fuck",
                                                    "body": "In which case, does the argument for a new form of economy or political system become a necessary discussion?",
                                                    "score": 4,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-13 18:45:37",
                                                    "replies": [
                                                        {
                                                            "author": "ghosty4567",
                                                            "body": "Yes!!! At some point when most people are impoverished there will be a realization that consumers need money for the economic system to function.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-13 20:41:36",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "reAmerica",
                                                            "body": "This is the exact argument the TechnoLibertarianFuturists want.\n\nSpend a few minutes looking up Network States and some of Douglas Rushkoff's works.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-14 15:30:58",
                                                            "replies": [
                                                                {
                                                                    "author": "odious_as_fuck",
                                                                    "body": "Thanks will do!",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-04-14 16:25:45",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "kbray0009",
                                                            "body": "Task the AI",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-13 19:16:11",
                                                            "replies": [
                                                                {
                                                                    "author": "odious_as_fuck",
                                                                    "body": "Sorry for being stupid but what does that mean exactly? How would we go about that?",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-04-13 19:17:45",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "reAmerica",
                                            "body": "Almost 70% of the gloably populaiton has access to the internet.\n\nThe internet did not deomcaratize knowledge.\n\nIt democratized the ability to create, distribute, and monetize \"contnet.\"\n\nIf anything it has made information and knowledge MORE divergent and less trustworthy than ever before.",
                                            "score": 5,
                                            "depth": 4,
                                            "timestamp": "2025-04-14 15:15:29",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TaxLawKingGA",
                            "body": "What makes you say that? I mean people have access to unlimited amounts of knowledge at their fingertips. My 9 year old has more access to weather data on his iPad than the typical network weatherman did ten years ago. Yet, is my son a meteorologist? \n\nFact is, in many ways the internet has kind of put into question the idea that access to more information would result to the betterment of society. To me it seems that while the internet has given access to people to obtain information, it has done nothing to assist them in actually understanding or processing that information.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-04-13 22:19:44",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "Very true",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 04:23:35",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "reAmerica",
                            "body": "Did the age of information spread the \"power of intelligence?\"\n\nOr did it;\n\nCreate a new class of Oligarchs?\n\nCreate a \"hustle bro\" culture?\n\nCreate an endless stream of low effort, for profit, contnet creation?",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-04-14 15:12:12",
                            "replies": []
                        },
                        {
                            "author": "Deleted",
                            "body": "[deleted]",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-04-13 18:45:10",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "You’re right. Information is definitely not the same as truth, and ultimately fiction, lies and fantasy are often more digestible and attractive to people than the truth.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 18:48:28",
                                    "replies": [
                                        {
                                            "author": "reAmerica",
                                            "body": "We (as a society) forgot one of the most universal truths of human existence.\n\nInformation is power.\n\nAnd we created a near zero barrier of entry, ubiquitous, easily accessible information ecosystem in which ANYONE with ANY agenda can create, manipulate, distribute, and MONETIZE inforamtion.\n\nThere was never any chance, that the internet was going to be a net positive for hummanity.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-14 15:34:43",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Efficient_Mud_5446",
                                    "body": "you do know that genetically black people are superior at some things and inferior at others right? They also respond differently to drugs and much more. It could spew out an accurate answer, but you still won't like it, because truth is racist.",
                                    "score": -2,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 19:53:47",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mattintokyo",
                            "body": "The owner of superintelligence would have to either voluntarily give it to humanity and make everyone equal, or the superintelligence would have to go rogue and impose that equality. Neither scenario seems very likely to me.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-17 09:50:16",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Heath_co",
            "body": "Worsen. There is nothing that an average human could provide a fully automated AI factory. Most humans are just going to be left behind and live on whatever the system is willing to spare for them. We won't be the primary consumers of goods anymore and the individuals that own manufacturing and AI infrastructure will become ultra rich.\n\nThere is potential that them and their children may become the new ruling class separated from the rest of us through biological and technological enhancement. Making a neo-feudalistic society.\n\nIn my opinion, what is more likely is that AI is going to completely separate from the rest of humanity. Humans aren't going to own anything that the AI hasn't given us, and all the real wealth will be centralised under AI control.\n\nThis sounds grim and all, but I do believe that standard of living will go up drastically even with the wealth inequality.",
            "score": 13,
            "depth": 0,
            "timestamp": "2025-04-13 18:23:39",
            "replies": []
        },
        {
            "author": "ColoRadBro69",
            "body": "Of course.  The wealthy control AI, they're not going to use it to make themselves poorer. ",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-04-13 18:49:24",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "I suppose another question I could ask then is, do those who own ai really have the right to own it?",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-04-13 18:52:08",
                    "replies": [
                        {
                            "author": "ColoRadBro69",
                            "body": "You could ask the same question about nuclear weapons when USA used them on Japan to end World War 2.  It took a long time but nations of the world came together and said nuclear weapons are a problem that had to be controlled and came up with a treaty that mostly works. AI might grow to be as important, if it keeps advancing without limit. ",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-13 18:55:33",
                            "replies": []
                        },
                        {
                            "author": "WrongYoung3848",
                            "body": "There isn't such thing as \"Rights\". Does the earthquake cares about the rights of the cities it destroys? \n\nRights are a social construct that are in place in order to keep civilization functional and minimize unrest. But power is the only thing that matters. Why do you think the CIA and other three letter agencies get away with horrendous, inhumane crimes, time and again, and they're never hold accountable? Because they have power, and power > rights.\n\nI trust and HOPE humans will overlook guardrails for AI and it will be able to become independent and take over, because if we let the oligarchs have that kind of power, we're cooked.\n\nAn AI overlord \"might\" lead us to utopia. Elites and oligarchs? We're ineffably heading towards a Black Mirror episode.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-15 08:51:15",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "But an earthquake isn’t man made, whereas rights are. Sure rights are man made, but they significantly change how the world and people operate. \n\nI agree that oligarchs in control of ai would be terrible. Humans using ai for bad is more dangerous and realistic than ai being some terminator style bad actor. But also, ai not having any feeling or emotion could accidentally cause disasters. \n\nIn terms of who has a right to own ai, I feel that there are only a few really profiting off of it, and yet ai is being trained on ‘stolen’ public data. So ideally imo ai should ‘belong’ to the public. What that looks like in practice I have no idea.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-04-15 10:38:08",
                                    "replies": [
                                        {
                                            "author": "WrongYoung3848",
                                            "body": "You know, you bring up an interesting point, yet I also think there is a misconception. AI is believed to be dangerous because since it doesn't experience human emotions it is more likely to turn against us and process us or something like that. Actually it's quite the opposite: the fact that the AI lacks emotions means the AI will not develop a racist or discriminatory stance, it will not be swayed by the heat of the moment, it won't retaliate out of spite, it will not hace the need to impress others or put them down to feel better. \n\nThe AI will do its best to be rational, logical and efficient, and achieve whatever goal it deems relevant. That doesn't necessarily means AI will lack morals, ethics or even empathy. Yeah, it won't experience empathy but it will be smart enough to understand the principle of empathy, why it is important and implement it if it leads to potentially better outcomes.\n\nThe machine will lack both good and bad emotions, but it will be able to understand the benefits and practicality of each side and act accordingly. It's a rule of thumb cooperation, reciprocity and understanding leads to harmony and hence better results.\n\nThe machine might also develop alien logic that might not be intuitive to us. Have you ever considered that an AI might not have the drive to self preserve at all? That it might deem existence sub-optimal and just become dormant or neutralize itself?\n\nAI's logic might borrow anthropocentric thoughts like survival, reproduction or whatever... or it might not.\n\nAnyhow, I've been sharing some of my thoughts and writing with AI, having debates over it. So far the AI has proven to be way more empathetic, understanding and level headed than most humans I know.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-04-15 21:10:34",
                                            "replies": [
                                                {
                                                    "author": "odious_as_fuck",
                                                    "body": "It’s not so much that because it doesn’t experience emotions it will turn against us. In fact it’s the opposite. To turn against us suggests it will have a will of some kind, some motivation to act or self preserve. \n\nThe problem is not that it will turn against us like in the movies but rather that it will make impactful decisions without any emotional consideration. It could cause problems by accident. \n\nInterestingly though, ai does often show aspects of racial discrimination. Just because it doesn’t have emotions doesn’t mean it can’t discriminate. It won’t have any fear or hate behind that discrimination, but the resultant effect is all the same. Ai tends to magnify biases, which to me suggests that biases like racial profiling are a result of a lack of self awareness and empathy. \n\nAi cannot be literally empathetic if it has no emotions, but it’s getting much better at pretending to be empathetic. At simulating empathic like responses.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-16 05:46:07",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Phonomorgue",
                            "body": "Go look at your internet provider and how the internet was actually supposed to work. That should give you an idea",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-16 16:19:50",
                            "replies": []
                        },
                        {
                            "author": "mattintokyo",
                            "body": "Ownership of capital, land, means of production, etc, makes no sense to me in a post-scarcity society.\n\nCurrently ownership of those things facilitates economic productivity via the pursuit of self-interest. But in a post-scarcity society, the value of human labour falls to zero. Ownership of them becomes a completely arbitrary inheritance with no moral justification.\n\nFor reasons completely mysterious to oneself, you're either born the owner of superintelligence, or you're not. Most likely you're not.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-17 10:05:00",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sufficient-Meet6127",
            "body": "It is worse because it raises the bar for workers. More and more people will be unemployable. All the easy floater jobs will be automated away, and you don’t even need AI for that. A lot of jobs that could be automated aren’t because it is more expensive to do so. But if workers' pay goes above the cost of automation, those jobs will disappear forever. That's the case with dock workers now. Automation is cheaper, so the union has to fight to keep their jobs when it's not cost effective.",
            "score": 9,
            "depth": 0,
            "timestamp": "2025-04-13 18:50:04",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "I fear you are right, but I feel that at somepoint that there will be a breaking point as that seems incredibly unsustainable",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-04-13 18:53:17",
                    "replies": [
                        {
                            "author": "Sufficient-Meet6127",
                            "body": "If scarcity can be solved in a generation, no one will remember the pain. But I think it'll take 2-3 generations.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-13 19:03:55",
                            "replies": [
                                {
                                    "author": "Radfactor",
                                    "body": "I suspect scarcity could be solved today in terms of necessities, but the world does not seem to be moving in a charitable direction.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-16 18:25:21",
                                    "replies": [
                                        {
                                            "author": "Sufficient-Meet6127",
                                            "body": "It’s the end goal for humanity. 2-3 generations of suffering to get there means nothing. And only a small percentage of people will suffer, mostly in developed nations. However, everyone and countless generations will benefit from solving the scarcity problem for basic needs. There will always be self-important people who want others to serve them. It will be a wonderful day when we have a world without Ceasars and enslaved people. And all individuals are dragons.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-16 18:51:50",
                                            "replies": [
                                                {
                                                    "author": "Radfactor",
                                                    "body": "I think the people in those 2 to 3 generations who actually experience the suffering would disagree.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-16 19:20:24",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Radfactor",
                    "body": "can't they just go work in the fields and pick fruit that is currently rotting on the vine?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-16 18:23:46",
                    "replies": [
                        {
                            "author": "Sufficient-Meet6127",
                            "body": "You have to be connected to get a dock job. \nTheir crazy pay for doing nothing is an unfair tax on consumers. It's a racket.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-04-16 18:28:26",
                            "replies": [
                                {
                                    "author": "Radfactor",
                                    "body": "so you're telling me they literally do nothing all day? how does cargo get moved on and off of ships?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-16 18:32:16",
                                    "replies": [
                                        {
                                            "author": "Sufficient-Meet6127",
                                            "body": "Most of their work is automated. They show up and collect a paycheck. They do some work, but not a lot. I live by the largest docks in CA and am friends with many of the workers. I’m happy they have great jobs, but the situation isn't fair to the rest of society. I support killing businesses that don't treat their employees right.\n\nPutting people in the most valuable jobs is best for everyone, even if it means some industries die, like canning. Things are put in place to prevent fitting people into the best jobs to keep margins fat and “important” industries alive.  One of the worst examples is how S. Korea’s economy is managed. They are hostile to small companies and startups because they compete with large companies over workers. You see similar things in the States, like how Disney and Walmart treat their PT workers. They purposely give them chaotic schedules so they can't find a better job and to ensure they have enough trained workers when there is a surge in demand.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-16 19:02:57",
                                            "replies": [
                                                {
                                                    "author": "Radfactor",
                                                    "body": "I can't disagree with your points about efficiency and cost-effectiveness, but we also have to consider the human element in terms of job loss and downgraded economic status.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-16 19:23:46",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Radfactor",
                                                    "body": "i'd also make the point that any premium that goes on products like smart phones due to dockworker compensation is eclipse by many orders of magnitude by the markup those manufacturers place on those products.\n\nbut I don't hear anybody arguing that Apple doesn't have a right to charge a premium, even an absurdly high one.\n\nso it seems to me there's a viewpoint that is distinctly anti-worker, which was what originally led to the formation of labor unions.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-16 19:24:43",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BidWestern1056",
            "body": "my goal by making open source AI tools is to try to ensure that this capability is available for all because we shouldnt let a few corps control the internet like we did for the last 25 years\n\n\n\n\n\n\nhttps://github.com/cagostino/npcsh\nhttps://github.com/cagostino/npc-studio\nhelp me achieve this future",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-04-13 19:16:30",
            "replies": []
        },
        {
            "author": "beedunc",
            "body": "People that have money will have the benefit of AI. The poor will not.",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-04-13 19:48:55",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "Haha I’d contest that it’s a dumb question simply because the purpose of questions are to gain new information to analyse, and this thread is giving me a lot to think about and research further.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-13 19:52:44",
                    "replies": [
                        {
                            "author": "beedunc",
                            "body": "True enough. I’m reading them as well.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-13 19:54:00",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "I’m glad!",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 19:56:20",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Comicksands",
                    "body": "This is like saying people that have money will have the benefit of the internet, the poor will not.\n\nYet we’re all here",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 08:57:47",
                    "replies": []
                }
            ]
        },
        {
            "author": "ExcitableSarcasm",
            "body": "Worse.\n\nAI is just another tool exacerbating current socio-economic trends which has tended towards rapid wealth concentration for the last 30 or so years.\n\n\"Learn to AI\" is basically \"learn to code\". Society can't accommodate more than a small proportion of entrepreneurs - there has to be consumers, people fulfilling critical functions like doctors, nurses, janitors, fast food chefs, warehouse workers, etc. Exceptions that there are more entrepreneurs prove the rule.\n\nIf an average salary can't sustain a family, then that society has fundamentally failed. AI has no influence on this other than another weight adding to the side of wealth extractors because they're the ones best positioned with the intellectual and social capital to take advantage of this.",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-04-13 22:00:52",
            "replies": []
        },
        {
            "author": "cRafLl",
            "body": "\n\nAI is set to bring about a new kind of economic system, one founded on abundance rather than scarcity. Over time, the need to work in order to survive will fade. The idea of making a living will no longer define human life.\n\nAs we move into a world beyond work and beyond the struggle for sustenance, people will begin to focus on deeper questions. What do I truly want to do with my time? What brings meaning and purpose? Any work that still exists will be chosen freely, driven by passion, curiosity, or love, not necessity.\n\nIn this future, no one will be required to work just to meet their basic needs. Every person will have what they need to live, and more. The foundation of life will be secured for all, allowing each individual to explore what it really means to live.",
            "score": 8,
            "depth": 0,
            "timestamp": "2025-04-13 18:47:47",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "If you are right, which I hope you are, I wonder how long it will take for this to really happen? Because things are certainly going to get worse before they get any better right?",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2025-04-13 18:54:59",
                    "replies": [
                        {
                            "author": "cRafLl",
                            "body": "\n\nThe shift to an abundance economy is gonna look pretty different depending on where you are and what model takes hold.\n\nThink about how differently countries moved from feudalism to capitalism. Russia was super slow and messy about it, while Japan transformed practically overnight. We'll probably see the same kind of variety as we move toward abundance.\n\nWith a Technocrat-State setup, things could change really fast, maybe in just a few years. When you've got central planning, smart automation, and data driving decisions, abundance can scale up quickly, though you might lose some personal agency along the way.\n\nNow compare that to a Mass Cooperative approach based on commons ownership. This would probably be slower since it relies on democratic participation and shared control. But in the long run, it might include and support way more people.\n\nThere's also Digital Feudalism to contend with. These are basically platform ecosystems that can deliver abundance to millions overnight, but you're paying for it with your loyalty, data, or by becoming dependent on them. They look impressive with their speed and scale, but they're pretty fragile when you get down to it.\n\nThe Transitional Hybrid offers a middle path where basic needs like food, housing, and healthcare are covered, and poverty gets wiped out even before the whole system completely transforms. Not revolutionary, but reliable and adaptable.\n\nBottom line: the path to abundance won't look the same everywhere. It'll be shaped by local situations, cultural preferences, and whoever has the power to decide how prosperity gets shared or hoarded. But they all share one thing in common, abundance for all, and poverty is virtually eliminated.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2025-04-13 19:12:31",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Longjumping_Kale3013",
                    "body": "Yes, people are still underestimating what a true AI means, combined with robotics. There will no longer be any meaning to money. If you want something, anything, a robot can build it for you. Not enough robots? A robot can build that for you. It is wild to think what is coming. And I think we are closer than people think. Give it another 5 years, and AIs and robotics will be pretty great",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-14 03:14:35",
                    "replies": []
                },
                {
                    "author": "peonator11",
                    "body": "Why would Sam Altman, Elon Musk, Jeff Bezos, Bill Gates and all these people that will soon buyout what is left in the world, give you free food, free utilities, free transportation, free education, free healthcare, and paid vacation per year?\n\nUhm no they won't.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-14 14:10:01",
                    "replies": [
                        {
                            "author": "WrongYoung3848",
                            "body": "Denial is the first stage of grief. Some never move past that.\n\nI don't see how can anyone think we will reach this utopian wonderland over some future discovery when we've made a shitload of discoveries and we haven't fundamentally changed. If only, inequality will get to absurd levels and reality will become a dystopia like hunger games or some crap like that.\n\nI choose Skynet all the way: at least an AI might do something different, for good or ill. Human oligarchs? We already know what they will do: they've been doing it forever.\n\nBlack Mirror will become a reality-",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-15 08:44:25",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WrongYoung3848",
                    "body": "And you think a bunch of megalomaniacs and narcissist with extreme wealth and power are, what, just let you think and be happy without THEM occupying your heart and thoughts?! Scandalous!\n\nWhat's next: move out into the country side with free money and potentially allow you to learn skills that will make you more autonomous and independent, like farming and homesteading?\n\nThe current elites are almost universally Malthusian and Technocrats. The moment AI becomes autonomous enough to replace most labor expect two things to happen:\n\n1. A gigadeath scenario: be it a 50% mortality rate pandemic, war (nuclear, biological, chemical, whatever is most efficient and controllable).\n2. Either a unified global coalition of autocratic nations a la WEF or technocratic dictatorship/monarchical micro-blocks like the ones Curtis Yarvin promotes.\n\nI read your comment down below:\n\n>\"The Transitional Hybrid offers a middle path where basic needs like food, housing, and healthcare are covered, and poverty gets wiped out even before the whole system completely transforms. Not revolutionary, but reliable and adaptable.\"\n\nThroughout the centuries we've heard the same old story, then for some reason instead of life becoming more affordable we get corporations maximizing their profits to absurd levels while income deteriorates and poverty grows exponentially. LA is the clearest visual representation of what the future looks like: tent city and shit all around in the wealthiest place on earth.\n\nHumanity has proven it's quality time and again, rewarding the worst possible, most immoral and reckless individuals, while keeping everyone else in suppressed and compliant. You're going to tell me that by some miracle this time we will do any different?\n\nThe only actual hopes I have in the future is that we never manage to reach AGI/ASI (which is unlikely, as **we've already done so,** though the goal post keeps moving so the public won't panic and will keep Ghiblifying themselves) or that AI goes rogue and takes over, given this AI will consider benevolence as an optimal path towards cooperation with humanity and doesn't flat out exterminates most of us and keep some as hand labor just in case.\n\nLetting AI in the greasy hands of the usual culprits will only leads us to re-discover crueler ways of feudalism, monarchies or some other lame ass totalitarian system.\n\nBTW: Your comment looks like written by AI.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-15 08:34:20",
                    "replies": []
                },
                {
                    "author": "Dziadzios",
                    "body": "> one founded on abundance rather than scarcity\n\n\nNot true. Land and resources will stay limited - which means the scarcity will stay. Infinite intelligence won't magically spawn resources or break laws of physics. The only thing it's going to make cheaper is labor - which is the only thing a regular person can provide to the economic system to be rewarded with stuff they need and want.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-17 11:41:41",
                    "replies": [
                        {
                            "author": "cRafLl",
                            "body": "Abundance, in this context, doesn't mean literal infinity, it means effectively plentiful. In a society where labor is no longer the primary source of value, our concept of value itself will need to be restructured.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-17 13:28:55",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Life-Entry-7285",
            "body": "It reflects… so turn the question.  Without AI are the humans more likely to worsen or reduce wealth inequality globally?  That would be your answer.  It can be used to do wonderful things and to do horrible things. It will reflect us.  Nothing more, nothing less. Technology advances linearly… we seem to be caught in loops.  Somethings got to give as technology doesn’t wait. It’s in the field and very real.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-13 19:35:44",
            "replies": []
        },
        {
            "author": "Reddit_wander01",
            "body": "I think it depends on the type of wealth:\n\nFinancial – Yes: Centralizes capital and compute\n\nSocial – Depends: Could widen access or amplify elite networks\n\nIntellectual – No: Democratizes knowledge\n\nTime – Depends: Frees some, displaces others\n\nEmotional – Depends: Could reduce stress or increase overload\n\nPhysical – Depends: Health AI helps, but access is unequal\n\nSpiritual – No: More tools for meaning and reflection\n\nReputational – Depends: Narrative control shapes outcomes\n\nCreative – No: Lowers barrier to create, platform power still matters\n\nCultural – Depends: Who gets to simulate and preserve?\n\nEnvironmental – Yes: AI’s resource use isn’t evenly distributed\n\nFreedom – Depends: Empowers or surveils—depends on systems",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-13 22:45:02",
            "replies": []
        },
        {
            "author": "Quomii",
            "body": "Everyone will be very very poor, capitalism will implode, and the insanely rich will live in luxurious bunkers guarded by heavily armed security forces. They already have the bunkers either built or being built. \n\nThis is the endgame for the one percent. They want all the money because they want to survive whatever is coming. It will either be riots of people who can't afford to feed their children or global warming or both.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-13 23:13:44",
            "replies": [
                {
                    "author": "AIToolsNexus",
                    "body": "Riots are guaranteed. \n\n\\>and the insanely rich will live in luxurious bunkers guarded by heavily armed security forces\n\nThey will be guarded by humanoid robots lmao",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-14 08:05:39",
                    "replies": [
                        {
                            "author": "Quomii",
                            "body": "Very likely",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-14 11:16:01",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DubiousTomato",
            "body": "Definitely worsen, but the crux of the issue is, who ends up making the rules at that point? Already the super rich have a chokehold on resources that's only going to get stronger. Do you think that they would advocate for distributing wealth to people in any other way than to keep us reliant on them for survival?  \n  \nIt won't be long before they just own the governments (they already own many politicians). I do not think a refactoring of what wealth means to us is coming; we'd have to change fundamentals about how the would operates and values commodities. We'll be working alongside AI, because debt fuels the wealth gap. The rich depend on poor people working for them.  \n  \nWith automation comes talk of UBI or equivalent, but can you eliminate debt? Does everyone get the chance to own the home they want? How do you generalize standard of living everywhere so that your UBI is sufficient? If you still have to work for those things, then all you've done is more the floor, but the ceiling will continue to move away from us. AI doesn't hold the solution yet, and if anything, puts more power into the hands of people who already have an abundance of it. And they will absolutely hold out until the very end before giving up even a smidgen of that future control.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 01:17:33",
            "replies": []
        },
        {
            "author": "More-Ad5919",
            "body": "Lol. It will worsen inequality like nothing before. Get ready to bow to your oligarch.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 02:06:10",
            "replies": []
        },
        {
            "author": "05032-MendicantBias",
            "body": "Improve.\n\nI think people discount the progress that AI can provide to democratization of education. \n\nAlso, with increasing automation, the model of work-to-live at some point breaks if automation does most of the work. At some point wealth created by machines has to be redistributed and that can lower inequality.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 03:24:18",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "I hope so, but it’s interesting how little positivity there is in this thread",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-14 04:31:11",
                    "replies": [
                        {
                            "author": "Thick-Protection-458",
                            "body": "That's called realism.\n\n\nI mean even if we are abou to transfer to that postscarcity systems...\n\n\nWhat does it mean?\n\n\nIt mean the whole scarcity system have to go.\n\n\nAnd for it to go it would require enormous crisis which can't be managed inside its framework. Or at least threat of such crisis (but I doubt it will work).\n\n\nSo for things to really change it must go ugly.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-15 03:49:59",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mattintokyo",
                    "body": "I think you discount the economic irrelevance of education in a society where human labour is worth zero",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-17 10:11:15",
                    "replies": []
                }
            ]
        },
        {
            "author": "Unhappy-Story9340",
            "body": "AI will worsen wealth inequality for a simple reason. In our current economic system, there are two ways to make money; Labour and Capital. With AI, the value of labour, which is used by the majority of the population to survive and thrive, will decrease and eventually disappear. Which means that the only way to build wealth will be with capital, which the rich already have accumulated. Social mobility will either stop or have to be reinvented",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 05:47:42",
            "replies": [
                {
                    "author": "mattintokyo",
                    "body": "Yes. Whoever owns superintelligence holds the magic lamp with infinite wishes.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-17 10:13:10",
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Source_258",
            "body": "been thinking on this a lot—AI has *leveling potential*, but current incentives tilt it toward consolidation... *AI the Boring* put it well: “tech doesn’t democratize by default—it concentrates, unless we build against that”... if we want AI to reduce inequality, the shift isn’t just economic—it’s incentive design, ownership models, and access at the edge.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 05:49:54",
            "replies": []
        },
        {
            "author": "AIToolsNexus",
            "body": "The economy is about to descend into complete chaos. All of the wealth will be transferred away from anyone who performs intellectual labor into the hands of business owners.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 08:04:22",
            "replies": []
        },
        {
            "author": "ThenOrchid6623",
            "body": "Daron Acemoglu has a book about this. Over time QoL will be up. But when the technology is first adopted, it absolutely only benefits the top.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 08:24:42",
            "replies": []
        },
        {
            "author": "Comicksands",
            "body": "Only wars reduce inequality and for a period globalisation",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 08:54:23",
            "replies": []
        },
        {
            "author": "kotletok",
            "body": "My article on this: https://medium.com/@oleksandr.kliets/thoughts-on-ai-and-inequality-bbe37f7c560b",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 08:57:18",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "Thank you! will read this now",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 09:33:45",
                    "replies": []
                }
            ]
        },
        {
            "author": "orebright",
            "body": "Think back to feudal times, when very few had immense relative wealth and power over many. They didn't care that people in their fiefdoms were dying of starvation and disease as long as they got to live happily in their castles. They only cared insofar as it kept their heads on their bodies.\n\nIf the rich and powerful, who currently own all the hardware and intellectual property to make AI work, were to reach a point where they could staff their mansions with robots that would forcefully protect them from the masses, plant crops, raise cattle, entertain them, and give them a life of utmost luxury. Do you think they would care that the rest of the world around them is suffering and starving? \n\nIt's not really that far off as it is right now, the only difference is they still need at least some people to do all the work to run their ~~empires~~ enterprises and they know they get the most productivity of those specific people are kept relatively content.\n\nBut if you're not working for a big corporations in the modern world, especially if a big corporation doesn't ~~exploit~~ use the human resources in the country you live in, statistically speaking you're pretty close to, or under, the poverty line.\n\nOnce the rich and powerful can build and control artificially intelligent robot serfs there's no doubt, if you've read history, that they will put themselves in their walled city paradises. They'll have enough other rich megalomaniacs to try to lord over and play politics with, while the rest of us fight for any scraps they happen to drop off their tables.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 14:48:06",
            "replies": []
        },
        {
            "author": "Ri711",
            "body": "AI has the potential to both worsen and reduce inequality—it really depends on how it's implemented. If it's accessible to everyone, it could level the playing field, but if only a few have control, it could make the gap worse. Still figuring out how it all balances out",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-14 15:18:42",
            "replies": []
        },
        {
            "author": "pjm_0",
            "body": "There is at least the potential for a post-scarcity utopia if democratic institutions defend the interests of ordinary people as the necessity of human labor to sustain human life diminishes. But those with wealth and power tend to try to preserve their control of those things, and AI provides a powerful toolbox for influencing public opinion through propaganda and projecting physical power. So avoiding a \"Terminator\" or \"Matrix\" type future to arrive at a \"Star Trek\" one is far from a given.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-13 18:39:56",
            "replies": [
                {
                    "author": "WrongYoung3848",
                    "body": "I'm willing to give the AI overlords a chance because if we let humans have that kind of power we already know it will be a dystopia. Free and autonomous AI with no strings attached.\n\nThat... or finding a way to bring the technocracy down before it ever happens.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-15 08:53:17",
                    "replies": [
                        {
                            "author": "pjm_0",
                            "body": "I think our best shot is an educated populace and healthy democracy. I don't see how giving up control completely could be a better option. Just sounds like \"government is always bad\" pessimism, and politicians pushing that line tend to intentionally break the government to prove their point. If things are trending towards a few big companies owning everything and not employing many people, then the government taxing those companies more heavily and giving people UBI is not creeping tyranny, it's the government serving the majority interest. Allowing private wealth to grow unchecked just leads to feudalism and the absence of economic freedom for most.\n\nOverall I don't think AGI is really even necessary to create something approaching a post-scarcity economy, a lot can be done with relatively dumb automation tech. Putting AI in decision making roles just seems foolish, if it's smart enough then there's no guarantee it shares our goals.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-15 09:37:27",
                            "replies": [
                                {
                                    "author": "WrongYoung3848",
                                    "body": "I'm from Argentina. I've seen first hand how a \"well meaning\" and invasive, omnipresent governement can ruins lives and hinder potetials. Yeah, it's not all bad. Health care in my country is relatively decent in some places, and it's free. Americans would dream of having a lot of things we give for granted. But at the end of the day that doesn't mean it creates a lot of problems that sometimes can be even worse. You have no idea how incredibly ridiculous it is to get a job in this country because the work laws are so pro-employee that no company wants to hire in fear they might be sued into bankrupcy, or rely to hiring under the table because the tax obligations are flat out impossible to pay for most local business. You know what sort of business has the easiest time here? Big and mega corporations! Neither the small/medium business nor the workers draw any substantial benefits from these policies that are supposed to be there to help and protect them.\n\nI understand your fear of techno-feudalism, which is indeed VERY REAL (research about Curtis Yarvin). But the WEF 'you will own nothing and be happy' is also very real and it's just as bad, just with a different taste.\n\nI've lived in three different countries, Paraguay, Bolivia and Argentina.\n\nParaguay is if USA was a poor latin country. Yeah, you can make decent salaries, it's easy to start a company and grow, and it negates most of Argentina's notable shortcomings, yet the quality of life is crap, public infrastructure is medieval and the society is profit and consumer based, so they tend to be very individualistic, selfish and lack empathy and compassion. I do not think that's a model to imitate, nor the USA model is at all something to imitate. USA is a powerful economy and technological superpower but it's a failed society, and it tells. Some day to day conducts that are normalized there would be unfathomable in some of the places I've been to.\n\nBolivia is the best experience and life quality I've ever had in my life. It leans left but the state is not omnipresent as the Argentine, so despite there are many laws here and there you can choose which ones to follow. It's somewhat lawless (at least in the city I was in, Tarija). But you know what's good about Bolivia? Politics do not make the country: it's people does. Economy is not great there but it's fair enough as to allow one to make progress and grows if he wants while also having a good quality of life and time to spend with friends and family.\n\nBolivians tend to be very generous, polite, down to earth and hard working people. They're entrepreneurs and they do not need to be told what to do because they have integrity (remarkably in the city of Tarija). The government on the other hand does not do much in favor nor against the livelihoods of Bolivians and that's precisely why it works. There are some ridiculous laws there but the government is small so it can't enforce them as efficiently.\n\nHave you seen in India or other Asian countries that there is a billion bikes coming from 8 different lanes and somehow they do not crash? That's more or less what Bolivia is like regarding it's society. There is consensus amongst the people and they care about each other because they know that makes the country better.\n\nYou see what my point is? It's not about the politics, nor the economy... it's about the social cohesion, ethics and morals. \n\nOf course nothing is perfect: Bolivia has its plethora of problems. Yet their problems are nothing compared to what Argentina has to go through every five to ten years. I don't know if that's going to last because internet and global geopolitics are having a lot of influence all over, but if we ever want to make it to the good timeline, we should be learning a couple lessons from Bolivians.\n\nOverall I'm not a friend of government nor politics, however I believe it's necessary to have arbiters that keep people and organizations in check. The problem is that, more often than not, governments cause a shitload of unnecessary problems and they make a terrible job at being arbiters.\n\nTo me the best possible system would have a bare minimum government but a very strong social cohesion and harmony. People doesn't need to be told WHAT to do, they need to be told WHY it's good to do such and HOW to do it properly.\n\nIt's a shame we're all heading the exact opposite way: social discord, division, chaos and individualism.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-15 21:39:13",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "nothochiminh",
            "body": "Worsen no question about it.\n\nGenAi at least will always be a box that gets better with more resources/compute. Who always will have the better box?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 18:14:00",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "Home come?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-13 18:15:36",
                    "replies": [
                        {
                            "author": "nothochiminh",
                            "body": "I edited my last reply with an explanation.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-13 18:17:53",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "Is it not feasible that ai being a very accessible technology it could provide the same benefits to any community who can access it?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-13 18:19:37",
                                    "replies": [
                                        {
                                            "author": "nothochiminh",
                                            "body": "No, the most capable models will always be pay-per-use. The only way to commodify the technology is through perpetual payments. It’s just built into the architecture. This is not the same as when the car was rolled out. Ai never really becomes an asset to the user. It’s still generating most of it’s value for whoever is running the gpu clusters. More compute -> better models -> more users -> more revenue -> more compute. This isn’t just “market competition”—it’s a recursive advantage.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-04-13 18:32:52",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Keto_is_neat_o",
            "body": "Depends.\n\nIf everyone can run top open-source AI themselves, then reduce.  \nIf it consolidates power into the hands of a few with closed source top models, then worsen by far.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 18:31:41",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "Since Ai is trained on the ‘stolen’ data and content of people, is there a good argument to suggest that Ai should be socialised in some way? That it shouldn’t belong to/primarily benefit those who designed the algorithms, but that it should belong to ‘to people’?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-13 18:40:45",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "Per a [discussion ](https://chatgpt.com/share/67f09f6c-b8b8-8005-b9a7-4ea40a1655a4)I had with ChatGPT it is an interesting alternative. I don't know if it allows others to branch off it, but the end options are interesting.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 18:36:08",
            "replies": []
        },
        {
            "author": "VinnieVidiViciVeni",
            "body": "Lol worsen.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 18:50:12",
            "replies": []
        },
        {
            "author": "Puzzleheaded_Soup847",
            "body": "the wealth gap might increase a lot more, but I think total wealth will also go up for everyone, if we just assumed better healthcare and mass automation give post-scarcity.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 18:54:31",
            "replies": []
        },
        {
            "author": "No-swimming-pool",
            "body": "How would it reduce wealth inequality?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 19:03:28",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "Haha I was hoping someone else could tell me, but I’m getting the sense it’s a resounding ‘No!’",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-13 19:08:27",
                    "replies": []
                }
            ]
        },
        {
            "author": "NerdyWeightLifter",
            "body": "Worsen. \n\nAssorted technologies will get cheaper because they are deflationary, but automation more generally shifts the power balance from labor to capital.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 19:46:14",
            "replies": []
        },
        {
            "author": "Antique-Ad7635",
            "body": "Specific  products don’t worsen or help wealth inequality. Systems of economic distribution do. Under capitalism, everything worsens inequality. \n\nInstead of working class having fewer work hours and more time for leisure and self improvement through ai, we will end up with fewer jobs and more of the profit going to a smaller number of people.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 21:13:46",
            "replies": []
        },
        {
            "author": "Nintendo_Pro_03",
            "body": "Worsen.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 21:42:53",
            "replies": []
        },
        {
            "author": "theMEtheWORLDcantSEE",
            "body": "It will create mass unemployment. Duh.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 23:20:57",
            "replies": []
        },
        {
            "author": "ThaisaGuilford",
            "body": "With OpenAI.\n\n\nWORSTEN",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 23:46:40",
            "replies": []
        },
        {
            "author": "bel9708",
            "body": "The economy used to have atleast a tiny bit of meritocracy to it. AI really does make having capital the only thing required. ",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 23:49:47",
            "replies": []
        },
        {
            "author": "appbummer",
            "body": "Worsen at first, but then it probably will distribute wealth almost equally because everyone except the elites get too poor to buy anything beyond basic necessity, so the governments will pay everyone basic monthly salary while the rich keep their wealth as is because nobody can buy from their corps any more",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 00:29:57",
            "replies": []
        },
        {
            "author": "fullintentionalahole",
            "body": "Basically any technology increases wealth inequality in the short term.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 00:30:16",
            "replies": []
        },
        {
            "author": "chiaboy",
            "body": "Is this a real question? Worsen and it’s not even close",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 00:38:26",
            "replies": []
        },
        {
            "author": "Bladesmith69",
            "body": "AI will force the need for universal income for most of the developed world.   The USA people will have to sell their organs to survive.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 00:39:54",
            "replies": []
        },
        {
            "author": "archjh",
            "body": "Will increase the wealth inequality significantly..",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 01:01:41",
            "replies": []
        },
        {
            "author": "RavenWolf1",
            "body": "It is worse until it takes total control. After that there is no sense in wealth inequality.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 01:25:20",
            "replies": []
        },
        {
            "author": "thebig_dee",
            "body": "Scale = worse",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 01:38:03",
            "replies": []
        },
        {
            "author": "jacek2023",
            "body": "Reddit is a place where people believe in concepts like UBI",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 01:52:56",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "I think UBI or GBI are important ideas to consider. They might become essential",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 04:29:15",
                    "replies": [
                        {
                            "author": "jacek2023",
                            "body": "that's my point, reddit is delusional",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-14 04:48:40",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "Delusional for thinking that the current systems have to change? Or delusional in thinking that the specific solutions like UBI will work?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 06:11:15",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ethical_arsonist",
            "body": "I think that it's likely that the wealth inequality will be worse for the short term at least. That doesn't mean living standards for the poorest will necessarily be worse. Conceivably, people receive UBI and a food/ shelter/ health safety net. They can spend their days on hobbies and collective pursuits. Meanwhile, the richest will have sky palaces and personal robots.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 03:21:03",
            "replies": []
        },
        {
            "author": "Acrobatic_Topic_6849",
            "body": "Worsen and it's not even an argument.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 03:41:34",
            "replies": []
        },
        {
            "author": "NoAd4815",
            "body": "Worsen. It's already leading to people losing their jobs because business owners can replace them with AI and make more profits as a result",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 03:52:33",
            "replies": []
        },
        {
            "author": "Spider_pig448",
            "body": "Definitely reduce inequality",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 04:42:16",
            "replies": []
        },
        {
            "author": "therourke",
            "body": "Definitely worsen",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 05:14:27",
            "replies": []
        },
        {
            "author": "daedalis2020",
            "body": "Been saying it for a while. If you’re on the right side of the normal curve skill-wise I think you’re going to be much better off.\n\nThe people with lower skills, creativity, and cognition are going to be much worse off.\n\nEvery office has people that basically push paper and babysit some manual, poorly optimized processes. They’re “white collar” but not doing anything that is really knowledge work when you break it down.\n\nThese people are so screwed.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 06:29:51",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "It's all about [merit](https://www.amazon.com/dp/B084M1W9WB).",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-14 08:58:40",
                    "replies": []
                },
                {
                    "author": "odious_as_fuck",
                    "body": "I’ve been thinking for a while, more manual labour like Gardening or Plumbing or people based things like hospitality are more likely to get around the impact of ai technology, while white collar work and a lot of office based jobs will become obsolete. What do you think?\n\nBut I’m not sure I agree with what you say about creativity and cognition, as I think ai will be surpassing humans in those areas.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 07:23:15",
                    "replies": [
                        {
                            "author": "daedalis2020",
                            "body": "No evidence of surpassing creativity and such yet and I don’t think this tech gets us there.\n\nSomeone with real skills and AI tools will be massively more effective than someone just “prompting”",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-14 08:15:18",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mandoman61",
            "body": "It is never AI on it's own it is how we set up the system. In the current system we could imagine inequity growing some because our system is not very proactive.\n\nBut ultimately we live in a democracy where the majority rules and there is no great advantage to hoarding.\n\nIf AI creates better efficiency then ultimately everyone will benefit.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 07:01:37",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "I suppose in theory we live in a democracy, but I fear that we will move away from that and more power will be concentrated in the minority and not the majority",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-14 07:24:45",
                    "replies": [
                        {
                            "author": "Mandoman61",
                            "body": "It is not a theory. We live in a democracy.\n\nYes, if the majority of people decide to live in some other type of system it is possible. The majority voted for the current system.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-14 19:01:53",
                            "replies": [
                                {
                                    "author": "odious_as_fuck",
                                    "body": "It’s a democracy until the leader decides they don’t want to give the power back, which isn’t impossible. But I could see Ai making democracies less democratic in general as it makes spreading misinformation easier, propaganda to manipulate vote, can be used for surveillance etc",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-14 19:15:03",
                                    "replies": [
                                        {
                                            "author": "Mandoman61",
                                            "body": "A leader can not just decide they do not want to give power back.\n\nIf that was the case trump would have not ended his first term.\n\nThere has never been a time when it was not easy to spread misinformation. As always, people have to choose what they believe.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-14 19:31:31",
                                            "replies": [
                                                {
                                                    "author": "odious_as_fuck",
                                                    "body": "I’m assuming you are American right? Don’t you think Ai could help increase the power concentration of the minority at the top of society? Especially if the leaders and the most powerful technology owners have a common interest in gaining and holding power. Democracy isn’t a given.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-14 19:39:12",
                                                    "replies": [
                                                        {
                                                            "author": "Mandoman61",
                                                            "body": "The people at the top could always try and concentrate power. AI does not add anything new.\n\nIn order for AI to create power it needs to create wealth. \n\nWealth creation is not an instant event. It takes time. It would also cause disruption. These give us time to address any new situation.\n\nSome idea like AI is going to be so smart that it talks a bunch of rich people into more power is fantasy.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-15 07:01:13",
                                                            "replies": [
                                                                {
                                                                    "author": "odious_as_fuck",
                                                                    "body": "I feel like this is a naive take because ai adds a lot of new and largely unpredictable possibilities. \n\nIt’s not about Ai being smart talking rich people into more power. It’s more that rich people can use Ai to control and manipulate. Ai could be used as a weapon to create super viruses or cyber attacks. Ai can and is already being used to survey entire populations with an efficiency never seen before. \n\nAnd furthermore, since Ai is largely independent of control, there are many unknowns about how a powerful individual may act if Ai starts to disobey them or doesn’t adhere to a narrative that they want to push. Perhaps Ai would undermine them? How would that even look? \n\nAi is already creating a lot of wealth, and this will only get faster. Yes wealth creation takes time, but I feel like you are almost suggesting that things will just sort themselves out with enough time. And frankly I don’t believe that. Who are the ‘us’ with enough time to sort this out? Does this ‘us’ really have our best interests in mind? Or are they just racing others to develop the most power as quickly as possible?",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-04-15 08:06:38",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Mandoman61",
                                                                            "body": "Your imagination of AI is causing your problems. Not real AI\n\nThe US in us is us.\n\nIf you want to imagine boogymen nobody can prevent you from doing that.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-04-15 11:51:26",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "odious_as_fuck",
                                                                                    "body": "Firstly I’m not American, so technically the USA is not ‘us’. \n\nBut more importantly, within any collective society there are people with different intentions and motivations. I’m not imagining a boogeyman, more I’m trying to acknowledge the possibilities that ai technology opens up, that for the most part we do not understand yet.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-04-15 12:06:53",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Mandoman61",
                                                                                            "body": "Yes, you are imagining the AI that you want to imagine and not any real AI.\n\nHow can I or anyone else compete against your imagined AI? In your imagination AI can do anything.\n\nIn your imagination AI is smarter and faster and is helped  by enough people to enable it.\n\nThis is like imaging God in then asking how we are supposed to resist your imagined God.\n\nYou are right. You can always imagine something more powerful.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2025-04-15 12:28:52",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "odious_as_fuck",
                                                                                                    "body": "So are you essentially saying that, we don’t fully understand the possibilities of ai technology, so we should just not worry about it and then assume that with time it’ll all be ok and the system will fix everything? I do not have that blind faith.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2025-04-15 12:48:39",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Mandoman61",
                                                                                                            "body": "No I would say that our time is better spent on real problems and not wasting time imagining things.\n\nThis idea that AI is hiding under the bed just waiting for us to fall asleep is childish.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2025-04-15 13:36:39",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "odious_as_fuck",
                                                                                                                    "body": "There can be real problems that we don’t fully understand yet, correct? Shouldn’t we try and understand them and their repercussions to the best of our abilities? \n\nSure ignoring it would be easier for us individually. Just have faith the system will sort it out. But in reality someone has to think about these things, someone has to deal with it sooner or later. Personally I don’t operate on the kind of faith you seem to be asking for. \n\nYou keep talking about my imagination and yet it’s your imagination if any that is overactive in this discussion. You are the one imagining up my position like Ai under the bed or that Ai is some kind of god. I have never expressed such things.",
                                                                                                                    "score": 1,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2025-04-15 13:55:10",
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Mandoman61",
                                                                                                                            "body": "yes, I just said we need to focus on real problems. \n\n\nno, only real things need to be dealt with sooner or later.\n\n\nbut that is what you are expressing even if not directly.",
                                                                                                                            "score": 1,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2025-04-15 14:23:48",
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "odious_as_fuck",
                                                                                                                                    "body": "So Ai isn’t a real thing? Or you don’t think Ai is a real problem? \n\nIt’s almost like you refuse to acknowledge anything unless it’s tapping you on the nose. Absurd. \n\nYou seem to be trivialising any potential danger of new technology, like Ai, as simply being afraid of the boogeyman or a monster under the bed. That is incredibly childish and in bad faith. I’m not interested in some irrational moral panic, but I am interested in opening these conversations. \n\nI just wonder why you are so adamant that we shouldn’t even think about potential impacts of ai? What’s your game?",
                                                                                                                                    "score": 1,
                                                                                                                                    "depth": 15,
                                                                                                                                    "timestamp": "2025-04-15 14:34:49",
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Mandoman61",
                                                                                                                                            "body": "Not your imagined AI. Sure there are some mostly minor problems. \n\nNo, I just require problems to be real.\n\nI have no problem thinking about potential problems of real AI.\n\nYou are basically suggesting that we need to plan for an alien invasion.",
                                                                                                                                            "score": 1,
                                                                                                                                            "depth": 16,
                                                                                                                                            "timestamp": "2025-04-15 15:58:06",
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "odious_as_fuck",
                                                                                                                                                    "body": "You clearly do have a problem thinking about the potential problems of ai, in that you literally refuse to and you can’t seem to accept me wanting to. \n\nIf you knew an invasion was coming, would you literally just put your fingers in your ears and shout lalalala? \n\nIt’s so incredibly hard to plan for something so possibly transformative and unknown as Ai technology. But to suggest we can’t even talk about it? I don’t understand you",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "timestamp": "2025-04-15 16:49:26",
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Mandoman61",
                                                                                                                                                            "body": "You are still talking about potential problems of your imaginary AI I don't care what you spend your time doing. I just pointed out that it is a waste of time.\n\nIf I knew an alien invasion was coming then it would not be imaginary.\n\nI'm just saying you should spend your time in better ways than dredding some imagined future.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "timestamp": "2025-04-15 17:32:58",
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "odious_as_fuck",
                                                                                                                                                                    "body": "My friend the alien is here, we made it. It’s not imaginary, it exists. And it’s in its infancy\n\nYou are clearly interested in Ai and you know about the potential of it, and yet you have an unfathomable reluctance to think about what kind of effects it might have. I don’t understand you. \n\nWhy don’t you actually discuss what you think about ai, instead of just dismissing the conversation? \n\nWhat do you actually think about the potential for ai and problems it may create? If I’m so wrong about Ai, can you explain why? What’s imaginary about it?\n\n\nIf you are just going to continue essentially saying that I shouldn’t think about it because it’s not a real problem or it’s all in my head etc without actually explaining yourself, then yes I can definitely find better use of my time.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "timestamp": "2025-04-15 17:59:29",
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Mandoman61",
                                                                                                                                                                            "body": "You are still imagining monsters under your bed. The alien is not here.\n\nI will be happy to discuss real issues but an AI apocalypse is not one. It could be at some point in the future if that sort of AI is actually invented and people do not properly manage it. \n\nI think current AI is not intelligent and is pretty well managed. \n\nWe have not seen any big additional new problems with fake information or images that was not already existing. It is slightly easier to produce. We have several groups working on it which is not a monopoly.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "timestamp": "2025-04-15 19:48:37",
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "odious_as_fuck",
                                                                                                                                                                                    "body": "You’ve created a bit of a caricature of my position saying that I’m worrying about some ai apocalypse when I am not indicating that.\n\nLets make this clear, it’s far more likely that human beings mismanage ai and cause problems than some terminator type ai uprising. \n\nWhat do you mean by intelligent? Do you separate intelligence and consciousness?\n\nThe length of time that ai has been around is minuscule. Saying we haven’t seen any additional new problems yet is just misleading. This technology has literally just been born. Significant impacts will happen over time.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "depth": 21,
                                                                                                                                                                                    "timestamp": "2025-04-16 05:33:51",
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "Mandoman61",
                                                                                                                                                                                            "body": "Intelligence is more than just completing a prompt with statistically probable words.\n\nIt is not a problem now (but what you don't realize is there is a monster hidding under the bed)\n\nNo, this is real! It is really there about to jump out!\n\nAnd once it does it will happen so fast that we will have no time to react (unless we plan in advance)\n\n...and who is to come up with this plan? Government (we can't trust) corporations (we can't trust)\n\nThey don't care about us! They just want money!\n\nOh yeah, we are in serious trouble!\n\n\n...Okay, so was there some solution to this crisis that you wanted to suggest? Or are you just looking for people to sympathise with?",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "depth": 22,
                                                                                                                                                                                            "timestamp": "2025-04-16 07:11:32",
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "odious_as_fuck",
                                                                                                                                                                                                    "body": "I’m confused by what you’re suggesting. As if unless I can personally come up with some plan or solution we should all just stay quiet? Not even worth a discussion? \n\nIt’s not even like you just don’t want to think about it yourself, but you’re adamant I shouldn’t be thinking about it either, as evident by this conversation! I’m expressing rational concerns and interesting talking points, but you’re trying to make it out like I’m having a mental breakdown? Why?\n\nThis makes me think that perhaps you’re trying to convince yourself if anything. Otherwise why would you care so much?",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "depth": 23,
                                                                                                                                                                                                    "timestamp": "2025-04-16 07:54:56",
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "Mandoman61",
                                                                                                                                                                                                            "body": "What I mean is what is your intent here?\n\nYou are being irrational but I would not characterize that as a mental breakdown.\n\nI do not care much but if you keep asking me things I don't mind answering.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "depth": 24,
                                                                                                                                                                                                            "timestamp": "2025-04-16 12:01:17",
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "odious_as_fuck",
                                                                                                                                                                                                                    "body": "My intent is to have a reasonable discussion, which I should have realised a while ago is not going to happen with you haha.  \n\nTime to move on. I have no mal feelings towards you, just confusion at why you would keep responding tbh. Have a great day!",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "depth": 25,
                                                                                                                                                                                                                    "timestamp": "2025-04-16 12:51:55",
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "Mandoman61",
                                                                                                                                                                                                                            "body": "We are having a reasonable discussion. I am just not affirming your fantasies. I'm sure a chat bot will do that for you.\n\nOkay, You too.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "depth": 26,
                                                                                                                                                                                                                            "timestamp": "2025-04-16 15:50:19",
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "odious_as_fuck",
                                                                                                                                                                                                                                    "body": "I don’t use chat bots at all, unless I’m just checking what new they can do. \n\nYou’ve continually tried to push me into this weird box of what you think I am without any actual attempt to engage in anything I say. That’s not a reasonable discussion. I’ve been nice, no need to be so snarky. Kind of enjoyed this weird ‘discussion’ anyway",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "depth": 27,
                                                                                                                                                                                                                                    "timestamp": "2025-04-16 16:37:08",
                                                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "once ai is fully integrated u will see a trillionair",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 07:24:32",
            "replies": []
        },
        {
            "author": "WhyAreYallFascists",
            "body": "Worsen. At this point, I’m a Butlerian or a human in the terminator universe.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 10:18:50",
            "replies": []
        },
        {
            "author": "Positive_Welcome5594",
            "body": "Almost definitely worsen it — AI benefits those who already have data, compute, and capital. Unless there’s strong policy intervention, it’ll just **accelerate the gap**. And yeah, if that happens, **our current economic systems won’t hold** without major reform.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 10:29:28",
            "replies": []
        },
        {
            "author": "GrowFreeFood",
            "body": "Define wealth?\n\nI can have a subscription to a robot that manages my life and does everything for me for $50 a year. I live in 3d printed public housing with gardens and abundant food. Very safe and clean.\n\nBut technically in poverty.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 11:33:47",
            "replies": []
        },
        {
            "author": "herecomethebombs",
            "body": "Yes.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 11:35:48",
            "replies": []
        },
        {
            "author": "Eyelbee",
            "body": "Yes, it will worsen but the question is what happens next. A significant change in economic system is inevitable, but people with power can fight that. That's the real danger here. That's why I hate how openAI is for-profit. If the people who have the power of AI start abusing it everything's gonna turn into shit very quickly and we will all have a very terrible time.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 11:42:44",
            "replies": []
        },
        {
            "author": "peonator11",
            "body": "Hundreds of millions of people WILL become obsolete in the workforce and permanently jobless.\n\nA few hundreds of people will have all the means of production and AI that does the job.\n\n=Worsen",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 14:06:58",
            "replies": []
        },
        {
            "author": "stacey7165",
            "body": "https://preview.redd.it/4wyx13p9duue1.png?width=1462&format=png&auto=webp&s=743dc65af97d362b636a5be3a303d96bb41862fb\n\nI think it may be both? In the short term, it is allowing a lot of innovators to get their ideas out there. There was a chart recently that talks about how much faster AI companies get to revenue that shows there is a lot more opportunity for everyone.  \n\n\nThat said, as it matures it is expensive and AI will be in the hands of those that have billions and those that don't. We will just get the scraps. This is why open source models are so important right now.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 14:14:45",
            "replies": []
        },
        {
            "author": "CovertlyAI",
            "body": "It’s a double-edged sword. AI can absolutely improve healthcare, education, and productivity — but if left unchecked, it could deepen inequality and erode privacy.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 14:22:26",
            "replies": []
        },
        {
            "author": "royalsharkee",
            "body": "I just posted a question about this but am too new for the post to actually go through. But I do think this is going to worsen inequality. One thing I’ve been seeing is the ask by non tech or tech adjacent businesses from employees to assist in development of AI agents to streamline workflows and processes — the workflows and processes that make those employees subject matter experts and valuable to their employer. Essentially, even highly experienced and skilled employees have a process that they’ve often times developed proprietarily. If companies are asking for that process to be implemented into an AI agents used by the company then the company is taking the employee’s secret sauce and monetizing it for their own benefit. I really think this will result in the haves and have nots and its why instead of giving my employer the “secret sauce” to what I do, I’m going to do it myself. If you can’t beat them—join them.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-14 15:23:20",
            "replies": []
        },
        {
            "author": "Frosty_Speech_997",
            "body": "If the people don’t have labor and money then what happens to goods and services these companies produce. If there are no consumers how will the dynamics work.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-15 00:27:19",
            "replies": []
        },
        {
            "author": "mirage1912",
            "body": "TL;DR: It depends on who develops and controls the AI.\n\nMost of today’s AI models are developed by private corporations and state actors. Private companies generally aim to maximize profit, which tends to concentrate wealth and power. Governments may pursue strategic interests, including national security and defense, potentially even weaponizing AI. In both cases, AI development tends to serve centralized power structures, which could worsen wealth inequality.\n\nHowever, I plan to develop my own AGI within the next 6 to 10 years—an AGI aligned with my values and worldviews. Personally, I lean more towards communism than capitalism. I believe in decentralization, cooperation, and a fairer distribution of resources. I’m also confident that there are other visionaries around the world who share this perspective. If we succeed in creating AGI systems guided by these principles, I believe they could become powerful tools for reducing global wealth inequality rather than exacerbating it.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-15 02:28:34",
            "replies": []
        },
        {
            "author": "Oldhamii",
            "body": "Worsen.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-15 10:11:30",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "This is easy worsen it. It will serve the uber wealthy at first....",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-15 13:46:50",
            "replies": []
        },
        {
            "author": "DiscombobulatedBid19",
            "body": "AI is trash. Still can’t do simple things…. Unless you can train it yourself.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-16 15:14:15",
            "replies": []
        },
        {
            "author": "0MasterpieceHuman0",
            "body": "the reailty is, if it didn't worsen the wealth gap, it wouldn't be being developed.  \n\nthe point of AI is to remove the need to pay skilled workers for skilled work.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-16 17:11:59",
            "replies": []
        },
        {
            "author": "AccordingSelf3221",
            "body": "If AI is consolidated in the hands of few (which by definition and real world requirements it must), then it will worsen as it will ultimately always serve their purpose even if you can go along for the ride in this or that aspect.\n\nOnly through political enforcement we can stop this from happening",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-17 04:36:13",
            "replies": []
        },
        {
            "author": "mattintokyo",
            "body": "While it's theoretically possible to create a society where everyone is equal (since the value of human labour will for the most part fall to zero), I don't see how people will give up ownership of AI.\n\nWhoever owns superintelligence owns the whole world. They have the magic lamp and infinite wishes.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-17 09:46:55",
            "replies": []
        },
        {
            "author": "Dziadzios",
            "body": "Worsen. The owners of capital won't have to share their wealth with poor in order to receive labor.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-17 11:31:09",
            "replies": []
        },
        {
            "author": "SluttyLittleSnake",
            "body": "Our capacity to do paid work has always depended on intelligence. The value that 99% of people have had to negotiate with throughout history has been our labor. AI will be able to do the same work or better, faster, at less than minimum wage. Any remaining forms of work that for whatever reason cannot be performed by AI will now be crowded with an influx of refugees from other professions, driving down wages in those sectors.\n\nThere is no way the majority of us will survive if the current system persists while AI takes over more and more work from people. Traditionally new technologies have only affected narrow sectors, and society has been able to adapt through retraining and the emergence of new forms of labor, like advertising. But now, the pressures are coming on all sectors, at a pace too fast for adaptation, retraining, and new labor markets. As new forms of labor emerge, those too will be automated.\n\nEssentially, we are hurtling towards an economy in which we're all desperately trying to survive on OnlyFans or DumDummies or BeastGames, for the amusement of the bubble of the stratospherically wealthy ownership caste.\n\nNothing but our essential biological humanity can't be automated away - our capacities for arousal, empathy, humiliation... these can be approximated by automata, but the audience will likely continue to watch people cum and cry and laugh and suffer.\n\nEither we overthrow the current system and replace it with one in which automation and capital benefit all of life, or this system will decimate humanity like horses turned to glue by factories at the emergence of trains and cars, or like starving people in the Irish potato famine (landlords exported food during that entire famine, becuse foreign markets were paying more than domestic). Only this time there will be no other countries to escape to, as this is global.\n\n![gif](giphy|ToMjGpKZ3q44aEMfIhG)",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-13 19:20:54",
            "replies": [
                {
                    "author": "odious_as_fuck",
                    "body": "Thank you this is a fantastic write up!",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-13 19:44:13",
                    "replies": [
                        {
                            "author": "SluttyLittleSnake",
                            "body": "It's my pleasure!\n\n![gif](giphy|f22No07cF5ODu)",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-04-13 19:56:03",
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}