{
    "post_title": "How did we become so polarized?",
    "post_timestamp": "2025-02-14 13:15:02",
    "last_comment_timestamp": "2025-02-18 22:21:43",
    "time_difference": "4 days, 9:06:41",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nThe amount alarming views that I've been reading from right leaning sites is just staggering. \nFrom claims of stolen election, Biden/Obama being enemies of the state, increasing embrace of Nazism, to more recent views like wanting to delete most of the federal government, being OK handing over the keys to the government to a foreign born person with ties to China, etc. \n\nI feel like we are at a point where each side truly believes the other side is actively and intentionally trying to destroy the country. \n\nThe thing is, this doesnt seem to be just limited to the US. In my parent's native country Korea, they are having a whole bunch of issues of their own. For recap, couple months ago, S Korean president attempted a coup and failed. He was initially universally condemned and arrested. But his party is now convincing his base that hes the victim and to rally their support for him. Unreal. \n\nSo my question is, how did we get here, as a human society? I feel like things werent this divided couple decades back. What do you think was and is the leading cause of so much political division? Is it technology that is enabling miscommunication to spread like wildfire? Is it democracy hating foreign governments that is actively spreading extreme views? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 13:15:02",
            "replies": []
        },
        {
            "author": "SgCloud",
            "body": "I think part of the answer is the decline of traditional media and its gatekeepers. I'm not saying legacy media was perfect, but most newspapers/tv channels had standards that filtered out the most nonsense and allowed the most useful information and atleast moderately well argued opinions into the public sphere.\n\nNowadays you have a much broader variety of options on where to draw your information and political takes from and a lot of people don't have good judgement when it comes from differenciating media content that's objectively good from media content that just caters to your pre-existing inclinations.\n\nThere are so many new media out there that, from my view, deliver low quality information or outright lies and just reinforce your world view without ever really enganging in honest critical self-reflection but that draw a large amount of people who happily deliver their attention and open their purses for the same slop over and over again.\n\nAnother part of the answer might be that we take a lot of liberal democratic achievements for granted and, for lack of better knowledge, don't see the dangers in some phenomena that are portrayed in a deceivingly positive way (\"executing the pure, unfestered will of the people\" for example - I mean who's to argue against democracy?) but run counter to central tenets of liberal democratic governance.\n\nThat and, what I feel as particularly annoying to me, is the trend to posit that \"freedom of speech\" somehow means that any articulation, may it be a truthful evidenced statement, a well argued opinion, a superfial comment, a death treat, a bunch of personal insults, makes the same contribution to the public good of having healthy and lively discussions about matters of political, societal and public moral importance.",
            "score": 21,
            "depth": 0,
            "timestamp": "2025-02-14 13:52:19",
            "replies": [
                {
                    "author": "fox-mcleod",
                    "body": "Every time mass access to a medium opens up, an outbreak of fascism seems to be the result. \n\nWhen radio broadcasts became more accessible and eventually TV allowed demagogues to talk directly to the populace, we ended up with Father Coughlin, Mousollini, Hitler, and dozens of other populist grifters and dictators. \n\nIt took not only WWII, but also a radical change to skeptical culture to stop treating every voice they heard with the same authority. \n\nThe sudden arrival of social media once again created a direct individual -> masses communication pipeline and once again resulted in populism, grift, and fascism. \n\nI think there was a similar effect around mass access to printing. \n\nAs a society, we really are a super-organism and how we communicate matters just as it would if suddenly every neuron in your brain could overwhelm another neuron in your brain.",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2025-02-15 07:42:48",
                    "replies": [
                        {
                            "author": "SgCloud",
                            "body": "As far as I know radio only become a mass-reaching medium during the mid 30s, way after Mussolini took power in Italy. TV only came in after WW2.  \nWhat really made a huge change, in my suspicion, is that developed nations started reaching very high literacy rates at the beginning of the 20th century. That made tradtional methods of spreading your ideas like newspapers, pamphlets and flyers a much more potent tool to spread your ideology.  \nThat even runs a bit counter to current developments where literacy is dropping in favor of audio and video based media.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-15 12:11:52",
                            "replies": [
                                {
                                    "author": "fox-mcleod",
                                    "body": "> As far as I know radio only become a mass-reaching medium during the mid 30s, way after Mussolini took power in Italy. TV only came in after WW2.\n\nThe first TV programs were 1928. The first regular TV broadcasts in a Germany were in 1935 and were largely Nazi propaganda. The 1936 Olympics were in Berlin and featured Hitler at the opening ceremony broadcast around the world. \n\nThe first regular radio programs date back to 1920 and was widely available by 1930. \n\n\n\n> What really made a huge change, in my suspicion, is that developed nations started reaching very high literacy rates at the beginning of the 20th century. That made tradtional methods of spreading your ideas like newspapers, pamphlets and flyers a much more potent tool to spread your ideology.\n\nI’m sure this was relevant to early fascist circles. \n\n\n\n> That even runs a bit counter to current developments where literacy is dropping in favor of audio and video based media.\n\nI mean not really. Both are widely available mass media.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-15 12:27:24",
                                    "replies": [
                                        {
                                            "author": "SgCloud",
                                            "body": ">The first TV programs were 1928. The first regular TV broadcasts in a Germany were in 1935 and were largely Nazi propaganda. The 1936 Olympics were in Berlin and featured Hitler at the opening ceremony broadcast around the world.\n\n>The first regular radio programs date back to 1920 and was widely available by 1930.\n\nI'm totally aware of that. My point isn't that these technologies weren't around earlier, but that it took time for them to reach larger parts of the population comparable to what the Internet is achieving today. And by that time fascism had already become popular and taken hold in Italy and Germany.\n\n>I mean not really. Both are widely available mass media.\n\nSure, but I think it's fair to says that print media are in decline.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-02-15 12:38:00",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "othelloinc",
            "body": ">How did we become so polarized?\n\n1. Right-wing media likes it that way. They make more money if we are polarized.\n2. Right-wing media disregards facts. What would you *expect* to happen when one of two viable political parties disregards reality? Obviously, the other side is going to double-down on reality, and we will be further divided.\n3. Trump. Trump likes sowing division and it has been successful for him. When a Ron DeSantis or a JD Vance tries to succeed in Trump's Republican Party, they emulate Trump's divisive behavior.\n4. Putin (and Dugin). Putin is a follower of \"Russian far-right political philosopher\" [Aleksandr Dugin](https://en.wikipedia.org/wiki/Aleksandr_Dugin) who suggested that democracies are weak, and Russia should take advantage of that weakness by sowing division within those democracies, weakening Russia's rivals. Putin tried it, and it worked.",
            "score": 80,
            "depth": 0,
            "timestamp": "2025-02-14 13:22:25",
            "replies": [
                {
                    "author": "johnnybiggles",
                    "body": "I would add that a strong enabler of points 1-3 is the imbalance of electoral power (EC, House cap, Senate, gerrymandering, mediasphere, etc.).  In the last 40+ years, in spite of there being a national liberal population majority (however thin the margin might be), Republicans have still managed to:  \n\n- get/have control of both houses of Congress more often than Dems, therefore, control over whatever majority rule entitles the party line to (legislation, appointments, funding, narrative control, etc.)  \n\n- get not one, but *two* presidents elected by the Electoral College only  \n\n- seize the judiciary, particularly, the Supreme Court, with a conservative supermajority  \n\n- maintain or gain control of a majority of state legislatures  \n\nAll this has enabled the right wing to dominate the politisphere, or at least put up the appearance of domination, while Dems - who represent more people and a broader range of demographics - have had an uphill battle to get power at all, much less enough of it to reform or significantly impact anything.",
                    "score": 20,
                    "depth": 1,
                    "timestamp": "2025-02-14 15:04:57",
                    "replies": [
                        {
                            "author": "Kellosian",
                            "body": "Also we have the filibuster where the Republicans can basically bring Congress to a screeching halt at any time whenever they feel that Democrats aren't being sufficiently referential",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2025-02-14 20:14:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "othelloinc",
                    "body": "> The thing is, this doesnt seem to be just limited to the US. In my parent's native country Korea, they are having a whole bunch of issues of their own...\n\nThis may have another cause.\n\nFukuyama predicted that all of the energy that drives revolutionary behavior will still exist, but it will lack any legitimate outlet after the end of history, and this will lead to people tearing down systems regardless of their value.",
                    "score": 15,
                    "depth": 1,
                    "timestamp": "2025-02-14 13:29:25",
                    "replies": [
                        {
                            "author": "SgCloud",
                            "body": "This. The relevant question is: What are the necessary societal foundations for liberal democracy and how do we manage to keep them alive? That's a hard question that, from my view, you just don't hear discussed by politicians since it's too abstract, too difficult and not as tangible as issues like taxes, inflation or the economy in general.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-02-14 14:12:25",
                            "replies": []
                        },
                        {
                            "author": "fufa_fafu",
                            "body": "Fukuyama is a hardline liberal moron whose wack job prediction lost all touch of reality.\n\nWhy do you think that \"revolutionary behavior\" exists? The West winning the cold war didn't make life better for the average joe. It's a victory of Western capitalists and political elite, who then proceeded to make sure the working people got shafted with neoliberal policies.\n\nTrump and MAGA just took advantage of this anger. Evil, yes, but not the underlying cause.",
                            "score": -3,
                            "depth": 2,
                            "timestamp": "2025-02-14 14:38:37",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Okratas",
                    "body": "Do you think the left-wing media is free from contributing to the polarization? \n\nI suspect most folks here would agree that the left is the epitome of virtue in this whole political situation, completely innocent, and absolutely blameless. The left is like the last bastion of reason and moral clarity in a sea of chaos stirred up by the right. The left isn’t just trying to heal divisions, they’re a noble resistance to save democracy, equality, and decency itself from the forces of hatred and division that the right-wing has unleashed. The idea that any aspect of the political left is responsible in any way is a farce manufactured by the right to avoid accountability for their own actions. /s",
                    "score": -3,
                    "depth": 1,
                    "timestamp": "2025-02-14 13:45:19",
                    "replies": [
                        {
                            "author": "newman_oldman1",
                            "body": ">Do you think the left-wing media is free from contributing to the polarization as well? \n\nNot at all. But it's not even remotely close to right wing media.\n\n>I suspect most folks here would agree that the left is the epitome of virtue in this whole political situation, completely innocent, and absolutely blameless. The left is like the last bastion of reason and moral clarity in a sea of chaos stirred up by the right. The left isn’t just trying to heal divisions, they’re a noble resistance to save democracy, equality, and decency itself from the forces of hatred and division that the right-wing has unleashed. The idea that any aspect of the political left is responsible in any way is a farce manufactured by the right to avoid accountability for their own actions. /s\n\nWe're all human and nobody is perfect. But if you really want to compare sides, the right is almost completely exclusionary in their rhetoric. \"America First\", immigration fear mongering (i.e the Haitian immigrants eating pets lie), anti-LGBT fear and hate mongering, overt racism (\"is Kamala Harris black or Indian\"), and demonization of the poor/working class are all consistent talking points the right spews and all of those are nakedly tribalist and othering. Maybe you view the left's constant barrage of accusations of the right being racist, bigots, or fascists as being \"just as bad\", but it really isn't. If the right wants the left to stop calling them racists, bigots, and fascists, then the right should take some responsibility and quit spouting bigoted bullshit, quit repeating and defending fascist talking points like \"immigrants are poisoning the blood of the country\", and stop supporting political figures who spew this shit.\n\nThe right really is just complete garbage. No policies of value that will help the working class, just inane culture war bullshit as a distraction to serve the interest of the wealthy.",
                            "score": 29,
                            "depth": 2,
                            "timestamp": "2025-02-14 14:00:19",
                            "replies": [
                                {
                                    "author": "Okratas",
                                    "body": "When you say that the right offers \"no policies of value that will help the working class\", it sounds to me you've made an extremely broad statement that ultimately falls into a trap of extreme polarization, where the flaws of one side are exaggerated, and the flaws of the other are minimized or ignored. There are multiple studies which indicate individuals can be under the influence of a [perception gap](https://perceptiongap.us/). Is it possible that there's diversity on the right?\n\n> [The two groups with the widest Perception Gaps are the Progressive Activists and the Devoted Conservatives](https://perceptiongap.us/media/zaslaroc/perception-gap-report-1-0-3.pdf)",
                                    "score": -7,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 14:27:13",
                                    "replies": [
                                        {
                                            "author": "newman_oldman1",
                                            "body": "When talking about our conservative representation in government, particularly the Republican Party and especially at the federal level, my point largely stands. The conservatives in positions of power (where it really matters) aggressively support policies that benefit the upper class, undermine the functions of government (as we're seeing now under Trump's executive branch and his wealthy donor buddy, Elon, who holds no official position in government), and rile up their voter base with culture war bullshit to distract from everything I said.",
                                            "score": 22,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 14:40:24",
                                            "replies": []
                                        },
                                        {
                                            "author": "decatur8r",
                                            "body": "> \"no policies of value that will help the working class\",\n\nand surprise! You don't show a one.",
                                            "score": 11,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 15:40:46",
                                            "replies": [
                                                {
                                                    "author": "Okratas",
                                                    "body": "Here's [an easy one](https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB82) I'm particularly fond of. This legislation helps disabled veterans more easily access the property tax exemption under existing California laws. The law was written to remove arbitrary barriers to well-deserved benefits for our Veterans and their families.\n\nThere was an issue where some California counties decided not to accept electronically-generated VA letters because they did not always include the dates and disability ratings necessary to verify the taxpayer is eligible for the exemption. This legislation removed a barrier for disabled veterans and I'm glad it was passed.\n\nNext comes the part where the goal posts move and you dismiss, minimize and gaslight your way into how this legislation somehow wasn't authored by a conservative, or didn't help working class people. Bonus points for changing the subject, attacking someone's character, feigning indifference, or bailing on something that clearly helps people.\n\nThen again it is important to remember that everyone loses arguments sometimes. It's better to acknowledge when you're wrong and learn from the experience than to resort to excuses. But while I'm taking a victory lap, let's roll out some others.\n\n* [SB-269 Personal income taxes: Fire Safe Home Tax Credits Act](https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202520260SB269)\n* [SB 353: Income tax: credits: food banks](https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB353)\n* [AB-332 Employment safety: agricultural workers](https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB332)\n* [AB 1938: Special education: inclusion and universal design for learning](https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB1938)",
                                                    "score": -3,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-14 18:09:12",
                                                    "replies": [
                                                        {
                                                            "author": "decatur8r",
                                                            "body": "> \"no policies of value that will help the working class\"\n\nThis about DAV....not working class.\n\nStill waiting.",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-14 18:37:35",
                                                            "replies": [
                                                                {
                                                                    "author": "Okratas",
                                                                    "body": "Here's a fairly [comprehensive list](https://calmatters.digitaldemocracy.org/bills?session_year%5B%5D=2023&site=ca-calmatters&author_party%5B%5D=republican&status%5B%5D=passed) of about 300+ pieces of legislation. **You can filter** the list by category (Economy, Poverty, etc) and go through and read them yourself. But like I said previously, I don't expect you to acknowledge any of good that conservatives are doing for Californians. Nor would I expect you to appreciate the work that has yet to be done to improve the lives of millions of Californians.",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-02-14 19:31:32",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Deleted",
                                                                            "body": "Right, but this is a list of over 300 items with a wide variety of topics, I could sit down and read through each one, but I'm going to need to narrow it down a bit, can you point to any one of those that specifically helps people that are working class? I'm not saying they don't exist, what I'm curious about is if you can point to legislation that specifically helps working class and not a subset of that class, and show that it is a policy of value. His claim is that no such legislation exists, you are disputing that I'm just wanting to see the receipts, unfortunately because his claim is no such policy exists I can't really ask him for receipts unless I want to look through every piece of proposed policy across the US. And for the record, \"of value\" in my mind does include something that isn't undercut by working of the party as a whole so like if a piece of legislation would make it easier for farmers to sell their products to USAID, that no longer is \"of value\".",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-02-14 20:51:15",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "decatur8r",
                                                                            "body": "> that has yet to be done to improve the lives of millions of **Californians**...\n\nyou mean the blue state with the Blue governor you think California is MAGA?",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-02-15 13:16:38",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "decatur8r",
                                                                            "body": "still waiting..I've put no time limits, no amount limits, just laws passed by the right that benefits the working class...YOU GOT NOTHING.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-02-14 19:37:24",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Okratas",
                                                                                    "body": "Let's be honest. You're not participating in good faith. You're not interested in the success conservatives have had. I've listed [specific laws](https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB2423), given lists to hundreds of others. You're not interested in them. You're only interested in hating millions of Americans.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-02-14 19:58:06",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "decatur8r",
                                                                                            "body": "> I've listed specific laws,\n\nname one...you can't.",
                                                                                            "score": 2,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2025-02-14 20:03:40",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Deleted",
                                                                                                    "body": "[removed]",
                                                                                                    "score": 2,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2025-02-14 22:52:31",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "AskALiberal-ModTeam",
                                                                                                            "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2025-02-15 12:13:46",
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "Deleted",
                                                                                                            "body": "[removed]",
                                                                                                            "score": 0,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2025-02-15 08:28:37",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Deleted",
                                                                                                                    "body": "[removed]",
                                                                                                                    "score": 1,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2025-02-15 11:01:25",
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "AskALiberal-ModTeam",
                                                                                                                            "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                                            "score": 1,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2025-02-15 12:13:53",
                                                                                                                            "replies": []
                                                                                                                        },
                                                                                                                        {
                                                                                                                            "author": "Deleted",
                                                                                                                            "body": "[removed]",
                                                                                                                            "score": 0,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2025-02-15 11:30:39",
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Deleted",
                                                                                                                                    "body": "[removed]",
                                                                                                                                    "score": 1,
                                                                                                                                    "depth": 15,
                                                                                                                                    "timestamp": "2025-02-15 11:33:56",
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "decatur8r",
                                                                                                                                            "body": "> avoid addressing it.\n\naddressing what? I'm just calling out a right winger on the fact that MAGA has not done anything to help the working class...ever.\n\nAnd you with your fake liberal tag are a sock puppet of a rightly to afraid or embarrassed to post under their correct tag.\n\nand neither/you can't post anything becasue it doesn't exist.",
                                                                                                                                            "score": 1,
                                                                                                                                            "depth": 16,
                                                                                                                                            "timestamp": "2025-02-15 11:37:23",
                                                                                                                                            "replies": []
                                                                                                                                        },
                                                                                                                                        {
                                                                                                                                            "author": "AskALiberal-ModTeam",
                                                                                                                                            "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                                                            "score": 1,
                                                                                                                                            "depth": 16,
                                                                                                                                            "timestamp": "2025-02-15 12:14:10",
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                },
                                                                                                                                {
                                                                                                                                    "author": "AskALiberal-ModTeam",
                                                                                                                                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                                                    "score": 1,
                                                                                                                                    "depth": 15,
                                                                                                                                    "timestamp": "2025-02-15 12:14:15",
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                },
                                                                                                                {
                                                                                                                    "author": "AskALiberal-ModTeam",
                                                                                                                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                                    "score": 1,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2025-02-15 12:13:57",
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "Okratas",
                                                                                                    "body": "I named 300+. Linked directly to 4. I'm sorry, but I'm done. Get well.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2025-02-14 20:31:36",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "decatur8r",
                                                                                                            "body": "I asked for one law...just one....you can't do it. And a law that shows MAGA supporting the working class...California is not MAGA.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2025-02-15 12:30:44",
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "FreeGrabberNeckties",
                                                                                            "body": "> You're not participating in good faith\n\nCorrect. ",
                                                                                            "score": 2,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2025-02-15 15:10:14",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AntonioS3",
                                            "body": "I know it's about America but to give you an example of why I do not trust conservatives to fix issues as an European person, UK's Tories which is considered rightwing party, has done nothing to help with any much policy, including immigration at all. They run on policy and then don't do them at all. All they do is lie. Could you kindly show me a few policies that ACTUALLY HELPED?\n\nFor example, in UK, people agree immigration needs to be cut down, but what did the Tories do? They actually encouraged it, and Labour (leftwing party) exposed that fact alongside with the failure of their policy, once they were in power last year. They're claming down a lot on immigration, way more than Tories could ever in their 15 years or so. It's already been this long enough that they could've done something, yet they've managed to drive UK economy into the ground. Now, the Labour government is being blamed even though they are trying to make do. Even if we tried to inform people, the new rightwing party, Reform, would still have a rise of popularity. What's the point then?\n\nIt sounds so polarizing to you, but for me in Europe it is the simple truth right now. They at least used to be a serious party who just had a different way on going about things. But now, all they do is try to lie their way through, deflect from everything, create outrage, and so on...",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 17:02:55",
                                            "replies": [
                                                {
                                                    "author": "Okratas",
                                                    "body": "I don't follow European politics, or even national politics as closely as the people in this subreddit. My focus in primarily on my home state of California, my state and local politics. I don't think I'm qualified to speak about what's going on politically overseas or even nationally.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-14 18:14:33",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Poorly-Drawn-Beagle",
                            "body": ">Do you think the left-wing media is free from contributing to the polarization as well?\n\nPretty much, for the simple reason of nobody watching it.\n\nFox News has a pervasive and far-reaching influence on the American people. Any problem you have with mainstream media is with Fox News first and foremost. They're the most mainstream and widely-circulated media there is.\n\nol Rupe Murdoch spent a lot of money to make sure the American people were completely inundated with right wing talking points at every turn. When YouTube and social media became hot spots for media dissemination, right wing pundits eagerly seized on it, to make sure there the propaganda stream never let up. Left-wing media just hasn't been able to compete.",
                            "score": 14,
                            "depth": 2,
                            "timestamp": "2025-02-14 14:06:03",
                            "replies": []
                        },
                        {
                            "author": "othelloinc",
                            "body": "> Do you think the left-wing media is free from contributing to the polarization as well? \n\nOf course not! Left-wing media spends most of their time shitting on Democrats!\n\nThey are trying to *further* divide the divided!\n\n> [[The Young Turks Accuse Biden of Escalating the War in Ukraine]](https://www.laprogressive.com/foreign-policy/young-turks-accuse-biden)\n\n> [[Kasparian of 'Young Turks' explodes at possibility of Harris becoming California governor: 'I'm gonna move!']](https://www.foxnews.com/media/kasparian-young-turks-explodes-possibility-harris-becoming-california-governor-im-gonna-move)\n\n>[[Democratic Pundit Urges 'Revolt' Against Dem Leaders at Conservative Event]](https://www.newsweek.com/cenk-uygur-democrats-maga-turning-point-populist-revolt-2004796)\n\n...but when I reached for an example of left wing media, I found the piddling Young Turks. That is *tiny* compared to Fox News and all if its imitators.",
                            "score": 10,
                            "depth": 2,
                            "timestamp": "2025-02-14 13:56:15",
                            "replies": [
                                {
                                    "author": "justsomeking",
                                    "body": "What are you doing to unite people? I agree the right is more divisive. But you specifically are deflecting here. Liberals are not immune to polarization, and pretending they are is contributing to it.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 17:01:08",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Parking_Champion_740",
                            "body": "I mean there is not that many media outlets that are far left",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-02-14 20:24:45",
                            "replies": []
                        },
                        {
                            "author": "JW8614",
                            "body": "The fact that I couldn’t tell if this was sarcasm, is very telling of this subreddit lol",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-02-15 15:16:41",
                            "replies": []
                        },
                        {
                            "author": "Kellosian",
                            "body": "> Do you think the left-wing media is free from contributing to the polarization? \n\nNo, but if you can find a left-wing media source that is anywhere on par with right-wing media then you likely have a very different definition of left-wing than I do.\n\nAnd to head off the pass here, MSNBC is not the \"Fox News of the left\"; any mainstream corporate media is going to skew incredibly centrist on most issues but more liberal/progressive on social issues (i.e. \"We need more diverse and LGBT multi-billionaires in charge of multi-national corporations\" instead of \"Billionaires Are Destroying America\"). Democratic politicians don't accidentally find themselves in the same dinner parties and social circles as revolutionary Marxists the way that Republicans keep ending up dining next to explicit white nationalists. There has never been a far-left Rush Limbaugh, a far-left Sean Hannity, a far-left Alex Jones.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-02-14 20:20:07",
                            "replies": []
                        },
                        {
                            "author": "rustyshackleford7879",
                            "body": "Just to be clear who are you blaming for the polarization of America?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-14 23:49:47",
                            "replies": []
                        },
                        {
                            "author": "Riokaii",
                            "body": "left wing media does not instruct viewers to disregard factual reality.\n\nLet me know when a left wing nationally broadcast giant is forced to settle for nearly a billion dollars for defamation regarding MONTHS of knowingly untrue lies spread on air.",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2025-02-14 21:32:17",
                            "replies": [
                                {
                                    "author": "FreeGrabberNeckties",
                                    "body": "> Let me know when a left wing nationally broadcast giant is forced to settle for nearly a billion dollars for defamation regarding MONTHS of knowingly untrue lies spread on air.\n\nWhy is defamation the only way that factual reality can be disregarded? Wouldn't disregarding factual reality also be happening when pushing lies which do not materially harm a specific victim?",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 23:15:35",
                                    "replies": [
                                        {
                                            "author": "Riokaii",
                                            "body": "its not the only way, but if a right winger is going to argue that left wing \"lies\" cause no harm, that sounds like a self defeating position to try to claim the left's non-harmful lies are not only the cause of polarization, but WORSE than right wing harmful lies.",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 23:28:22",
                                            "replies": [
                                                {
                                                    "author": "FreeGrabberNeckties",
                                                    "body": ">but if a right winger is going to argue that left wing \"lies\" cause no harm\n\nJust because there isn't a specific person being defamed doesn't mean that there isn't harm happening.\n\nIt doesn't make sense to say that harm which affects more people isn't WORSE than one which affects just one person.",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-14 23:52:49",
                                                    "replies": [
                                                        {
                                                            "author": "Riokaii",
                                                            "body": "sure, i've yet to hear which left wing lies cause generalist vague nonspecific harms to the tune of a billion dollars too. \n\nI certainly dont think it affects more people than one of the most popular nationally broadcast tv stations in the country on a daily basis.",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-15 00:02:16",
                                                            "replies": [
                                                                {
                                                                    "author": "FreeGrabberNeckties",
                                                                    "body": "Yes, by their very nature, a generalized and distributed harm is hard to measure. The reason that the Fox defamation was able to get as far as it did was because the company could put actual dollar signs from contracts on it.",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-02-15 04:09:16",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fufa_fafu",
                    "body": "I wish you liberals can stop blaming every problem in America to the scary boogeyman Putin, Russia, Russia, Dugin, whatever. It's mostly false, it's stale, and it disregards the Democratic Party (the liberal party)'s complicity in making America what it is now.\n\nFor years, Republicans and Democrats worked in tandem to promote neoliberalism, cut jobs from Americans and send it overseas, used cheap immigrant labor as modern slavery in various industries, spied on Americans, let massive tech corporations grow unchecked, and most importantly - feeding the ever growing military industrial complex and destroy other countries willy nilly around the world. BOTH parties are to blame.\n\nAnd now liberals act surprised when Trump and his cabal took advantage of America's discontent to pursue their own power hungry agenda? America is corrupt, racist, and capitalist to the core, and MAGA is bound to happen sooner or later given the trajectory America is in. If not Trump then it will happen with somebody else.",
                    "score": -5,
                    "depth": 1,
                    "timestamp": "2025-02-14 14:35:42",
                    "replies": [
                        {
                            "author": "Sepulchura",
                            "body": "[https://www.cyber.gc.ca/en/news-events/russian-state-sponsored-media-organization-leverages-ai-enhanced-meliorator-software-foreign-malign-influence-activity](https://www.cyber.gc.ca/en/news-events/russian-state-sponsored-media-organization-leverages-ai-enhanced-meliorator-software-foreign-malign-influence-activity)\n\nWe know they're doing it.  There's all sorts of interesting shit to read about Meliorator. It should be a household name.  Google it and do some learning.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2025-02-14 14:40:20",
                            "replies": [
                                {
                                    "author": "watchutalkinbowt",
                                    "body": "Interesting stuff - I wonder why they farmed it out to RT?\n\nI guess a 'media' company adds a layer of deniability",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-02-18 09:46:38",
                                    "replies": []
                                },
                                {
                                    "author": "fufa_fafu",
                                    "body": "Okay? Every country does disinformation campaigns - what do you think USAID is used for?\n\nThe main engine of right wing disinformation isn't bot accounts though, it's people like Elon, Joe Rogan, Adin Ross, Tucker, Fox News and their ilk screaming a firehose of falsehood through a megaphone and the poor useful idiots eating it up. Which again, is a symptom of the inherent problems of America like I said.\n\nRussia didn't create this problem, they merely rode through the wave.",
                                    "score": -2,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 14:43:36",
                                    "replies": [
                                        {
                                            "author": "birminghamsterwheel",
                                            "body": "...but some of those people *literally* got money from Russian companies/oligarchs. It's been a concerted effort for decades. The Cold War never truly ended, it just switched from tanks and nukes to social media and TV.",
                                            "score": 6,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 18:00:58",
                                            "replies": []
                                        },
                                        {
                                            "author": "Sepulchura",
                                            "body": "You \\*REALLY\\* need to learn about that Meliorator thing.  They try to shift public opinion through bot accounts.  They have left-leaning bots that look stupid and lose arguments on purpose.  They bombard comment sections and try to control how people react to content that they don't like.  That's just the tip of the iceberg, dude.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 18:12:03",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "[deleted]",
                    "score": -11,
                    "depth": 1,
                    "timestamp": "2025-02-14 14:21:19",
                    "replies": [
                        {
                            "author": "newman_oldman1",
                            "body": "What did they say that was untrue?",
                            "score": 7,
                            "depth": 2,
                            "timestamp": "2025-02-14 15:30:09",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[deleted]",
                                    "score": -4,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 16:56:49",
                                    "replies": [
                                        {
                                            "author": "newman_oldman1",
                                            "body": "Right wing media is absolutely the biggest cause of the division. They constantly put out stories to demonize immigrants (i.e the Haitian immigrants eating pets lie), the LGBT community (i.e \"trans people are grooming our kids\"), minority groups, and the poor. All the fucking time. They have to, because they have nothing else.",
                                            "score": 9,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 17:01:22",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "[deleted]",
                                                    "score": -7,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-14 17:12:55",
                                                    "replies": [
                                                        {
                                                            "author": "newman_oldman1",
                                                            "body": ">Also no, I repeat no one in the right wing media network demonizes immigrants. Illegal immigrants are a different story.\n\nYou're shitting me, right? I cited the infamous \"Haitian immigrants are eating people's pets\" lie from last year. Right wing media constantly tries to cite specific incidents of crimes committed by immigrants to make it appear like there is high migrant crime when there isn't. As I said, if conservatives couldn't demonize immigrants, minority groups, the LGBT community, or the poor, they'd have nothing to say.",
                                                            "score": 7,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-14 17:50:30",
                                                            "replies": [
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "[deleted]",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-02-14 18:01:09",
                                                                    "replies": [
                                                                        {
                                                                            "author": "newman_oldman1",
                                                                            "body": ">Yeah, and if leftist couldn't demonize christians, conservatives, jews, legal immigrants, and just generally anyone who doesn't agree with them, they'd have nothing to say.\n\nHow do we demonize any of those groups? You made all of that up. Seriously, give me examples.",
                                                                            "score": 7,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-02-14 18:05:57",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "birminghamsterwheel",
                                                            "body": "Then why didn't anyone at FOX News call Trump and Vance out on their bullshit lies about the Haitian immigrants eating pets?\n\nSorry, bud, you're both a liar and, maybe, an idiot.",
                                                            "score": 4,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-14 18:02:21",
                                                            "replies": [
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-02-14 18:08:05",
                                                                    "replies": [
                                                                        {
                                                                            "author": "birminghamsterwheel",
                                                                            "body": "What lies? Cite some examples.",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-02-14 18:10:32",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Deleted",
                                                                                    "body": "[removed]",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-02-14 18:11:46",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "AskALiberal-ModTeam",
                                                                                            "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2025-02-14 19:32:36",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Kellosian",
                                                            "body": "> Also no, I repeat no one in the right wing media network demonizes immigrants.\n\nThat smoke you're smelling is your pants spontaneously combusting.\n\nJD Vance, Vice President of the United States, went on the conservative media circuit and demonized Haitian migrants who are here in this country completely legally. And when someone pointed that out, he outright stated that he doesn't give a shit whether or not they're here legally nor does he care that the story is bullshit.\n\n> If you don't know the difference, again you're an idiot, sorry.\n\nJD Vance, Vice President of the United States, is an idiot who either doesn't know or a malicious bastard who doesn't care. So is JD Vance, Vice President of the United States, stupid or evil?",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-14 20:23:48",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "grammanarchy",
            "body": "It’s complicated!  You mention some important drivers of this phenomenon: the fracturing of the media ecosystem and foreign interference.\n\nAlongside tech-driven changes in media consumption, there has been a conscious effort to produce and promote partisan media.  Both sides have done this, but the right has been much more successful.  Right wing media, from radio in the 80s to podcasts today, has created a robust fantasyland that is now populated by most of the Republican base.\n\nOne thing I would add to your list is gerrymandering.  It isn’t designed to increase partisanship, per se, but it creates safe partisan seats that tend to drive politicians on either side to pander to extremists instead of moderates.",
            "score": 18,
            "depth": 0,
            "timestamp": "2025-02-14 13:25:41",
            "replies": [
                {
                    "author": "LukeChickenwalker",
                    "body": "Where are all the extremist Democrats stemming from gerrymandering? Seems to me the Democrats are overwhelmingly a moderate party.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-02-14 16:10:16",
                    "replies": [
                        {
                            "author": "grammanarchy",
                            "body": "We are a more moderate party for sure, but you can definitely find Democratic products of gerrymandering.  I wouldn’t say that somebody like Marcia Fudge is nearly as objectionable as someone like Jim Jordan, but she is definitely to the left of the median voter in Ohio, and both Fudge and Jordan were the product of safe partisan seats created by gerrymandering in Ohio — at one point her district, the 11th, consisted of the downtown areas of Cleveland and Akron connected by a thin strip of land, and she won it with 80% of the vote.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2025-02-14 16:34:05",
                            "replies": [
                                {
                                    "author": "LukeChickenwalker",
                                    "body": "I see. Thanks.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 16:39:31",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "FreshProblem",
            "body": "Media landscape / social media. Any other factor is negligible.",
            "score": 8,
            "depth": 0,
            "timestamp": "2025-02-14 13:38:27",
            "replies": []
        },
        {
            "author": "MarionberryUnfair561",
            "body": "The answer is it was explicitly designed by Republicans and [Newt Gingrich in particular](https://www.npr.org/2018/11/01/662906525/combative-tribal-angry-newt-gingrich-set-the-stage-for-trump-journalist-says). It's been amplified by decades of right wing media across all formats. \n\n> This just isn't a story of ideology, it's also a story of kind of attitude and style and tactics. Most of the congressmen that Gingrich helped elect or kind of gave power to were more conservative, but they were also — for lack of a better word — meaner and more aggressive and more combative and more confrontational. ...\n\n> Gingrich had this organization called GOPAC that he used to provide training to Republican candidates who wanted to emulate Newt Gingrich. He would send out cassette tapes and memos to these candidates providing them with kind of attack lines and and talking points and frankly created a whole new vocabulary for this rising generation of conservatives.\n\n> There was one memo I write about in the piece called \"Language: A Key Mechanism of Control,\" that literally included a list of recommended words that Republicans should use in describing Democrats. And they included words like \"sick,\" \"pathetic,\" \"lie,\" \"anti-flag,\" \"traitors,\" or \"radical\" and \"corrupt.\" ...\n\n> The kind of broader strategy when waging these national campaigns was to reframe the kind of policy debates in Washington that may have seemed kind of dull or inaccessible to the average American and turned them into these big struggles between good and evil, or white hats versus black hats, and a battle for the character and soul of America.",
            "score": 8,
            "depth": 0,
            "timestamp": "2025-02-14 15:59:22",
            "replies": []
        },
        {
            "author": "Ok-One-3240",
            "body": "Cable news and talk radio. \n\nRepublicanism invaded that space far before the mainstream, and replaced conservatism.\n\nDems kinda tried the same thing, but like most evil shit, did far worse at it than republicans. We’re not good at the productive forms of corruption.",
            "score": 8,
            "depth": 0,
            "timestamp": "2025-02-14 13:31:36",
            "replies": []
        },
        {
            "author": "UR_NEIGHBOR_STACY",
            "body": "1. If we're busy fighting a culture war, we don't have time to fight a class war.\n\n2. A house divided cannot stand. The more polarized we are, the weaker we are. This makes our enemies happy.\n\nBoth 1 and 2 are accomplished with propaganda.",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-02-14 13:36:16",
            "replies": [
                {
                    "author": "hope-luminescence",
                    "body": "Why would we want to fight a class war in the first place?",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2025-02-14 17:13:46",
                    "replies": [
                        {
                            "author": "UR_NEIGHBOR_STACY",
                            "body": "To force the corrupt elite to treat their workers fairly and pay their *fair* share of taxes. Corporations spend millions of dollars on anti-union propaganda. They lobby aggressively to limit worker's rights, and to keep their own taxes proportionally lower than they should be. Their exploitation of workers has effectively killed the \"American Dream\" for millions.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-02-14 18:09:56",
                            "replies": [
                                {
                                    "author": "hope-luminescence",
                                    "body": "What would \"class peace\" look like to you?",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 19:04:59",
                                    "replies": [
                                        {
                                            "author": "IzAnOrk",
                                            "body": "Complete, utter and permanent victory of the working class.\n\n\\-> Abolition of the bourgeois state, completely dismantling any institutions that protect the elite's property.\n\n\\-> Abolition of the bourgeoisie as a class by seizing their capital, erasing their economic power over anyone else.\n\n\\-> Collective ownership and democratic control of the means of production.\n\nThe only way to have class peace is to have a classless society. Some eggs will need cracking to cook that omelette but this particular end justifies any and all means.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-02-15 10:28:01",
                                            "replies": [
                                                {
                                                    "author": "hope-luminescence",
                                                    "body": "So the only peace to you is elimination of any counterparty?\n\nEdited to add: \"any and all means\" -- All means all. That implies you're including genocide, killing a majority of the human race, use of rape as a weapon, thermonuclear war, etc, right?",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-15 10:47:21",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "D-Rich-88",
                                                    "body": "You are wayyy out on that limb.\n\nWe are not and will not be a communist country",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-15 11:10:36",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "postwarmutant",
                            "body": "It’s already being waged against you, whether you like it or not.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-02-14 18:31:24",
                            "replies": []
                        },
                        {
                            "author": "highliner108",
                            "body": "Mostly as a method of cutting out middle men.\n\n As it turns out, removing the top of any given institution and replacing it with elected officials has worked out pretty well for Liberal democracies, and the next layer of fat is primarily made up of small minority of rent seekers, one that the United States alone has harvested quite a bit of material from, especially following the Great Depression. \n\nOf course, this sucks for some people, but monarchs, dictators, and the managers of command economies don’t make up that much of the population. “We” is more of a generalization that assumes the reader is one of the countless individuals who don’t make a living by controlling an economic fiefdom at the expense of their own underlings. \n\nAt the end of the day, one of these broad groups has to come out on top, and any balance between them is shaky at best, for the simple reason every dollar given to stock holders is a dollar that could have been given to the firm’s employees, keep prices consistent, and grow the firm as a whole.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-16 15:28:10",
                            "replies": [
                                {
                                    "author": "hope-luminescence",
                                    "body": "I look upon this with skepticism to say the least. In many cases, the elected officials are the *cause* of current problems; in others they are only able to fulfill some of the roles of the people they replaced. \n\nMany of the rent seekers were also load-bearing. \n\nIt is no accident that this cutting-out has gone along with the growth of a vast though comparatively less wealthy managerial class that is spectacularly lacking in independence and therefore in moral courage.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-18 01:55:46",
                                    "replies": [
                                        {
                                            "author": "highliner108",
                                            "body": "Then why haven’t states which make an effort to preserve personalist decision marking done better over the past few centuries? \n\nThe last few hundred years have consisted of a series of conflicts in which states with nationally selected governments have soundly and almost comically crushed states with more personalized political systems. States like the USSR created a managerial class with far more independence from the general population and influence over the state than their western counterparts, and yet somehow Stalin isn’t remembered as a paragon of moral courage.\n\nEdit: This also might be a matter of different religious backgrounds. Like, if you’re a Muslim or whatever I kind of get it. Liberal Democracy and its fledgling children certainly aren’t constructed in a way to allow for Mohameds to exist. From the perspective of a society whose dominant religion views humans as universally evil, the concept of an independent ruling class essentially translates to “a ruling class made up of evil people who have the freedom to be as evil as they want to.”",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-02-18 22:21:43",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vandesco",
            "body": "The Powell memo",
            "score": 7,
            "depth": 0,
            "timestamp": "2025-02-14 13:22:56",
            "replies": []
        },
        {
            "author": "hammertime84",
            "body": "It's many things that have come together. Some key ones are\n\nSome groups exist specifically to spread misinformation. Check out Merchants of Doubt for a fairly early modern one.\n\nThe right evolved a general approach of \"feelings over facts\" and have refined that. The southern strategy had elements of this. Reagan's welfare queens talk had elements of this. Gingrich was when it was first really refined though IMO and it has been extremely effective since him. He was very open about things like \"I don't care about crime stats. Do I *feel* safer?\"\n\nSocial media and AI have made micro-targeting, creation of bubbles, and ability to push propaganda better than ever before\n\nPutin is extremely effective at capitalizing on this\n\nWealth inequality allows people to just buy control of what's real for many (e.g., Musk and Twitter)\n\nInternet makes information dissemination extremely cheap",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-02-14 13:33:40",
            "replies": []
        },
        {
            "author": "cossiander",
            "body": "Fractured media/siloization, opportunistic badfaith actors, general degradation in critical thinking/education.\n\nThere's no set agreed upon facts anymore. It's people just listening to others who reinforce their point of view.",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-02-14 13:24:30",
            "replies": []
        },
        {
            "author": "justanotherguyhere16",
            "body": "Because gerrymandering rewards extreme positions \n\n\nhttps://carolinaforward.org/blog/how-gerrymandering-drives-extremism/\n\nhttps://www.brookings.edu/articles/a-primer-on-gerrymandering-and-political-polarization/",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-02-14 16:17:58",
            "replies": []
        },
        {
            "author": "Apprehensive-Fruit-1",
            "body": "When did Fox News start and when was Newt Gingrich a party leader?",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-02-14 13:45:27",
            "replies": []
        },
        {
            "author": "AvengingBlowfish",
            "body": "It started with Newt Gingrich and was magnified (MAGAfied?) by social media.",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-02-14 14:07:26",
            "replies": []
        },
        {
            "author": "tonydiethelm",
            "body": "https://en.wikipedia.org/wiki/Southern_strategy\n\n60 years of THAT.\n\nAlso, our First Past The Post (FPTP) system rewards people being extreme in primary elections... and gerrymandered districts mean they don't have to move to center for the general elections.",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-02-14 14:16:16",
            "replies": []
        },
        {
            "author": "Hodgkisl",
            "body": "My view is multiple developments:\n\nCongress delegating more and more of their authority to the executive branch through regulatory agencies, reducing the need to work together to solve problems as the appointed bureaucrats would do the heavy lifting.\n\n24 hour news, which to work requires filling time with partisan pundits and negative news that doesn't really belong at the national level.\n\nThe development of the internet that allows amazing access to information both real and false.\n\nThe development of social media which allows us to fall into social silos of people who agree with us.\n\nAnd last Covid-19, which took away many peoples small real world social life and left them with only their hyper filtered online silos. \n\nIn and of it's self I do not believe many of these things would have worked out this poorly if it wasn't for how rapidly they developed, a generation grew up with only nightly news and news papers, and by their senior years had 24 hour news and social media, the change was too rapid to develop the required media literacy without thinking about it, and many didn't realize they were not literate enough.",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-02-14 13:36:50",
            "replies": [
                {
                    "author": "SgCloud",
                    "body": "I'm not sure regulatory agencies are the problem since those also have been existing in other countries for a long time. And I think it might be the other way around with congress and the executive branch, in that a divided and dysfunctional legislastive heightens the demand for a strong executive that cuts through the lengthy, tiring and unproductive processes of lawmaking in favor of enabling change through edicts, executive orders, etc.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-02-14 13:59:06",
                    "replies": [
                        {
                            "author": "Hodgkisl",
                            "body": "I do not think it is solely the regulatory agencies, or any of the above listed things, but the combination of all of them.  \n\nThe executive branch has slowly gained power as the laws that empower these agencies become more and more vague, and courts ruled for years they should default to the agencies interpretation of those laws and not their own.  This additional power made it easier for politicians to follow the people into greater partisanship, as they could rely on the president to accomplish more and more of their goals.  The legislative branches more and more get elected by the letter next to their name, not their own accomplishments, it's a team sport and all look to what the president and what letter is next to their name to choose their team",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-02-14 14:35:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Love_Guenhwyvar",
                    "body": ">the change was too rapid to develop the required media literacy without thinking about it, and many didn't realize they were not literate enough.\n\nI would like to add that many Americans also lack political literacy as well. How many Americans know the name and party alignment of the current president? Do they actually know exactly what the president's role is supposed to be or how much power they do/don't have? Now, how many of those same Americans know who their local government officials are... representative, senator, governor, mayor, etc? Do they even know what each of those people are responsible for or what all they have voted for/against while in office? The final question is how many people actually recognize that they might be politically illiterate? \n\nExpecting politically illiterate people to make good choices about who should run our government is like expecting someone who knows nothing about basketball to coach a team of players selected by people who know nothing about what a basketball player is supposed to be able to do. Education is the answer to the lack of literacy, but where do we draw the line between education and indoctrination?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-02-16 19:23:37",
                    "replies": []
                }
            ]
        },
        {
            "author": "thebigmanhastherock",
            "body": "1994. Republicans won the House it was generally attributed to Newt Gingrich using C-Span to promote Rush Limbaugh talking points. It should be noted that the political calculus for Republicans before this was that the Democrats had a permanent house majority. Once Republicans won the House all three of the House, Senate and Presidency was up for grabs. \n\nBecause Gingrich did this by going to the right, there was this recognition that controlling media and the narrative and going partisan could lead to big gains. So political talking points became less about reaching across the isle and doing what was right for your constituents and moved towards winning for your particular partisan side so you could pass legislation in Congress and the house could pass it. \n\nInterestingly some of the biggest legislative wins for Republicans came in the 1990s under Clinton, but Clinton got a lot of the credit. Not wanting to share credit with the opposition party around the Obama era the Republican Senate decided to stonewall any legislation from passing under a Democratic President good or bad. This was because the goal was not to pass bipartisan legislation any more it was to get the Presidency, Senate and House and pass entirely partisan legislation.\n\nThe nation as a whole largely has molded into this same attitude towards politics. It's a Zero-Sum game the population sees it that way now because that's how it's seen in DC.",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-02-14 13:42:43",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Technology. \"smart\" cell phones. And the internet. Everything changed when these three things came into being. We could've done without smart phones and the internet because those two things alone have created legions of lazy people who rely on \"input\" instead of thinking for themselves.\n\nJust like the Russian people have been hoodwinked by putin's disinformation campaigns, so have MAGAs.",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-02-14 13:54:46",
            "replies": []
        },
        {
            "author": "SidarCombo",
            "body": "There's a long answer but distilled down to a single sentence; A black man was elected President and white people lost their shit.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-14 13:48:31",
            "replies": []
        },
        {
            "author": "gophergun",
            "body": "First-past-the-post electoral systems trend towards polarization. FairVote has a pretty well-sourced [article](https://www.fairvote.ca/04/09/2022/extremists-polarization-and-first-past-the-post/) that explains how, but the short answer is that moderates end up siding with one of two extremes. \n\nAnother good piece by the Guardian on the same subject: https://www.theguardian.com/politics/2019/apr/23/first-past-the-post-abets-extreme-politics-says-thinktank",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-14 14:42:04",
            "replies": []
        },
        {
            "author": "rhtufts",
            "body": "imho its a feedback loop of capitalism and confirmation bias. How do you make money in the information age? You tell people what they want to hear. What do people want to hear? Anything and everything that confirms their subconscious and not so subconscious biases and fears. The more you feed their biases the worse those biases and prejudices and fears become. \n\nThis happens on both sides (we're all human) but seems to be 10x worse on the right. \n\n.02",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 14:49:32",
            "replies": []
        },
        {
            "author": "Mediocritologist",
            "body": "Plain and simple, foreign enemies using disinformation tactics on an uninformed, unprepared, and under-educated public. \n\nThere’s other stuff too of course, Citizens United, 24 hr “news” cycles, etc but to me that is so undeniably a huge component of it. We are so closely aligned on so many things but money has found a way to divide us along political lines, when we should be unified along class lines.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 14:56:13",
            "replies": [
                {
                    "author": "eamonneamonn666",
                    "body": "You created a bit of propaganda there yourself. You said, \"... Money has found a way to Divide us along political lines when we should be unified along class lines.\" Intraparty unity seems stronger than ever, would be another way to say it and we should be divided along class lines. We're all spinning for our points. I, in general agree with what you're saying, I just wanted to point out your spin. Class lines are difficult to define in the US bc there is such a degree of upward mobility here. The biggest unifier to me is getting both the lower working class (the proletariat, if you will) and the upper middle class to realize that they are really both on the same side. That 250k/year isn't \"rich,\" though it may seem like it at first glance to someone like me who makes 30k a year. Tbh though, I don't see it happening. Grow your circle, help each other, help those in need, hopefully go explore some of this world before it burns down. Sorry feeling a little nihilistic today.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-14 16:04:50",
                    "replies": []
                }
            ]
        },
        {
            "author": "BAC2Think",
            "body": "I'm going to say this isn't nearly as new a thing as many of us tend to think of it as. \n\nThere were members of Congress decades ago that were supportive of Hitler. Charles Lindbergh was as well. There was an entire scandal based around Nazi designed propaganda being mailed out through a special permission process designed for members of Congress. (Yeah, they didn't mention that in my high school history class either)\n\nWhat's changed as much as anything is the level of information access we have. We know things far faster than we used to. \n\nThere are things like having separate news/media sources that we didn't used to have, and many of those sources being less concerned with reality, but that's not exactly new either (see also Father Coughlin).",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 15:29:20",
            "replies": []
        },
        {
            "author": "kyloren1217",
            "body": "i think both sides care more about winning than working together\n\nso i feel ppl are moreso looking for ammunition and one liners these days, than having an open mind or an actual discussion or thru learning things themselves.\n\nyes, i see it on here too. examples i see on here are threads with titles that include \"how should i respond to this argument\" \"what should i say to my trump supporting cousin about this\" \n\nthese ppl are unable to figure it out themselves so they rely on others to simply repeat rhetoric yet have no idea what it means themselves.\n\nppl just want to win and not use their brains for critical thinking anymore",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 15:47:07",
            "replies": []
        },
        {
            "author": "wonkalicious808",
            "body": "Republicans had been complaining that their electeds are RINOs who are failing to win everything for Republicans forever because they keep compromising with  Democrats instead of spending all day crying like babies until they get everything they want passed without Democrats getting anything. That's how.\n\nFox News, OANN, and all the other right-wing media has just been exploiting that. They don't tell Republicans what to think. They tell Republicans what they've always been thinking.\n\nOh, and let's not forget the effects of believing that everything you want is just what an all-powerful deity is telling you to want.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 16:36:33",
            "replies": []
        },
        {
            "author": "-Random_Lurker-",
            "body": "Read \"The Authoritarians\" by Bob Altemeyer. In it, he lays out the research showing that people become authoritarian when they live in fear. Now, each individual person has a different threshold, but it's a fundamental instinct everyone has. More fear, more often, equals more authoritarian.\n\nNow add social media and the \"engagement\" algorithms. Nothing is more engaging than rage and fear. People for the past decade have been in a constant low level fear state from this saturation of content.\n\nThe rest of the story tells itself.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 17:09:39",
            "replies": []
        },
        {
            "author": "conn_r2112",
            "body": "social media, more or less\n\nits insanely easy now to get stuck into extremist communities \n\nin the past, if you wanted to see what was up with the latest white supremacist conspiracies, it was almost impossible to find that information, let alone those communities... you had to go WAY out of your way to get inculcated into that community.  Now you just have to open twitter",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 17:16:24",
            "replies": []
        },
        {
            "author": "Wild_Pangolin_4772",
            "body": "Social media. People no longer have to live on official mainstream news feeds alone, and more extremist elements have a say.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 17:59:21",
            "replies": []
        },
        {
            "author": "bundymania",
            "body": "Talk Radio and Fox News... All because of the removal of the Fairness Doctorine",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 18:09:56",
            "replies": []
        },
        {
            "author": "dontcommentonmyname",
            "body": "Having a president that says, we will own gaza",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 22:27:49",
            "replies": []
        },
        {
            "author": "rogun64",
            "body": "So I skimmed through the answers and I don't disagree with them. However, those I read seem to be ignoring the facet dealing with economics and that's a huge part of it. Lots of people in the West have good reason to be angry, but they don't know who to blame. That's largely the fault of right-wing media blaming the wrong people.\n\nPeople aren't just angry with immigrants and minorities because they're hateful. They truly believe that they have good reasons for it, despite that they're wrong. If these people were doing well economically, they wouldn't be looking for people to blame today.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 23:04:21",
            "replies": []
        },
        {
            "author": "BossKrisz",
            "body": "We as a species were not ready for the internet and  social media. I mean we seemingly adopted it overnight and it became the central part of our lives in just 10 years. We couldn't really have time to get ready for it, to establish rules. Everyone being able to spread information to millions of people is not something we ever needed to deal with as a species and we were not mature enough to use this tool responsively. So what we got is a never seen before wave of misinformation, algorithms locking people into echo chambers, money hungry corporations doing what they always did and making it worse for profits. \n\nBefore the internet we had traditional media. And traditional media can be regulated, it can be taken accountable for not following the guidelines. You know who the writer and the publisher is. There's a certain level of professionalism. You can face legal consequences if you abuse the platform, and you can be shut out from the professional world of journalism and not given a public platform again. The internet is a huge anarchy of nameless-faceless people. And we don't know how to regulate it and whether or not we should. \n\nOld folks in the court all over the world don't recognize stuff like YouTube and Podcasting as serious media like TV and Radio, despite it reaching significantly more people and influencing people's opinions. A good social media campaign can literally change elections. So we have all this insanely popular and powerful media without a single ounce of regulation or law. YouTubers can't be held accountable for misinformation the same as a TV program could be. Or just look at all the AI shit Trump was posting. You could hardly get away with that in traditional media. And all this had a catastrophical consequence on our world. And it will continue to be so as long as we don't do something.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-15 05:34:49",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Lack of communication\n\nEmotions and pride",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-15 11:48:47",
            "replies": []
        },
        {
            "author": "highliner108",
            "body": "In the past, media was far more personalized. Not necessarily in the sense of its consumers, but in the sense of the people producing it. The expansion of the entertainment market and its exponentially expanded organization has made it easier for people to get more of an idea of what the other side thinks. Little, if any, of this is new, it’s just that in the past it was harder for people to just see the right wing media ecosystem. In the past, people would get introduced to this type of thing on a localized political level. \n\nIf you go to church at a more explicitly progressive church you’re less likely to interact with a more politically neutral church, and that in turn creates a barrier between you and the local MAGA equivalent. Once you’ve established ties to a church whose membership parlay believe that Janet Reno is an agent of the devil, you’re more likely to go down the older version of the far right rabbit hole, and before you know it you’re Timothy McVeigh. \n\nThe main difference now is that the growth of social networks has led larger segments of the population to become more socially liberal more quickly, while also making super right wing people more visible. They like being right wing, and as it turns out the United States population is closer to center left, and super right wing people can’t pretend otherwise anymore. \n\nThe culture war has always been a thing, it’s just that in the past its losers felt that they were winning, or at least holding ground. They were mostly wrong, they’ve been getting weaker for most of American history, but it’s happening more quickly and more obviously, and it’s a lot harder for right wingers to take refuge in more isolated communities without being perpetually aware that their ideological relevance has an expectation date, and their only hope is essentially to establish minoritarian mechanisms that leave them able to impose their ideological goals on the rest of society. \n\nThe last couple decades have been a drawn out version of the 1850s, and American conservatives have always been prone to lashing out against political actors who seem like they might eventually do things like end slavery. \n\nUnless you want to leave society as a weird hybrid of post 70s economic policy and social viewpoints that vary from 80sish at best, and 1800ish at worst, all of this is pretty much inevitable. At this point it’s just a matter of ensuring that fort sumpter is able to respond.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-16 05:31:04",
            "replies": []
        },
        {
            "author": "Silent-Ad5576",
            "body": "Check out Two Party Doom Loop by Lee Drutman.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-16 18:01:41",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "[removed]",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-16 19:59:18",
            "replies": []
        },
        {
            "author": "Greymorn",
            "body": "Important thing to understand: it's not paranoia if they really are out to get you. I'm not joking. There is a lot of false equivalency and both-sides-ism online, so let me be crystal clear:\n\n(a) There is a segment of religious conservative extremists who have been trying to take over the US for decades. Newt Gingrich and Pat Robertson were early examples of this, and they have only become more extreme over time.\n\n(b) Since at least the dawn of agriculture, there have been people trying to get obscenely rich and wield power over others. These people are immoral or amoral and will do basically anything to consolidate and hold power. Trump, Musk and Putin are prime examples of this.\n\n(c) The US was always and remains disturbingly sympathetic to Nazis. Neo-Nazis have and still do thrive in the US, taking advantage of free speech to promote their hate.\n\n(d) The US has been and remains a haven for racists and White Nationalists. This overlaps a lot with groups (a) and (c) but deserves special mention. They are similar but not identical.\n\n(e) Realize the US Constitution is old, it was never perfect and our form of government is subject to exploitation and corruption. This corruption had several watershed moments, but Citizens United in 2010 was a big one.\n\n(f) Foreign influence is a real thing. Putin in particular seems to be shaping opinions in other countries to serve his own needs via flooding social media with actual fake news, and China is likely doing the same. You don't need to utterly convince everyone of anything, you just need to plant the seeds of doubt about bedrock institutions like: the Mainstream Media, Congress, the Courts, free and fair elections, science, and so on.\n\n\\---------------------\n\nWhat you have today in the MAGA movement is the 1980's alliance between (a) and (b) in the GOP leveraging the corruption (e) to gain and hold more and more power. The secret sauce that pushed us over the edge was Trump abandoning even the illusion of decency and openly embracing -- without any consequences -- Nazis (c) and White Nationalists (d), which in turn forced Evangelicals (a) to utterly sell out their professed morality and embrace (c) and (d) too.\n\nThis created a political power block in the GOP which forced all conservatives to align with (c) and (d) whether they liked it or not. \"Either tow the party line or we will primary you out of office\" has been their entire strategy.\n\nThis trend has been aided by (f) all around the world.\n\nThe Democratic Party in the US is certainly corrupt. They are maddeningly inefficient and quarrelsome. But they are not part of anything I described above. At most you can say the Dems cater to the wealthy (b) while publicly denouncing them because they must if they want to get elected.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-17 08:32:34",
            "replies": []
        },
        {
            "author": "chinmakes5",
            "body": "Have you listened to conservative media in the last few years.  It is pretty much that government, Biden Democrats are actively trying to harm you. It is way past that Republicans have a better idea.  Republicans are fighting evil. They are doing what they do specifically to harm you.  If you believe that why wouldn't you fight against that.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 13:53:41",
            "replies": []
        },
        {
            "author": "alienacean",
            "body": "Oh you disagree with me about something? BLOCK, UNFRIEND",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 15:37:11",
            "replies": []
        },
        {
            "author": "RusevReigns",
            "body": "I think a key factor is people are bored and radicalism is spicier.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 15:40:38",
            "replies": []
        },
        {
            "author": "ManBearScientist",
            "body": "Imagine a chimp in a science experience.  \n\nA button is in the middle of the cage.  \n\nIf the chimp presses it, occasionally fruit rolls out.\n\nThat's partisanship to the GOP. A button that rewards them when they press it.  \n\nTake the Senate.  There are roughly 30 red states and 20 blue. If states *only* voted based on partisanship, the GOP would have a permanent supermajority.  But they don't vote that way, or at least they didn't.  Democrats won in red states regularly, and Republicans won in blue states. \n\nThat's 'non-polarized'.  The more polarized it gets, the more the Republicans win in the Senate. The more Supreme Court justices they get to confirm.  The less likely they are to see the Democrats win a supermajority and pass legislation.\n\nA similar thing has happened in the media. In non-polarized times, people chose news networks based on what other programming they had, or just out of habit.  In polarized times, they stick to the media that reflects back their biases, and consume more of it.  But that isn't equal; it seems to be more true of rightwing people than leftwing.  \n\nSo pressing the button, makes Fox News, Sinclair broadcasting, talk radio, etc. take a larger bite out of their respective markets.  \n\nThe only this positive feedback loop could have been stopped is if there was a chance for punishment along with the chance for reward. If networks could get censored, or if members of Congress feared they would be punished if their polarized actions crossed the line to illegal (e.g. Jan 6).  \n\nBut there was no chance for punishment. There never is.  Not for Republicans.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-14 21:43:31",
            "replies": []
        },
        {
            "author": "Kerplonk",
            "body": "Fox news and talk radio is a huge part of it.\n\nA lot of it is probably that we've moved far enough away from WWII that the lessons we learned from the conflict are being forgotten and with the Cold War over we don't have a common enemy to rally against.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-02-15 03:05:44",
            "replies": []
        },
        {
            "author": "Imaginary_Ad_9058",
            "body": "1. Leftists dismiss every concern the right has and calls them fascists.\n2. Right wingers dismiss every concern the left has and calls everyone a snowflake\n3. Media cherry picks information to build narratives that do not touch the truth\n4. Since everyone is getting dismissed they stopped trying to understand as well\n5. All the above formed a big gap between the perception of right and left wingers\n6. Hostility ramped up as everyone is confused and blames the other\n\nPropaganda rules",
            "score": -1,
            "depth": 0,
            "timestamp": "2025-02-14 13:43:22",
            "replies": [
                {
                    "author": "Ivan_Botsky_Trollov",
                    "body": "the only valid answer",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-02-15 11:54:31",
                    "replies": []
                }
            ]
        },
        {
            "author": "TonyWrocks",
            "body": "A black man was elected to the presidency in one of the most racist countries in the world.",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-02-14 14:46:50",
            "replies": []
        },
        {
            "author": "Calfzilla2000",
            "body": "The 2 party system and how our voting system and government reinforce it makes it almost inevitable in today's media landscape; as long as there are billionaires and people rich enough to fund media ecosystems that divide people and demonize people.",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-02-14 13:41:40",
            "replies": []
        },
        {
            "author": "eithernickle",
            "body": "The neo-political, which is our nation's 6th era focused on social issues as their primary mechanism to distract, divide, conquer & rule in order to hide their 'gridlock grifting'. \n\nAny highly social focused model results in hyper-polarization at the end of the model's lifespan. \n\nThe choice is to flame out (civil war, national divorce) or realignment into a fiscal focus.  Fiscal focused issues has expansive amounts of middle ground.\n\nMaga is far more focused on fiscal than what most liberals or leftist realize because the legacy media which acts as their primary source of news/narrative makes its largest ad-revenue hauls using social outrage-clickbait",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-02-14 13:45:43",
            "replies": []
        },
        {
            "author": "cubbie_blues",
            "body": "The internet.\n\nThere’s always been a certain bit of tribalism in the world. Prior to the internet, when people experienced a tribalistic thought (we all have them at times), it was harder to obtain information that reaffirmed your biases and you didn’t have near immediate access to communities of other people who share that bias. Chances were much higher that if you verbally shared a biased perspective with another person, they’d probably tell you they disagree, and you’d drop the thought. \n\nNowadays, not only do people have immediate access to affirming information and communities for just about any topic/bias, we actively have systems in place that discourage critical thinking, cooperation, and compromise. Once companies figured out how to monetize the internet, they quickly discovered that tribalism and outrage were the easiest, quickest ways to generate clicks, views, and engagement (which translates to profit).",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-02-14 14:56:51",
            "replies": []
        },
        {
            "author": "fastolfe00",
            "body": "We moderate our political views based on what feels normal within our community.  In the last couple of decades our idea of what's normal has shifted to what we see online rather than what we see around us.\n\nThe revenue model for online content incentivizes keeping your attention, and the most successful content providers have algorithmically optimized what content they feed you based on what maximizes that attention, typically validation, confirmation, fear, and outrage.  Content providers that rely on actual impartial investigative journalism can't compete in the attention economy, and so they become irrelevant as providers like TikTok and Twitter become the main lens through which we see reality.\n\nCouple that with our two-party system, and you have two dueling worldviews, depending on what content you've subscribed to (and what the algorithms have decided you engage more with).  Each worldview you're fed is going to depict the other side negatively, and your side favorably.\n\nIt also means your Overton window is now disconnected from the other side's, and \"normal\" shifts toward what other people who consume the same media you consume feel, rather than society as a whole.  Both sides drift apart and become more \"extreme\" relative to the other, while also *perceiving* that the other side is even more extreme than that.",
            "score": -1,
            "depth": 0,
            "timestamp": "2025-02-14 13:59:20",
            "replies": []
        },
        {
            "author": "Oceanbreeze871",
            "body": "Cable news invented the red vs blue state graphic and then used that as the 24/7 365 political narrative.",
            "score": -1,
            "depth": 0,
            "timestamp": "2025-02-14 13:59:41",
            "replies": []
        },
        {
            "author": "heyhodadio",
            "body": "The left went too far, the right got fed up and because Google / mainstream media only really serve left-wing news the right went to alternative news sources \n\nThey may be leading edge at times (covid as lab leak theory was predicted almost immediately in those spaces while Twitter censored posts that claimed this for example) but they also have a ton of conspiracies like Q shit that people spiral down into",
            "score": -5,
            "depth": 0,
            "timestamp": "2025-02-14 13:45:00",
            "replies": [
                {
                    "author": "tonydiethelm",
                    "body": "The Left: \"Hey, let's help people. And maybe leave the $MINORITYs alone, huh?\" \n\nThe Right: \"Noooooooo!!!!! Stop oppressing meeeeeee!!!\" \n\nUtter fucking BS. Gays can get married now. Trans people exist... It doesn't affect you AT ALL, but y'all threw a fuck'in hissy fit. \n\nY'all have resisted every damn thing to make the world better. \n\nY'all moved to \"alternative facts\" because you couldn't handle the fucking truth. You're not victims and no one's oppressing you.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2025-02-14 14:20:07",
                    "replies": [
                        {
                            "author": "heyhodadio",
                            "body": "That isn’t how it happened. The left said: “we’re helping people in this way and this way only, and if you disagree you’re a Nazi and we’re getting you fired”\n\nDo you remember how bad cancel culture was mid 2010’s? That was driven by the left. \n\nRight doesn’t care about being gay or trans as long as you leave their kids alone, but instead the left put in drag queen storytime for kindergarteners and gay porn for preteens and called it homophobic to not want this. Then complained about book bans because parents didn’t want their kids seeing this stuff. \n\nAgain, as I said they just went too far. Same with abortion. Was a slow burner issue until that governor was cheering up to birth abortions. \n\nSame with immigration. We wouldn’t have this if Biden had Obama’s immigration policy but instead had the worst border security and even sent in feds to make sure Texas was letting people in. Trump wouldn’t have a platform if Biden had been tough on the border.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-02-14 14:28:59",
                            "replies": [
                                {
                                    "author": "tonydiethelm",
                                    "body": "/eyeroll. Made up BS. \n\n>Do you remember how bad cancel culture was mid 2010’s?\n\nNo, I don't, because it wasn't. \n\n>Right doesn’t care about being gay or trans \n\nAAAAAAAAhahahahahaha! You said that with a straight face!\n\n>as long as you leave their kids alone\n\nNo one is attacking kids. \n\n>the left put in drag queen storytime for kindergarteners\n\nReading stories with gay people in them doesn't turn people gay, any more than reading stories with elves in them as turned me into an elf. \n\nI have kindergartners, and I'd trust them alone in a room with some drag queens long before I'd trust them alone with a youth pastor or a Republican. \n\n>the left put in [] gay porn for preteens \n\n.... What the FUCK are you even blathering about? \n\n>Then complained about book bans \n\nIf you don't want to be called a Nazi, don't do Nazi stuff. \n\n>parents didn’t want their kids seeing this stuff. \n\nIf you want to control what your children see, then do it. Give a shit and get involved in your kids' lives. I know what's on my kids' shelves because I take them to the library and help them pick out books. \n\n**You can't baby proof the world, you have to world proof the baby. No one owes y'all a baby gate around the entire world.** Grow up. \n\n>Trump wouldn’t have a platform if Biden had been tough on the border.\n\nWe tried to, Trump got Congress to kill the bill. The entire \"issue\" is just a fucking lie y'all are too stupid to see. \n\nY'all are ridiculous.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 14:36:45",
                                    "replies": []
                                },
                                {
                                    "author": "birminghamsterwheel",
                                    "body": "If y'all cared about kids, y'all'd be doing something about all the priests and Republicans diddling children. As always, it's always NotADragQueen. The calling is coming from inside the house, bud.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 18:09:54",
                                    "replies": []
                                },
                                {
                                    "author": "Savethecannolis",
                                    "body": "2010??? 2002 People were throwingand burning Dixie Chick albums, please. Stop with the bullshit. I'll one fucking up you, during the ACA companies openly threatened employees with \"be careful who you vote for\" with the same firing bullshit your talking about and Conservatives cheered that shit on. \n\nAlso, breaking fucking news culture always changes and moves in different directions. Get used to it, Snowflake. \n\nYeah I guess after 40 years of trickle down economics and everyone getting pissed off maybe we should have tried something different. However you all threw a fucking temper tantrum and decided there's no fucking way Democrats can hold power so let's burn the whole fucking thing down. \n\nBush tried to fix the border but couldn't get the votes because the Dreamers was DOA for Republicans. Obama was deporter in chief and tried again but Dreamers were DOA.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 14:53:45",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "newman_oldman1",
                    "body": ">The left went too far, the right got fed up and because Google / mainstream media only really serve left-wing news the right went to alternative news sources \n\nThis is a laughable position. There's no \"left\" party in the U.S. The Democratic party is center to center right; they serve the same corporate interests as the Republican party, they're just a little more inclined to support regulation and some level of labor protections.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-02-14 14:06:30",
                    "replies": [
                        {
                            "author": "heyhodadio",
                            "body": "I’m not saying the left is a party, it’s all parties from Democrats to progressives to leftists. Big tech, govt, entertainment, news, everything was run by people on the left and served with that viewpoint, consciously or not. Even now it’s still hard to get a balanced view from google above the fold. \n\nAlso no matter how much the hard left keeps repeating that “the democrats are center right” it won’t make it true. I mean how can you say that when Harris was proposing taxing *unrealized* gains?",
                            "score": -2,
                            "depth": 2,
                            "timestamp": "2025-02-14 14:17:25",
                            "replies": [
                                {
                                    "author": "newman_oldman1",
                                    "body": ">Big tech, govt, entertainment, news, everything was run by people on the left and served with that viewpoint, consciously or not.\n\nNo, it absolutely was not. Rainbow capitalism isn't \"left\". Have you seen how quick Google was at gesturing to the Trump administration that they're willing to drop \"woke\" holidays after the Trump administration had what it deemed \"woke\" holidays dropped from government calendars? The Trump administration didn't even ask/demand Google to do that, they just did. This is just companies using the aesthetics of progressivism if they think it helps their image or their bottom line.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 14:35:02",
                                    "replies": []
                                },
                                {
                                    "author": "nikdahl",
                                    "body": "You really have to inform yourself better before spouting off about this nonsense.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 16:27:27",
                                    "replies": [
                                        {
                                            "author": "birminghamsterwheel",
                                            "body": "We have to get these people unplugged from the severe alt-right echo chambers, but I don't know how we do that without having some very uncomfortable discussions about speech, but this shit is infecting and rotting these people.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 18:14:08",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LivinAWestLife",
                    "body": "The problem is the right thinking for some reason AP News or Reuters or the BBC are far-left rags instead of reliable publications. If you thought that you were already part of the fucking problem.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-02-14 14:33:21",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": -2,
            "depth": 0,
            "timestamp": "2025-02-14 14:18:38",
            "replies": [
                {
                    "author": "Kakamile",
                    "body": "Mind you, with the caveat that trump had literal open white nationalists on staff, nc lt governor calls himself a black nazi, gop and fox peddle nazi white genocide/invasion conspiracies, they're committing crimes for authoritarian government takeovers, and the haitian immigrant conspiracies came from literal swastika-waving, slur-named neo nazis in springfield, ohio.\n\nSo it's more like people pointed out nazis and those who weren't had already tied their ships together so they merely gasped in offense rather than improving the party.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-02-14 14:29:02",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "[deleted]",
                            "score": -2,
                            "depth": 2,
                            "timestamp": "2025-02-14 17:07:31",
                            "replies": [
                                {
                                    "author": "birminghamsterwheel",
                                    "body": "...Steven Bannon was Trump's chief strategist for about 7 months in his first term, what are you talking about?",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 18:07:34",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "[deleted]",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 18:10:08",
                                            "replies": [
                                                {
                                                    "author": "birminghamsterwheel",
                                                    "body": ">Trump had no\n\nLearn English better if you don't want to be called out for it.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-14 18:10:54",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "[deleted]",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-14 18:15:22",
                                                            "replies": [
                                                                {
                                                                    "author": "Kakamile",
                                                                    "body": "Lol as if \"open\" is a defense.\n\nI gave you examples.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-02-14 18:30:42",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "postwarmutant",
                                    "body": "Trump has white nationalists on staff as we speak.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 18:35:26",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}