{
    "post_title": "Will advances in artificial intelligence make Liberal democracy obsolete?",
    "post_timestamp": "2020-07-08 04:46:01",
    "last_comment_timestamp": "2020-07-25 22:07:15",
    "time_difference": "17 days, 17:21:14",
    "comments": [
        {
            "author": "AHatDude",
            "body": "I think this is a really interesting question, and right from the get go I'll say I think it's really up in the air. What I do think the internet and AI will polarize the world. \n\nWe already kind of see this with respect to national attitudes to 5G. We could see \"seperate spheres\" for China, Europe, America, etc as digital tech gets more engrained in our lives and governments do or don't regulate it. \n\nIn regards to liberal democracy, the democratization of information is having a really interesting and scary kaleidoscopic effect on the way truth is perceived that reminds me of the way truth is spoken of at the end of *1984*.\n\nThat said, Liberal Democracy thrives on information, and the internet is the ultimate font of that. If we can avoid the fracturing of truth, citizens have easy, rapid access to facts, which should be a huge boon to democracy. That said, it could have the opposite effect, overwhelming voters and causing the wearieness and Toquevillian individualism de Toqueville presciently observed in his work. \n\nSo, I think it more than anything depends on the way people use it. If they fail to stand up and take an active interest in their governance, Liberal Democracy will fall. If they do take an active role, Liberal Democracy may enter an unparallelled golden age. Ultimately, its the same conflict democracy has always had, with some new ridiculously powerful plot devices added in.",
            "score": 44,
            "depth": 0,
            "timestamp": "2020-07-08 16:29:50",
            "replies": [
                {
                    "author": "steroid_pc_principal",
                    "body": "Thanks for your response, and I agree that general access to reliable information will be crucial moving forward. Unfortunately that is a really hard problem to solve, and AI technologies have even exacerbated existing issues in some ways, e.g. deepfakes and information bubbles. The task of telling the public what is and isn't trustworthy is a *hard problem* which we traditionally gave to journalists, but the volume of information out there today makes it a staggering task.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2020-07-09 00:39:46",
                    "replies": []
                },
                {
                    "author": "rationalcommenter",
                    "body": "How much do you personally think the surveillance information-complex (just winging a term) feeds into government autocratic tendencies?\n\nAs in, surveillance technology and its development perpetuates itself. It seems to be self-serving for “deep-state” agencies where they are able to mount surreptitious surveillance programs which are intrinsically protected by the nature of representative government. I mean as long as classified information exists and citizens can’t know things at the very least because other countries can’t, then we will see this arms race of citizen activism against surveillance. It’d be much like an invisible war since we practically lucked into finding out about the NSA’s program a decade ago.\n\nAt the end of the day, directly grabbing data from people still needs a subpoena and if it involves the court at all, you are shooting yourself in the foot if you didn’t follow judicial protocol. And at that point, it almost misses the need for surveillance. So then it leaves spying internationally and extra-judicial operations on US citizens/foreigners in the US.\n\nIt feels like surveillance is only truly frightening if you’re a progressive, but you would have the tools to fight against it. *As an aside, I’m aware of how alt-righters and right wingers cite 1984 as a depiction of “the left” to great irony so I’m sticking with what I said*.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2020-07-09 21:31:02",
                    "replies": [
                        {
                            "author": "AHatDude",
                            "body": "My mind comes to the quote attributed to Homer: \"The blade itself incites to deeds of violence.\" \n\nI think that's very pertinent. I also think that, as cliché as this is to say, information is the currency of the 21st century just as much as money. The tendency for corporations and governments to surveil is a natural consequence of the ability to do so, because the benefits to whatever body decides to collect that information are HUGE, and the disadvantages to not collecting informstion in the face of other bodies doing that are quite possibly fatal to the non-surveilling body. \n\nThe advantages of collecting that information is, uncontestably, prediction. With that information, you can predict the future within a certain margain of error. That ability to predict the future, I think, is a tightrope of sorts to walk, because the temptation to act on things that haven't happened yet, or act to prevent hypothetical events, is a quick slide down into authoritarianism. \n\nBut as I said above, it depends on the people that use the technology, and how. The game is the same as it always has been, just with much, much higher stakes.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2020-07-25 22:07:15",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "InFearn0",
            "body": "Advances in AI and automation make liberal democracy more crucial.\n\nThe only way to stop the universal surveillance state is with laws that prohibit it. Without those laws, eventually people have to fall back on costumes and those could be outlawed, see in London where people are fined and have their picture taken by police for trying to avoid facial recognition zones. Even IR emitting jewelry can be beaten by cameras designed to not see infrared.\n\nPhysical automation made a lot of physical jobs obsolete, but created different jobs controlling the machines.\n\nMachine learning advances are making it possible to remove some of those control jobs, and will replace other control jobs as it gets better (already AI algorithms are better at finding existing legal precedent than humans). And better control machines can enable new types of physical labor to be automated (e.g. picking delicate produce).\n\nThe result will be furthering the inequity gap between \"The Haves\" (people with producing assets) and \"The Have Nots\" (everyone else). And eventually the Have Nots will not be able to afford things. The lack of \"able to pay\" demand would encourage companies to scale back production (so engage in artificial scarcity). It would be lead to a collapse of society as the Have Nots have to find alternative ways to house, feed, and cloth themselves (either go to a gray market of barter or spread out and try to farm without access to water utilities they can't afford).\n\nThe end result is that the only stable countries would be ones that:\n\n1. Engage in aggressive redistributive policy (beyond providing income for basic needs), and\n\n2. Proactively respond to attempts by asset owners to protest or enact an \"Atlas Shrugged\" strategy by using eminent domain laws to seize assets deliberately left unused (be they land, infrastructure, or IP).",
            "score": 13,
            "depth": 0,
            "timestamp": "2020-07-08 17:05:02",
            "replies": [
                {
                    "author": "steroid_pc_principal",
                    "body": "I think the economic issues introduced from artificial intelligence and automation are a separate but equally crucial aspect of its technological impact. I can imagine redistributive policies existing or not existing independent of whether certain other human rights are upheld. Now, the process of getting there may be easier in an autocracy if the government so chooses, but it also may be harder given the temptation of simply using artificial intelligence to crush any bits of economic unrest.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2020-07-09 00:46:30",
                    "replies": [
                        {
                            "author": "InFearn0",
                            "body": ">  I can imagine redistributive policies existing or not existing independent of whether certain other human rights are upheld.\n\nI assume you mean that robot/drone enforcers could be used to suppress unrest.\n\nWell, that could be done by government or by the Haves themselves.\n\nAnd the only thing that could stop that is liberal democracy saying:\n\n1. \"Private ownership of drone weapons aren't covered by the 2nd amendment and are restricted.\"\n\n2. \"We also forbid ourselves from deploying drone weapons against civilian populations.\" (Which would be in line with laws against the US government deploying military against civilians domestically.)\n\nWhich circles back to \"Significant technology innovations make liberal democracy *more* crucial and less obsolete.\"",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2020-07-09 12:28:34",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zacker150",
                    "body": "I disagree with your take on automation.\n\nYou assume that there is only a finite amount of work to do, but human wants and desires are infinite.\n\nAutomation inherently means that production costs go down, which in turn lower prices. Lower prices cause increased demand (not necessarily for the same product), which in turn causes production to increase. This production increase results in new higher paying jobs, and the cycle continues.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2020-07-09 12:03:00",
                    "replies": [
                        {
                            "author": "InFearn0",
                            "body": "> Lower prices cause increased demand (not necessarily for the same product), which in turn causes production to increase. This production increase results in new higher paying jobs, and the cycle continues.\n\nLower prices don't matter if people have no money in the first place. \"Demand\" doesn't mean \"How many people want something.\" It means \"How many people **that can pay for it** want something.\" During recessions, companies cut back production because they don't want a ton of excess inventory that they can't sell (and they spent money on materials and labor to make).\n\nAnd while it is true that innovation have lead to higher paying jobs, they have always been **proportionally fewer** higher paying jobs than they replaced.\n\nAnd prior to now we haven't had machines capable of doing \"high skill work\" better than humans. But we now do have robots that do research better (as long as they have a database of partitioned entries).\n\nIt is why the current step 1 for doing legal research is to have a robot do a contextual search. The false negative (missing a case) and false positive (flagging unrelated cases) rates have gotten *really* low.\n\nAll history points to automation widening the inequity gap. There is no reason to expect that trend to change without proactive government intervention.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2020-07-09 13:32:21",
                            "replies": [
                                {
                                    "author": "zacker150",
                                    "body": "[This](https://www.mitpressjournals.org/doi/abs/10.1162/rest_a_00754) MIT study says otherwise.\n\n>We analyze for the first time the economic contributions of modern industrial robots, which are flexible, versatile, and autonomous machines. We use novel panel data on robot adoption within industries in seventeen countries from 1993 to 2007 and new instrumental variables that rely on robots’ comparative advantage in specific tasks. Our findings suggest that increased robot use contributed approximately 0.36 percentage points to annual labor productivity growth, while at the same time raising total factor productivity and lowering output prices. Our estimates also suggest that **robots did not significantly reduce total employment**, although they did reduce low-skilled workers’ employment share.\n\nLikewise, [this](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3066052) study from the ITIF agrees with me.\n\n>Second, many believe that if innovation only accelerates even more then new jobs in new industries and occupations will make up for any technology-created losses. But the truth is that growth in already existing occupations is what more than makes up the difference. In no decade has technology directly created more jobs than it has eliminated. Yet, throughout most of the period from 1850 to present, the U.S. economy as a whole has created jobs at a robust rate, and unemployment has been low. **This is because most job creation that is not explained by population growth has stemmed from productivity-driven increases in purchasing power for consumers and businesses. Such innovation allows workers and firms to produce more, so wages go up and prices go down, which increases spending, which in turn creates more jobs in new occupations, though more so in existing occupations (from cashiers to nurses and doctors).** There is simply no reason to believe that this dynamic will change in the future for the simple reason that consumer wants are far from satisfied.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2020-07-09 16:51:37",
                                    "replies": [
                                        {
                                            "author": "InFearn0",
                                            "body": "> although they did reduce low-skilled workers’ employment share.\n\nThis seems pretty significant.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2020-07-09 17:00:08",
                                            "replies": [
                                                {
                                                    "author": "zacker150",
                                                    "body": "So they're saying that automation is replacing low skilled (high-school dropout) jobs with an equal number of high-paying high (college graduate) and medium (high school graduate/some college) skilled jobs. I think that this is a good thing.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2020-07-09 18:24:06",
                                                    "replies": [
                                                        {
                                                            "author": "ShadyOrc97",
                                                            "body": "What happens to the people working the low skilled jobs?",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2020-07-09 21:31:30",
                                                            "replies": [
                                                                {
                                                                    "author": "zacker150",
                                                                    "body": "High school and college completion rates have [increased dramatically](https://upload.wikimedia.org/wikipedia/en/d/d1/Educational_Attainment_in_the_United_States_2009.png) over the last few decades and are expected to continue rising.  In the time period studied, the effect sizes observed (a 5-10% shift in share of hours worked), were small enough to be easily absorbed by these demographical shifts. Jobs becoming more skilled isn't a problem because the labor force is also becoming more skilled.",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2020-07-09 22:24:34",
                                                                    "replies": [
                                                                        {
                                                                            "author": "rationalcommenter",
                                                                            "body": "So then the obvious recourse we’re all following is that college education is a necessity and eventually trades will be on par with HS diplomas.\n\nThis would mean eventually we’d need to rethink the way in which we educate and fund people while they rise to these points where they can sufficiently offer a worthwhile service. If they don’t rise to these points - in whatever the expected time frame is - they’re kinda out of it unless there’s an established welfare state.",
                                                                            "score": 3,
                                                                            "depth": 8,
                                                                            "timestamp": "2020-07-09 23:39:55",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "zacker150",
                                                                                    "body": "I do think that in the economy of the future, everyone will need some sort of post-secondary education, but I'm not convinced that this post secondary education needs to be a bachelor's degree. In my vision of the 22nd century economy, I see four main types of jobs:\n\n* **Technicians** who go in and fix things when things break.\n* **Operators** who oversee a set of machines.\n* **Developers** who develop new products and machines to make said products\n* **Administrators/Bureaucrats** who attempt to find the profit maximizing spot given the ever-expanding array of options available to a firm (remember the story of the [electronic spreadsheet](https://www.npr.org/sections/money/2015/02/25/389027988/episode-606-spreadsheets)).\n\nOf these job types, technicians will probably continue to operate under the apprenticeship/trade school model that the current trades operate under, and operators will most likely be able to get by with the equivalent of an associate's degree.\n\nThat being said, I agree that we need to figure out how to fix our current education system. Barring some sort of prohibitive mental disability, there is no reason why we should let any child reach adulthood unprepared for a post-secondary education.",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2020-07-10 00:48:25",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "rationalcommenter",
                                                                                            "body": "Well I mean certainly by the 22nd century either highschool education covers real analysis and we’re just that good at teaching it, we live dramatically longer, or we begin specializing immensely at younger ages.\n\nThe scope of knowledge necessary to be a developer is going to be immensely higher by then. I mean as we bring more things to the forefront, we will have more knowledge and techniques we need to coalesce just to begin finding new things.\n\nSame thing applies to working a service sector job if we’re still operating on a predominately market based economy.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2020-07-10 04:07:28",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Phekla",
            "body": "As long as we are not talking about Singularity (super-intelligence, general type), AI is just a tool. And as such, it can be used for better or for worse.\n\nTake, for example, AI used on social media platforms. As it is now, algorithms mainly promote the creation of echo-chambers by feeding people content that aligns closely with their own views. It is very profitable for tech companies because people tend to spend more time in their echo-chambers and the goal of social media platforms is to keep users engaged close to 100% of time. This is not very good for people or for democracy due to polarisation, radicalisation, and related phenomena.\n\nNow, imagine that the very same social platforms used AI to mark trustworthiness of the information, suggest in-depth articles on currently debated topics, inform about alternative views, and so on. This would, probably, be less profitable for the business and less psychologically comfortable for users, but this might reduce echo-chamber effects and help people to be well-informed in regard to most pressing and relevant issues.\n\n&#x200B;\n\nPrivate data collection can also be put to good use. For example, an analysis of social media profiles might help to prevent psychological problems. Modern algorithms can sift through enormous datasets and can find connections that are easy to miss for humans. If there are any subtle indicators for depression, domestic violence/abuse, suicide AI can find and identify it and then send a victim some helpful information, a contact of a support group, or even notify a human professional in an extreme case. Moreover, most of this can be accomplished in an absolutely anonymous, private way.\n\n&#x200B;\n\nAI can also be instrumental in transitioning to true democracies, especially if a country desires to build a direct democracy. It is much easier for citizens to stay engaged if they have a helper that can summarise the issues for them, provide links to the relevant information, and keep tabs on various politicians and government policies. An AI can also be used to analyse the impacts of various proposals on people and their lives. It would also force politicians to come up with real proposals as opposed to slogans and wish lists.\n\nImagine that you can have a tax debate based on figures that apply directly to you, so you can immediately see how your income would change and what you would get for your money. I think it would be much easier for you to make a decision. It would be also easier to hold your representative and government accountable.\n\nOf course, something like this requires a little bit more advanced AI than what we have now. But it is not something unachievable.\n\n&#x200B;\n\nAs for autocracies and democracies, there are not many differences in the potential benefits of AI. It will all depend on the creativity and skill of those who use this tool. Just do not think that people who do not live in democratic societies are somehow less creative. They are not. It very well may be that they are more creative because they have to live in much more restrictive environments.",
            "score": 11,
            "depth": 0,
            "timestamp": "2020-07-08 21:42:19",
            "replies": [
                {
                    "author": "steroid_pc_principal",
                    "body": "I really like your answer because it really addresses the \"how\" AI can be used for good. At the very least it is a good start for areas which should be researched and fleshed out further.\n\n> Now, imagine that the very same social platforms used AI to mark trustworthiness of the information, suggest in-depth articles on currently debated topics, inform about alternative views, and so on. This would, probably, be less profitable for the business and less psychologically comfortable for users, but this might reduce echo-chamber effects and help people to be well-informed in regard to most pressing and relevant issues.\n\nI think this is a very hard task. Depending on the statement, they may range from verifiably true to pants on fire false, but the middle is filled with shades of grey like \"X policy hurts America\" which is hard to verify either way. Computational linguistics is still in its infancy but eventually I do think informing alternate viewpoints could be a goal, if done carefully. That said, I think you're on to something as far as the profit model goes. It would have to be some sort of non-profit company or even government-funded NPR of social media which isn't incentivized to create addicted users.\n\n> Imagine that you can have a tax debate based on figures that apply directly to you, so you can immediately see how your income would change and what you would get for your money. I think it would be much easier for you to make a decision. It would be also easier to hold your representative and government accountable.\n\nThis is also great. And this doesn't even have to be created using sophisticated AI, a simple \"now vs hypothetical future\" calculator would work.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2020-07-09 01:06:03",
                    "replies": [
                        {
                            "author": "Phekla",
                            "body": "What I was talking about when I mentioned trustworthiness was not related to 'X hurts Y'. It was about verifying the sources. One of the greatest problems of the Digital Age is information overload and the inability of many internet users to recognise reliable sources. People simply do not have enough time and motivation to check whether Dr A is a) indeed, a Dr; b) is a Dr in a relevant field; c) is an actual expert in that field.\n\nEven currently existing algorithms can check credentials and various references. It is already possible to assign 'weights' to different people based on available data. For example, an AI can check publications by Dr A in peer-reviewed journals and how often those publications were cited by other authors (this is easily accessible data even in paid databases). Based on results, the AI can add a tag (or several) that would characterise Dr A as a real deal or a fraud.\n\nOf course, something like this is much easier to do for published authors than for politicians, for example. But it would be a start.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2020-07-09 04:17:05",
                            "replies": [
                                {
                                    "author": "steroid_pc_principal",
                                    "body": "> b) is a Dr in a relevant field; c) is an actual expert in that field.\n\nI think these are a bit harder than most people realize. It's not that easy to classify a post with regards to what fields of expertise will be relevant there, sometimes even for a human. And even within one field there are many subdomains, but a scientist may be an expert in only one or two of them. On top of that, being an expert in a field doesn't necessarily mean that everything I say about that field will be verifiably accurate.\n\nSharing and retweeting makes things even more murky. It might be that something gets shared by an \"expert\" even though it has some falsehoods within it. Does that mean the expert endorses the falsehoods too, or just the headline he read? Experts with thousands of followers can quickly spread lies even unwittingly.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2020-07-09 05:55:49",
                                    "replies": [
                                        {
                                            "author": "Phekla",
                                            "body": "I absolutely agree that experts are not infallible. I would also throw in here that non-experts tend to provide more creative and innovative solutions than experts in the same field provided that non-experts in this field are experts in some other fields. However, experts still treasure their reputations, so it is less likely that they would be spreading falsehoods intentionally if their reputations can be tarnished by that.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2020-07-09 13:28:12",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rationalcommenter",
                    "body": "Do people not already implicitly form echo chambers though?\n\nI mean left/right is literally because of how the French oriented themselves in parliament. It’s not unusual or new. The idea diametrically opposed beliefs create a meaningful discourse by the singular aspect of engaging each other (like Crossfire) is pretty ridiculous.\n\nI hear this argument brought up a lot and I dont buy it.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2020-07-09 23:45:05",
                    "replies": [
                        {
                            "author": "Phekla",
                            "body": "Of course, people tend to congregate with those who are similar to them. However, prior to the internet, it was not possible to remove all dissenting voices and opinions from one's environment. Now it is possible. Moreover, the more we discourage face-to-face discussions about politics and similar hot topics the more we push people into internet echo-chambers.\n\nThe problem with echo-chambers is not that they are basically internet clubs of similarly minded individuals, but that they block almost everything that does not fit the main narrative accepted by this particular group of people. \n\nI do not say that echo-chambers are the root of the evil, though. I am also not 100% sure whether they are the reason for political polarisation or the symptom of it. Recently I read an interesting article (sorry, I could not find a link) suggesting that democrats and republicans are becoming cultural identities rather than simple political preferences. If it is indeed so, echo-chambers might be an online manifestation of this process.\n\nMy initial point still stands, though. Algorithms used to suggest content on various social platforms recommend those things that somehow align with the content created by a user. And this contributes heavily to echo-chambers creation and development.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2020-07-10 01:03:32",
                            "replies": [
                                {
                                    "author": "rationalcommenter",
                                    "body": "The left vs right dichotomy is pretty endemic to urban vs rural populations in general and we’ve documented it for over two centuries.\n\nMoreover, how often do you suppose people actively discussed political topics in person prior to the advent of the internet?\n\nI mean what political opinion would an average woman in a nuclear family have in the advent of women’s suffrage?\n\nEdit: My point is it doesn’t matter because we’ve always formed echo chambers. I mean we fought a war between the north and south.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2020-07-10 01:05:11",
                                    "replies": [
                                        {
                                            "author": "Phekla",
                                            "body": "I would disagree on rural vs urban divide. This is a rather new development since high urbanisation is a very recent thing. In the US the divide is more along the business size line: big business vs small business (when it comes to the economy). Social issues have a slightly different dynamic and in the past decades, indeed, aligned more with urban-rural divide. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI think you will find this [article](https://www.theatlantic.com/politics/archive/2016/05/violent-little-partisans/481641/) interesting. It talks about political clubs and events in the 19th century.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI believe that you are underestimating women. Do you really think that women started to have opinions only after they had won their right to vote?",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2020-07-10 01:45:16",
                                            "replies": [
                                                {
                                                    "author": "rationalcommenter",
                                                    "body": "For income distribution in 2016, it trended from Democrats having a difference of +12 at the lowest income and a difference of -2 at the highest income bracket.\n\nWhat does big vs small business mean here? Because labor unions are effective and necessary when you have large firms with sequestered wealth and minimal competing firms. Democrats do also abhor the coalescing of large firms because historically labor unions have been weakened so much so that they can’t field strikes effectively.\n\nThe difference at the highest income bracket is significantly nominal and the difference at median income brackets is like +-1.\n\nI just don’t fully understand what you mean by big vs small business when it comes to political philosophy here. Aside from the Milton Friedman neoliberalist platitudes of a robust and diverse economy, I can’t really map the data unless we’re going to map D and R to the citizens united ruling.\n\n*edit: I mean there’s every unique brand of progressive who has their own idea about how to handle mega corps: grow via Capitalism and then nationalize forcefully, rip from under them to spur the glorious revolution, etc.*\n\n*but this is really far off from representing the main dichotomy.*\n\nThe easiest dichotomy I see is a call for higher centralization and public planning vs a call for decentralization/anything-really to ensure private planning, but this is intrinsically tied to urban vs rural challenges. They each quintessentially benefit from them respectively. Rural areas have a lot of land. Your dilemma is fielding people to move there. People move there for opportunity, not to be micromanaged. Urban areas are micro management and planning. People move here because of established institutions, which need to be regulated to some degree because of the scope of inhabitants.\n\n>on the article\n\nI feel this bolsters my point that echo chambers are intrinsic to people, that it is closely related to your upbringing in either an urban or rural area. That AI and technology are not antithetical to political discourse.\n\n>women\n\nThe main feminist proponents, sure. They had developed opinions, but they were by and far the outlier. Really I’m just drawing from my cursory memory of 2nd wave feminists rallying for alimony to be abolished because it intrinsically represented, in practicality and metaphor, that women were dependent on men and this being rejected enmasse. White women in America have historically just touted the values of the head of the household. I mean this isn’t that far fetched. \n\nI mean white women in America vote predominately Republican. They literally vote for what represents the status quo at best and reactionary politics at worst. Is it so much an opinion if it’s just something you’re assigned?",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2020-07-10 02:41:23",
                                                    "replies": [
                                                        {
                                                            "author": "Phekla",
                                                            "body": "I am sorry, I think a more accurate statement would be big business vs non-big business. While parties changed their views on many issues, sometimes to complete opposite, their positions were consistently aligned with the interests either of big business or the non-big business voters.\n\nFor example, the Republican party changed from supporting a big federal government with huge spending and big public projects to opposing the big federal government and public spending. This change happened around the 1930s-1940s. It is also 'the party of Lincoln' that fought for the emancipation of slaves (which was beneficial for the North and the industries) but nowadays it fights against minorities (because inclusiveness and diversification of voters threatens the status quo).\n\nThese shifts in positions align perfectly with the interests of big business. The party was fond of the federal government when the business needed to build infrastructure and educate workers, protect investments and intellectual property. However, once those goals are accomplished and big business is sufficiently big to protect itself the federal government with its taxes and regulations becomes an inconvenience. So, the Republican party changes its tune and starts to argue for smaller government, deregulation, and so on.\n\nOf course, this mostly describes general trends. Individual politicians may deviate from this trend. And, as I said earlier, positions on social issues align better with the urban-rural divide.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI do not think that we are in disagreement about people. We only differ in our opinions on AI's contribution to creation, promotion, and sustainability of the echo-chambers.\n\nI also fully agree that AI and technology are not antithetical to political discourse. My main contention was that AI is a tool and nothing more. It is not inherently good or bad. However, I do not think that the current use of AI on social media platforms is beneficial. And I am [not alone](https://www.technologyreview.com/2019/03/07/65984/deepmind-is-asking-how-google-helped-turn-the-internet-into-an-echo-chamber/) in this opinion.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWhy does it count for an opinion only if it is different than a tradition or one's family? Do you apply the same standard to men?\n\nI also think that the alimony example is a bad one. Of course, any sensible woman would reject the idea of abolishing alimonies considering how the society worked at that time and still works now. There is nothing wrong in grounding one's opinions in reality. Being a single mother is one of the best predictors of poverty even today.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2020-07-10 04:29:42",
                                                            "replies": [
                                                                {
                                                                    "author": "rationalcommenter",
                                                                    "body": "1. Okay I see what you’re referring to. Still though this does track urban and rural development pretty well.\n\n2. So I mean I’ll open my facebook feed and find content which perpetuates my underlying biases. It’s an issue for people who have yet to immerse themselves in political philosophy and policy, but it’s no different than what the article you gave outlined.\n\n3. Hey, this is really sexist tbh, but I honestly don’t indulge the opinions of people who say TV talking points or slogans. Really, if someone is a stay at home mom that comes from the nuclear family in suburban America (breadwinner husband and all), I can’t consider them to have an opinion. It’s more akin to the 3/5ths compromise and how it weighted southern representation if anything.\n\n>alimony\n\nDefinitely, it actually is a poor one as well, but engaging deviations from the norm are how opinions form because they’re value judgments and you need something to weigh against. I guess my point is I feel women in general have only recently been immersed in issues which they can field their own experiences from to make normative claims about policy.\n\nMaybe it’s just my Trump hate talking, but I find it hard to take seriously republican women. It generally just feels like stockholm syndrome.\n\nEdit: actually, generally I feel most people who vote in elections don’t have a genuine opinion. Myself, I’m up in the air on whether I’m actually autonomous or just groomed. At this stage I’d venture to say voting is just data collection of simple socio economic trends. The closer we get to economic equality reflects us getting closer to people having genuine opinions.\n\nBut truthfully I could just be horribly sexist towards women from rural communities. And I’m just picking and choosing when to assign agency so I can avoid assigning moral blame to women who reiterate Republican talking points.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2020-07-10 04:58:52",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Phekla",
                                                                            "body": "Hmm... you just described my problem with feminism. Somehow women have agency only when they support feminism and its values, but they suddenly transform into powerless and indoctrinated victims of patriarchy when they uphold traditional views.\n\nI really do not want to go into this or morality issues.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2020-07-10 06:55:58",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "rationalcommenter",
                                                                                    "body": "I mean let’s be honest it is plainly the correct way forward.\n\nBut yeah, mainly I just can’t respect the republican women I’ve met.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2020-07-10 11:56:33",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "steroid_pc_principal",
                            "body": "People do implicitly form echo chambers, but social media often exacerbates the issue. Social media websites use what are called “recommender systems”. These algorithms are statistical methods of showing users things the system thinks users will like, which are related to things the system knows users already like. This is fundamentally different from how most interactions happen in real life, where the people you meet *probably* won’t agree with you on everything. It gives users the subconscious feeling that “everyone agrees with me” even though that is not true. \n\nIn real life people do tend to seek out like-minded people, but in doing so you will have to encounter and actively discriminate against many who don’t think like you. The narrower your criteria, the more you will see that your opinions aren’t shared by most people.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2020-07-13 02:52:36",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pillbinge",
            "body": "It'll make all government obsolete in some sense if implemented in this dystopian way. Why have a dictator? And how? Why have any form of government if AI can not only interact with you but even cut you off from certain services?\n\nAI isn't the issue. People can ultimately live without computers or technology in some sense. AI might even make the world less technological; the average person already doesn't understand what they own. What's the sollipsistic difference between not being able to repair a toaster and being unable to when you know?\n\nThere's also a split. A lot of people think AI will open up the world. I think it would likely close it off. If AI might provide so many benefits to so many, why have people leave or enter? Why have immigrants if AI and machinery can handle it? And so on. We just don't know what it'll mean.",
            "score": 7,
            "depth": 0,
            "timestamp": "2020-07-08 16:36:46",
            "replies": []
        },
        {
            "author": "Unconfidence",
            "body": "You know, I want to make some deep point about all this, about how we'll be changed for the better by technology of this kind.  But in my heart of hearts, what I see in the future is conservatives using AI scripts to effect voter and electoral fraud.  Shit, at this point I wouldn't be surprised if wealthy capitalists started campaigning to make votes of the AIs they own count for 3/5ths of a vote.  The technology isn't going to save us from people who can't even wear a mask.",
            "score": 4,
            "depth": 0,
            "timestamp": "2020-07-08 18:08:36",
            "replies": []
        },
        {
            "author": "AnnaBohlic",
            "body": "It already has.\n\nWe already use AI to artificially promote and demote topics that it determines suitable. It literally drives our discussions over Reddit, over Twitter, over facebook. It determines what google shows you, what your browser suggests would interest you, what websites advertise to you.\n\nWe are on a runaway train currently. The more we speak on a topic, the more it is promoted, the more radical it gets, the more people get radicalized and polarized, the more that gets promoted. Before you know it, we are rioting in the streets and Indian skin care companies are changing the name of their products because it loosely references the idea of the word \"white\"  \n\n\n  \nEdit: To illustrate why this is important. More and more of the world comes online every day. The internet is connecting everyone on the planet and social media platforms are the medium by which the human race conducts its discourse. Failure to see how manipulation of these devices is important to the outcome of our reality is simply dishonest.",
            "score": 11,
            "depth": 0,
            "timestamp": "2020-07-08 16:50:26",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "You had me in the first half. Then that second half is rough.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2020-07-09 15:13:43",
                    "replies": []
                }
            ]
        },
        {
            "author": "chrisrayn",
            "body": "I think it’s important to to throw in some info I got listening to Malcolm Gladwell’s revisionist history this week, which made me feel like Liberal democracy isn’t very liberal or very democratic. [Here’s a link to the episode](http://revisionisthistory.com/episodes/44-the-powerball-revolution), but it basically posits the idea that taking a group of people who are willing to do a job and meet all the justifiable criteria for doing that job should be chosen in a “lottery” voting system of sorts so that the voting is fair. Our current systems reward those who can rally voters, those who are good public speakers, those who interview well, etc., when all the data we have shows that we are pretty poor predictors of performance in a position, whether hired, appointed, or elected. An example he gives that really hit for me (amongst his many others) is to ask someone if American President have been elected democratically, and I believe someone says yes, but then he asks how many Presidents have been women, and the person says zero, and then asks what percentage would have been women in this lottery system, and he says 50%. So if America were truly democratic and actually selected candidates that represented its people, we would see it. I honestly feel like AI could help us achieve the true representation for all that we want through providing the tools by which we could make such ideas work, but I have a much lower understanding of the AI principles than most of you (I’m just a college English instructor with a wide variety of interest that are quite interdisciplinary know nature).",
            "score": 2,
            "depth": 0,
            "timestamp": "2020-07-10 19:23:44",
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report uncivil or meta comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2020-07-08 04:46:01",
            "replies": []
        },
        {
            "author": "B38rB10n",
            "body": "To the extent some laws are meant to address different groups of people preferring opposite things, and those preferences are in a sense random and mutable, I doubt AI could handle it.\n\nFacial recognition works best for white men. Works much more poorly for very dark-skinned males and females (which would include Australian aboriginees, melanesians in addition to sub-Saharan Africans and African-Americans). To the extent it's deemed unreliable, it may be ruled ILLEGAL to use by law enforcement.\n\nAs for entertainment, VR for games, CGI for movies?\n\nIf governments recognize AND ENFORCE rights to privacy, AI may be starved of the data necessary to make it a threat to liberty.\n\nCould autocracies benefit from AI with intrusive data collection? Possibly, but likely in ways those in democracies view as weaknesses of autocracies.",
            "score": 1,
            "depth": 0,
            "timestamp": "2020-07-09 03:16:26",
            "replies": [
                {
                    "author": "steroid_pc_principal",
                    "body": "The question in my mind isn't so much whether we can prevent AI at all. It could be possible to write a law that facial recognition couldn't be used in any way by law enforcement or national security apparatuses. \n\nBut that misses the point. In a democracy, fundamental values are at odds with e.g. facial recognition which could be an extremely useful tool to the government. The existence of facial recognition gives autocracies, which don't care about privacy or personal liberties, an asymmetric advantage over democracies. Democracies must either handcuff themselves or forfeit a part of their identity. Stacking enough of these systemic advantages together will mean that autocracies are more powerful than democracies in the future, and there will be a greater and greater chance of democracies slipping into totalitarianism. Unless there is a counteracting technological force pulling governments towards democracy, I don't see how that trend is avoidable.\n\n> Facial recognition works best for white men. Works much more poorly for very dark-skinned males and females (which would include Australian aboriginees, melanesians in addition to sub-Saharan Africans and African-Americans).\n\nThis is a temporary problem. An engineering issue. Facial recognition also used to have a hard time distinguishing between Asian faces, but China quickly worked that out. There's no law of nature that says facial recognition can never be effective.\n\n> Could autocracies benefit from AI with intrusive data collection? Possibly, but likely in ways those in democracies view as weaknesses of autocracies.\n\nI'm not exactly sure what you mean by this. Do you mean that collecting large amounts of data about a country's population makes that country weaker?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2020-07-09 06:17:29",
                    "replies": [
                        {
                            "author": "B38rB10n",
                            "body": "> The existence of facial recognition gives autocracies, which don't care about privacy or personal liberties, an asymmetric advantage over democracies.\n\nWhat advantages to facial recognition, specifically? Are those advantages from the perspective of democracies or rather the citizens of those democracies?\n\nAutocracies ALREADY have far more control of their OWN PEOPLE than democracies, this far more INTERNAL power. Would AI and facial recognition somehow transform that into insurmountable power autocrices could exploit EXTERNALLY? How?\n\nNote that the US military is hardly slacking off with respect to applying AI to killing the enemy. Kindly explain how the US would be at a severe disadvantage vis-a-vis China with respect to AI.\n\nYou're positing a lot of things without providing any support for them. For example,\n\n> Do you mean that collecting large amounts of data about a country's population makes that country weaker?\n\nYes, indeed, if that data REDUCES individuals' freedom. How does collecting LOTS of data on a given country's inhabitants IMPROVE that country's security from external threats? In simplistic terms, would facial recognition have prevented 9/11 if the INTENT of the airplane-bombers had been unknown?\n\nSo, can facial recognition (FR) be used to find known terrorists? Maybe, but are there things terrorists could do to disguise themselves? Beards and hair obscuring temples? Baseball caps obscuring part of the forehead? Prostheses and make-up?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2020-07-09 14:42:06",
                            "replies": [
                                {
                                    "author": "steroid_pc_principal",
                                    "body": ">\tWhat advantages to facial recognition, specifically? Are those advantages from the perspective of democracies or rather the citizens of those democracies?\n\nFrom the perspective of a totalitarian government, this allows them to further entrench their power, and reduces the risk of popular uprisings or any other forms of instability. Mass surveillance becomes orders of magnitude less expensive when you don’t need to hire humans to follow citizens one by one.\n\n>\tAutocracies ALREADY have far more control of their OWN PEOPLE than democracies, this far more INTERNAL power. Would AI and facial recognition somehow transform that into insurmountable power autocrices could exploit EXTERNALLY? How?\n\nEvery dollar spent on internal stability and police action is a dollar not spent on military or infrastructure or anything else. So even from a birds eye view this gives a major systemic advantage to a government which can maintain peace cheaply. Additionally, domestic unrest is expensive when you consider the damage it can cause. Riots are expensive, and while people are rioting they’re not working. Finally, any internal unrest draws attention and resources away from international issues. Russia has been accused of contributing to unrest in the US, and the US was accused of doing the same in Hong Kong.\n\n>\tKindly explain how the US would be at a severe disadvantage vis-a-vis China with respect to AI.\n\nSure. The US does not have the same kind of national security law that China does. This means that the US does not force companies or individuals to do national security work for them. Google, which employs some of the leading AI researchers, was allowed to discontinue working on Project Maven due to personal political inclinations against autonomous weapons systems. Such a thing would never happen in China. Chinese AI researchers also command higher salaries than American researchers on average, which attracts foreign researchers as part of their Thousand Talents Plan.\n\n>\tYes, indeed, if that data REDUCES individuals' freedom. How does collecting LOTS of data on a given country's inhabitants IMPROVE that country's security from external threats?\n\nIt seems like you’re equating national power and security with having individual liberties, which I don’t see as the case. But again, China is a very safe country. Violent crimes are extremely rare especially when compared to neighbors like Vietnam or Thailand. Their answer to terrorism has been to incarcerate over a million Muslims, without even the accusation of a crime. And there’s no one to question their draconian measures.\n\n>\tSo, can facial recognition (FR) be used to find known terrorists?\n\nI don’t want you to get hung up on FR and terrorism because that’s not really what this is about. FR is just one technology, terrorism is just one category of crime. You can track people in a myriad of other ways. There are many other kinds of threats. What’s important is the paradigm of peace through absolute control, which becomes more and more possible by the day.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2020-07-10 03:25:06",
                                    "replies": [
                                        {
                                            "author": "B38rB10n",
                                            "body": "> From the perspective of a totalitarian government, this allows them to further entrench their power, and reduces the risk of popular uprisings or any other forms of instability.\n\nSo not valuable to democracies.\n\nNo question AI and FR can make autoritarian oppression more efficient. I grant you that. Whether that type of efficiency would be of any value to democracies is unlikely (to be charitable). Thus the distinction I'm trying to make: authoritarians and democracies want different things, so it shouldn't be surprising that autoritarians could derive value from some tools which would be of far less value to democracies.\n\nIOW, no, democracies may not benefit from doing everything authoritarians do.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2020-07-10 16:50:13",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "I feel like it's the same deal as with mass production of cars, or other major technological leap that drastically changes our ways. Technologies are neutral themselves, and their effect depends on a user. In cases of having dominant capitalistic and\\or governing powers sure it will be used on their scale and for their causes – whatever the space left for them after the regulative law applied, and if it's followed. In cases where these powers are weak or non-existent (comparable to regular people), advancement of AI won't carry the same risks and advantages, would be local and oriented mostly on folk's causes.\n\nIt's a question of how democratic this democracy is, and how much the power is disperse\\accumulated.",
            "score": 1,
            "depth": 0,
            "timestamp": "2020-07-09 05:45:47",
            "replies": []
        },
        {
            "author": "AntifaX-wingPilot",
            "body": "AI will make Liberal Democracy obsolete, like every other form of human government, by making humans obsolete.",
            "score": 1,
            "depth": 0,
            "timestamp": "2020-07-10 19:07:51",
            "replies": []
        },
        {
            "author": "PET4TRON",
            "body": "Q. Are advances in artificial intelligence are making Liberal democracy less and less tenable?\n\nA. Are are they are yes are.",
            "score": 1,
            "depth": 0,
            "timestamp": "2020-07-16 12:50:10",
            "replies": [
                {
                    "author": "steroid_pc_principal",
                    "body": "Thank you for your insights mr spock.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2020-07-17 00:45:20",
                    "replies": []
                }
            ]
        },
        {
            "author": "javascript_dev",
            "body": "I don't know the answer but I just wanted to say, restricted societies carry a lot of benefits that unrestricted ones do not have as well, so this would not be a purely dystopian scenario. The China model may well be the most productive use of human capital.",
            "score": 1,
            "depth": 0,
            "timestamp": "2020-07-08 16:55:58",
            "replies": [
                {
                    "author": "mors_videt",
                    "body": ">the most productive use of human capital\n\nNice for the capitalist but probably not a great experience for well-harnessed labor force",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2020-07-08 19:59:00",
                    "replies": []
                },
                {
                    "author": "steroid_pc_principal",
                    "body": "Indeed, a government with an Artificial General Intelligence agent could potentially function as a benevolent dictatorship.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2020-07-09 00:26:47",
                    "replies": [
                        {
                            "author": "Phekla",
                            "body": "This would only be true if the Singularity somehow happened to have its own interests aligned with the well-being of human beings. However, that would be a weird thing to expect. We do not care much about ants. Why would something that is as superior to us as we are to ants care about us? It is also hardly possible that the Singularity will have the same values and morals as humans.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2020-07-09 04:23:43",
                            "replies": [
                                {
                                    "author": "steroid_pc_principal",
                                    "body": "I should correct myself, I don't think AGI is necessary for AI to become extremely useful. Even the AI today could become a powerful arm of a (benevolent) dictator.\n\n> It is also hardly possible that the Singularity will have the same values and morals as humans.\n\nYes, this is an active area of research right now and you're right the answers are pretty fuzzy.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2020-07-09 05:37:37",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}