{
    "post_title": "CMV: Diversity, Equity, and Inclusion hiring and business practices in the workplace are wholly insufficient because neurodiversity and physique are not explicitly taken into account",
    "post_timestamp": "2025-04-08 23:55:57",
    "last_comment_timestamp": "2025-04-10 02:49:08",
    "time_difference": "1 day, 2:53:11",
    "comments": [
        {
            "author": "Funny-Dragonfruit116",
            "body": "Neurodiversity and physique can be impediments to job function in a way than race or sexual orientation aren't.\n\nYou can be gay and frame a house professionally. You cannot be morbidly obese and do the same.\n\nYou can be black and communicate effectively. You cannot be nonverbal and do the same.",
            "score": 8,
            "depth": 0,
            "timestamp": "2025-04-09 00:04:44",
            "replies": [
                {
                    "author": "chris_a_14",
                    "body": "Yeah, obviously there are certain instances where this doesn't work out, but this is a small percentage of occupations.  A large percentage (estimates vary) of those who are neurodiverse are what was previously called \"high-functioning\".  Also, technological advances have made communication possible for some nonverbal people, just as it has made it possible for people with ALS",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-04-09 00:15:34",
                    "replies": [
                        {
                            "author": "Funny-Dragonfruit116",
                            "body": ">Yeah, obviously there are certain instances where this doesn't work out, but this is a small percentage of occupations\n\nYou used a number in your post of \"30-40%\" of people with autism are unemployed. About 30% of people with autism are nonverbal. The numbers overlap perfectly. They are indeed being discriminated against, but it's because they lack the necessary aptitude for employment.\n\nLiterally every job requires some level of communication. I think literally everyone who has made it to the managerial tier of their career would probably tell you that communication is the #1 most important skill in any workplace.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-04-09 00:23:33",
                            "replies": [
                                {
                                    "author": "chris_a_14",
                                    "body": "I agree that communication is key.  Here's an article which suggests the point I'm trying to make: [https://hbr.org/2022/10/stop-asking-neurodivergent-people-to-change-the-way-they-communicate](https://hbr.org/2022/10/stop-asking-neurodivergent-people-to-change-the-way-they-communicate)\n\n  \nWe live in a world where technological solutions exist for many who are nonverbal.  And I'm obviously talking about supporting candidates who are nonverbal but clearly capable of work, who are often discriminated against.  It is difficult to support those who are lower-functioning on the spectrum in the workplace re: communication, I'd imagine.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-09 00:31:37",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Finklesfudge",
                            "body": "Basically what you are asking is companies should be forced to risk it hoping the guy with mental stuff is one of the percentage that are, and will maintain 'high functioning' status.... rather than just hire from the pool of people who have far higher chances of functioning and maintaining?\n\nwould you do that with a plumber? a day care? a Dr?  would you employ one of these since to work on you, your child or home? You are already aware of the higher statistics of not being 'high functioning' at all times?",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-10 02:49:08",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "quigonjen",
            "body": "DEI is often actually DEIA (the “A” is for “accessibility,” which *does* factor in disability and neurodivergence in hiring (and inclusive interview) practices, as well as employment standards. DEIA is often responsible for ADA (or other national disability law) compliance and education. Similarly, DEIA would ensure equal access for Little People/Short-Statured folks or people with any other body type (or neurotype) that would fall under the ADA (I can’t speak to other countries’ law, because my expertise is only regarding US disability policy).",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-04-09 00:04:20",
            "replies": [
                {
                    "author": "chris_a_14",
                    "body": "I'm glad to hear that this exists; however, I'm not necessarily someone who lives under a rock, and I've never heard of DEIA, which suggests to me that its implementation is far too limited as of now.  Is this the case?",
                    "score": -2,
                    "depth": 1,
                    "timestamp": "2025-04-09 00:10:50",
                    "replies": [
                        {
                            "author": "quigonjen",
                            "body": "Different companies and organizations use different abbreviations—in many places, it’s just called “diversity consulting.” In others, it’s “DEI,” and in some others, it’s “DEIA.” But they generally all encompass the same communities—those protected by Civil Rights law. (See: https://builtin.com/diversity-inclusion/what-does-dei-mean-in-the-workplace and https://blog.talentally.com/whats-the-difference-dei-vs-edi-vs-deia-vs-deib-vs-jedi/)",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-09 00:16:18",
                            "replies": [
                                {
                                    "author": "chris_a_14",
                                    "body": "Thanks for this information, this is really helpful.  I wasn't aware of these initiatives.  I'm just glad seeing that these policies exist so that I know that neurodiversity isn't being swept under the rug.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-04-09 00:23:32",
                                    "replies": [
                                        {
                                            "author": "quigonjen",
                                            "body": "Absolutely! Some companies like Microsoft even specifically recruit autistic folks and have specialized hiring processes to help people acclimate to the interview process, spacing it out with breaks to help avoid overwhelm. They found that so many of their best coders were neurodivergent that they wanted to increase recruitment, but realized their interview process was weeding out ND folks. The accessibility team came in and helped reevaluate the process and it completely changed their success rate.\n\nhttps://www.microsoft.com/en-us/diversity/inside-microsoft/cross-disability/neurodiversityhiring",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2025-04-09 00:27:46",
                                            "replies": [
                                                {
                                                    "author": "chris_a_14",
                                                    "body": "This is really great to know, thanks!  Good for Microsoft, and I hope more companies adopt this strategy.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-09 00:32:51",
                                                    "replies": [
                                                        {
                                                            "author": "scarab456",
                                                            "body": "Did u/quigonjen change your view at all?",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-09 03:46:52",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "UncleMeat11",
                                                            "body": "Google does this as well.\n\nBut more companies *won't* be adopting this strategy because the DoJ has decided that any sort of DEI work is unacceptable for government contractors and is threatening to sue companies who do things like this.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-09 07:25:05",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "quigonjen",
                                    "body": "Different companies and organizations use different abbreviations—in many places, it’s just called “diversity consulting.” In others, it’s “DEI,” and in some others, it’s “DEIA.” But they generally all encompass the same communities—those protected by Civil Rights law. (See: https://builtin.com/diversity-inclusion/what-does-dei-mean-in-the-workplace and https://www.aclu.org/news/racial-justice/dei-and-accessibility-explained)",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-09 00:19:41",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TacoTycoonn",
                            "body": "DEI is the common phrase but the accessibility is wildly implemented. To be honest the words Diversity Equity and Inclusion kind of imply accessibility regardless if the A is included or not.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-09 00:18:18",
                            "replies": []
                        },
                        {
                            "author": "Status_Lie_1334",
                            "body": "I work for a very large financial services firm and have heard of DEIA. For us it’s less of an external facing program and more of a hiring and workplace inclusion guideline. Or at least it was. ",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-09 00:19:22",
                            "replies": [
                                {
                                    "author": "chris_a_14",
                                    "body": "Interesting, I didn't know this.  This is good to know.  Maybe it could benefit from being more external?  Not sure how much this ultimately matters though, as long as it exists in some form.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-09 00:24:11",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DoeCommaJohn",
            "body": "I'll be honest, that sounds like making perfection the enemy of progress. If somebody made a DEI admission that favored neurodivergents, a poor or POC person could say that was insufficient because it didn't focus on their discrimination, and then a woman could reject both perspectives. Also, you in no way show why these are tradeoffs. Why do you need to force other groups to suffer in order to raise your group up?",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-08 23:59:59",
            "replies": [
                {
                    "author": "chris_a_14",
                    "body": "That's not what I'm implying.  I'm simply suggesting that current practices are insufficient if they don't also address the more commonly talked about identities like ethnicity and sexual orientation.  Case in point: I've never seen a hiring event focused on neurodiverse applicants; I've seen countless for black applicants.  Both face discrimination in different ways, but both in tangible, proven ways.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-04-09 00:19:34",
                    "replies": []
                }
            ]
        },
        {
            "author": "Nrdman",
            "body": "If it’s enough that you need accommodations, that would fall under DEI. Unsure what you require aside from that",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-09 00:09:54",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "[removed]",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-09 01:18:27",
            "replies": [
                {
                    "author": "changemyview-ModTeam",
                    "body": "Comment has been removed for breaking Rule 1:\n\n> **Direct responses to a CMV post must challenge at least one aspect of OP’s stated view (however minor), or ask a clarifying question**. Arguments in favor of the view OP is willing to change must be restricted to replies to other comments. [See the wiki page for more information](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1).  \n\nIf you would like to appeal, review our appeals process [here](https://www.reddit.com/r/changemyview/wiki/modstandards#wiki_appeal_process), then [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&subject=Rule%201%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because\\.\\.\\.) within one week of this notice being posted. **Appeals that do not follow this process will not be heard.** \n\nPlease note that multiple violations will lead to a ban, as explained in our [moderation standards](https://www.reddit.com/r/changemyview/wiki/modstandards).",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-09 02:59:02",
                    "replies": []
                }
            ]
        },
        {
            "author": "ralph-j",
            "body": "> Diversity, Equity, and Inclusion hiring and business practices in the workplace are wholly insufficient because neurodiversity and physique are not explicitly taken into account\n\nThat depends on the efforts that individual employers place under the \"DEI\" umbrella. It's not a shortcoming of DEI as a concept. There are employers who are hiring through specialized neurodiversity platforms, like neurodiversityjobs.co.uk, auticon.com, specialisterne.com etc.\n\nMany employers also have talent programs that explicitly cover neurodiversity, e.g.:\n\n* https://careers.microsoft.com/v2/global/en/neurodiversity.html\n* https://www.ubisoft.com/en-us/company/careers/neurodiversity\n* https://www.pfizer.com/about/careers/disability-and-neurodiversity-hub\n\nThey usually provide interview processes that have been adjusted to better suit the needs of the candidate. Our company has definitely hired neurodiverse candidates through similar programs.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-09 04:47:18",
            "replies": []
        },
        {
            "author": "Somerandomedude1q2w",
            "body": "DEI also deals with disabilities, not just race or gender. And quite often, a disability can be an impediment to a job. You cannot expect to accommodate someone in a wheelchair if you are hiring a yoga instructor. It could be argued that nobody discriminates against those on the spectrum, because it isn't something you can see. It's something that is behavioral, and human interaction is a huge part in how the world operates. I happen to have ADHD, but it has never affected my ability to be hired, because I don't advertise it and I manage it by myself. Similarly, many people with high functioning autism have the ability to \"fake it\" and can pretend to be neurotypical to a good enough degree that it doesn't affect them during the hiring process. \n\nThe issue with unemployment among those on the spectrum is because they are typically judged by their speech and/or actions. If someone in a wheelchair interviews for a programming position, it is easier to instruct hiring managers to ignore their disability and only concentrate on their code. But human interaction is a huge part of almost any job, and hiring managers also evaluate a candidate based on their perceived ability to fit within the team. This automatically works against many neurodivergent people, and it could be argued that the bias against them is similar to a \"bias\" against disabled people when hiring yoga instructors.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-09 09:23:45",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "> We as a society have simply decided that treating people who deviate too far from the \"ideal\" physique as being \"beneath\" is acceptable.\n\nWell, yes? You have \"issues\" compared to the norms that could affect your work or aspects of your work. DEI does not necessarily have that. To accommodate DEI, all you have to do is establish **fairness and politeness**, at least in general. To accommodate neurodiversity though? You'd need different processes especially given how, well, diverse, the results of neurodiversity could be. Even something like dyslexia can vastly affect work process compared to like... being PoC. The PoC works, in theory, exactly the same as a white person. A neurodivergent does not (or at least does not always).",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-09 00:01:14",
            "replies": []
        },
        {
            "author": "colt707",
            "body": "I’m autistic and have had zero issues getting a job once. So who’s right? Me or you?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-09 00:01:02",
            "replies": [
                {
                    "author": "chris_a_14",
                    "body": "It's not about being right or wrong.  It's about identifying discrimination that is factually occurring in the workplace and in society in general.  I'm glad you've found employment, but 30-40% of those who are neurodiverse do not succeed in doing so, many of whom are high-functioning.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2025-04-09 00:17:30",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "You are not benefitting from DEI as much as youd like to, but you are benefitting. The ADA, which is DEI legislation, was a massive achievement for people with disabilities. It prohibits discrimination and mandates accommodations:\n\n> Employers must provide people with disabilities an equal opportunity to benefit from the employment-related opportunities available to others. This includes things like recruitment, hiring, promotions, training, pay, and social activities.\n\nThat is DEI. It is legislation that requires equity and inclusion for people with disabilities. Neurodiversity is explicitly taken into account, so if it is insufficient that’s not the reason why.\n\nAs far as height and looking young discrimination, I think it’s pretty clear that these issues are far less severe than racism or sexism, if they exist at all. There has never been systemic discrimination against adults who look young. It makes sense to prioritize the most pressing problems.\n\nSpeaking of, that 30-40% unemployment rate includes people who are nonverbal and unable to eat on their own. A job may not be the best way to improve those peoples’ lives",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-09 01:27:00",
            "replies": []
        },
        {
            "author": "Even-Ad-9930",
            "body": "I am against DEI in the workplace entirely. Even accepting people of different race, gender etc who are not as qualified is wrong. \n\nThe person is who is the most qualified for a role should be given the job in all cases, no exceptions. \n\nIf your neurodiverse behavior make you less effective at any role than someone who is not then I would hire the person who is more effective. I do not mean any offense but it does not make sense for me to hire someone who is less efficient at the same price. I could hire you because I want to parade you around as a token of look we as a company care about neurodivergent people but if the work output is not at the same level then that is all you will be useful for at my company",
            "score": -1,
            "depth": 0,
            "timestamp": "2025-04-09 00:26:24",
            "replies": [
                {
                    "author": "Nrdman",
                    "body": "You seem to have a very narrow view of what DEI is. Accepting applicants on the basis of race or gender has been illegal since [1964](https://en.m.wikipedia.org/wiki/Civil_Rights_Act_of_1964)/[1972](https://en.m.wikipedia.org/wiki/Equal_Employment_Opportunity_Act_of_1972). Race based hiring is not what DEI is.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-09 01:05:33",
                    "replies": [
                        {
                            "author": "Even-Ad-9930",
                            "body": "But there are companies even today, which have made claims such as they will make sure that 50% of their employees are going to be women or 50% will be from minorities, etc type claims. \n\nI am in general against that. \n\nI agree that policies should implemented to solve issues which are affecting certain races like giving them better access to education, better family presence but race based hiring is an actual thing done in companies with the hopes of giving them a better future and it is not a good idea",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-09 01:38:08",
                            "replies": [
                                {
                                    "author": "Nrdman",
                                    "body": "Often that involves just making sure you are reaching a diverse pool of applicants. Like for a job that gets significantly more male applicants, you can put some effort in advertising the job in more female centered spaces/media. For most fields there’s not a big distinction in ability gender wise, so just by increasing the diversity of the pool and picking the best candidate every time, you lead to a more diverse workspace. \n\n\nThis is not gender based hiring. Are you against the above?\n\n\n\nIf you can prove race based hiring, I suggest applying there and then suing, because that is illegal (except I think for companies under 15 employees, reading the 1972 act, dunno if the size requirement has been changed)",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-09 01:43:57",
                                    "replies": [
                                        {
                                            "author": "Even-Ad-9930",
                                            "body": "[https://freebeacon.com/latest-news/just-6-percent-of-new-sp-jobs-went-to-white-applicants-in-the-wake-of-george-floyd-analysis-shows/](https://freebeacon.com/latest-news/just-6-percent-of-new-sp-jobs-went-to-white-applicants-in-the-wake-of-george-floyd-analysis-shows/)\n\nOne example would be this, out of 320,000 new jobs 300,000 of them were to people of color. I don't have the specific evidence and details about this. But I suspect that the companies were specifically targeting and hiring minorities which led to such a result",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-09 01:52:01",
                                            "replies": [
                                                {
                                                    "author": "Nrdman",
                                                    "body": "Can you answer my previous question?\n\n\n\n\nAnd if they hired based on race that would be illegal, not a DEI policy. Or I guess it could be an illegal dei policy, but people tend to avoid writing down illegal stuff",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-09 01:59:39",
                                                    "replies": [
                                                        {
                                                            "author": "Even-Ad-9930",
                                                            "body": "I am supportive of advertising the job in female centered spaces/media. I do not think that is discrimination. \n\nI don't know how exactly they did that, I am guessing it was not a written policy but rather they led a DEI initiative and maybe advertised some roles only in female or black centered media/spaces which led to the applicant pool being mainly them and then they hired them. I get they can artificially impact the applicant pool to have more people of whatever race they want by marketing there. \n\n  \nMy point remains that these practices of reverse discrimination are real \n\n[https://www.prweb.com/releases/resumebuilder-com-survey-reveals-1-in-6-hiring-managers-have-been-told-to-stop-hiring-white-men-805188091.html](https://www.prweb.com/releases/resumebuilder-com-survey-reveals-1-in-6-hiring-managers-have-been-told-to-stop-hiring-white-men-805188091.html)",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-09 02:11:11",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Snake_Eyes_163",
            "body": "How about we forget all of it and hire the best candidate for the job. If you’re not a fit for the position, get better and apply again.",
            "score": -1,
            "depth": 0,
            "timestamp": "2025-04-09 00:17:50",
            "replies": [
                {
                    "author": "Nrdman",
                    "body": "You seem to have a very narrow view of what DEI is. Accepting applicants on the basis of race or gender has been illegal since [1964](https://en.m.wikipedia.org/wiki/Civil_Rights_Act_of_1964)/[1972](https://en.m.wikipedia.org/wiki/Equal_Employment_Opportunity_Act_of_1972). Race based hiring is not what DEI is.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-09 01:08:13",
                    "replies": [
                        {
                            "author": "Snake_Eyes_163",
                            "body": "The minute a department sets a quota of how many people they need from different backgrounds they’re not putting merit first in their decision to hire. They’re checking boxes. \n\nIt is possible they hire the same exact people without the quota but it’s unlikely. When this happens in a field where peoples’ lives are at stake it’s downright irresponsible not to hire the best people for the job. For medical fields, pilots, and air traffic control, diversity be damned, hire the most qualified person every time regardless of race.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2025-04-09 07:39:14",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FarConstruction4877",
            "body": "How about this. No diversity or inclusion hiring practices, simply hire the best person for the job. Do otherwise and get best out by a competitor who wired someone better for cheaper. Anarchy. Does not discriminate against anyone.",
            "score": -1,
            "depth": 0,
            "timestamp": "2025-04-09 00:35:02",
            "replies": [
                {
                    "author": "Nrdman",
                    "body": "You seem to have a very narrow view of what DEI is. Accepting applicants on the basis of race or gender has been illegal since [1964](https://en.m.wikipedia.org/wiki/Civil_Rights_Act_of_1964)/[1972](https://en.m.wikipedia.org/wiki/Equal_Employment_Opportunity_Act_of_1972). Race based hiring is not what DEI is.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-09 01:08:18",
                    "replies": []
                }
            ]
        },
        {
            "author": "VortexMagus",
            "body": "So instead of people taking a half step towards the place you want them to be, you'd rather they take a full step back instead?\n\nBecause many - not all - DEI programs did in fact have ways to help neurodivergent people. And even if they're not your specific version of neurodivergence, it was a significantly bigger step than none at all.",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-04-09 00:19:09",
            "replies": [
                {
                    "author": "chris_a_14",
                    "body": "I never suggested to get rid of DEI policies, I'm just suggesting that these policies should be far more comprehensive.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-09 00:25:47",
                    "replies": []
                }
            ]
        },
        {
            "author": "InterestingChoice484",
            "body": "We can't legislate to protect everyone's insecurities",
            "score": -2,
            "depth": 0,
            "timestamp": "2025-04-09 00:06:42",
            "replies": [
                {
                    "author": "chris_a_14",
                    "body": "These aren't insecurities.  Height discrimination in the workplace, for example, is real.  Please refer to this article for more information: [https://www.bbc.com/worklife/article/20220825-height-discrimination-how-heightism-affects-careers](https://www.bbc.com/worklife/article/20220825-height-discrimination-how-heightism-affects-careers)",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-09 00:12:49",
                    "replies": [
                        {
                            "author": "InterestingChoice484",
                            "body": "DEI programs for things like gender and race are under serious threat and you want to add height? Good luck",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-04-09 00:27:21",
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}