{
    "post_title": "What are your thoughts on recent reports about CBP increasing secondary screenings and using AI to analyze travelers’ digital activity?",
    "post_timestamp": "2025-03-29 01:15:52",
    "last_comment_timestamp": "2025-04-04 11:57:54",
    "time_difference": "6 days, 10:42:02",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Please use [Good Faith](https://www.reddit.com/r/AskConservatives/comments/107i33m/announcement_rule_7_good_faith_is_now_in_effect) and the [Principle of Charity](https://en.wikipedia.org/wiki/Principle_of_charity) when commenting. We are currently under an indefinite moratorium on gender issues, and anti-semitism and calls for violence will not be tolerated, especially when [discussing the Israeli-Palestinian conflict](https://www.reddit.com/r/AskConservatives/comments/17ygktl/antisemitism_askconservative_and_you/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskConservatives) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-03-29 01:15:53",
            "replies": []
        },
        {
            "author": "SeaTeach9760",
            "body": "The irony of so called conservative answers approving purity tests for immigrants not unlike china’s social credit system…\n\nNo qualms from me lol but we should at least be honest about what we want",
            "score": 17,
            "depth": 0,
            "timestamp": "2025-03-29 07:42:25",
            "replies": [
                {
                    "author": "BoNixsHair",
                    "body": "The major difference is that China has a social credit system for their citizens.  That’s not what we’re talking about here.  This question is about screening foreigners at the border.  Americans have a nearly unlimited free speech.  Foreigners do not have an unlimited right to come here.  The conditions under which we admit someone should be restrictive.\n\nUnder Biden, we let Hamas members in the country and we didn’t do any screening.  This isn’t he most elegant thing but it’s something.  Something is better than nothing when it comes to border security.",
                    "score": -3,
                    "depth": 1,
                    "timestamp": "2025-03-29 10:57:26",
                    "replies": [
                        {
                            "author": "SeaTeach9760",
                            "body": "That’s all well and good but let’s not kid ourselves—this is still the same government who spies on American citizens and justifies it with “we’re preventing terrorism”. Same government who invaded Iraq under the pretense of WMD in front of the world when it’s about killing Saddam Hussein, whose absence led to the collapse of the Iraqi state and gave birth to ISIS. Soldiers dead because of the government lying to go to war.\n\nWhy the hell do people suddenly become very trustful of them when the government says “oh, we deported him because he’s a member of Hamas” or “we’re deporting this PhD student because she’s a Hamas sympathizer”. To what extent does their use of AI is limited to those who harbor hostile intentions against America? To foreigners only, or even just from “those countries”? Better yet, how does one control the government to *objectively* define “hostile intentions” without overstepping its boundaries?\n\nAgain, and I want to make this very clear to everyone: let’s be honest about your stance on immigration. If we want to see purity tests so be it, but do not ever think it’s anything different than China’s own **totalitarian** system. It deprives people of their liberty just because they *think* differently.",
                            "score": 16,
                            "depth": 2,
                            "timestamp": "2025-03-29 12:03:23",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "Thank you for your intellectual honesty. Seems like I don't see enough of that anywhere these days.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-04-01 10:44:11",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "nicetrycia96",
            "body": ">Some recent news and posts suggest agents are asking political questions at border crossings. How do you view this in terms of national security, privacy, and government overreach, or freedom of speech?  \n  \n  \nFor instance, there have been instances where travelers were asked about their political views, and their electronic devices were searched for political content including keywords about Trump, Vance; and Musk. ￼ ￼\n\nDo you have any sources to this claim? Neither of the sources you posted mentions this.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-04 11:57:54",
            "replies": []
        },
        {
            "author": "Gaxxz",
            "body": "\"Absences over six months raise suspicion\"\n\nThis isn't about politics. As you know, if a green card holder is out of the country for more than six months, they risk losing their visa. Green cards are supposed to be for residents, after all. If you have a green card, don't stay away for more than six months and you won't have to worry. And definitely don't sign anything the border officer gives you without understanding it.",
            "score": -2,
            "depth": 0,
            "timestamp": "2025-03-29 10:56:45",
            "replies": [
                {
                    "author": "BrendaWannabe",
                    "body": "What's this have to do with political affiliation questions?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-03-29 19:34:32",
                    "replies": [
                        {
                            "author": "Gaxxz",
                            "body": "OP made that claim. Neither linked source mentions that.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-03-29 19:49:59",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "she_who_knits",
            "body": "Since there have been two failed assassination attempts as well as intel on Iraq funding for more assassination attempts, I am perfect comfortable with CBP scanning all incoming visa holders electronics.",
            "score": -1,
            "depth": 0,
            "timestamp": "2025-03-29 17:57:52",
            "replies": []
        },
        {
            "author": "BAUWS45",
            "body": "Good? I don’t know why we should let people come in then say they hate our country and protest.",
            "score": -12,
            "depth": 0,
            "timestamp": "2025-03-29 05:03:41",
            "replies": [
                {
                    "author": "Lugards",
                    "body": "Especially given what supporters here have said regarding Europe/canada and their leaders/politics, would you be ok with MAGA tourists/visa/whatever holders having their phones searched in Europe/canada and deported for posting bad things about Europe?",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2025-03-29 12:38:34",
                    "replies": [
                        {
                            "author": "BAUWS45",
                            "body": "If Americans were going to Europe and protesting the European govt, yeah kick them out, it’s not their govt to protest.",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2025-03-29 14:00:21",
                            "replies": [
                                {
                                    "author": "Lugards",
                                    "body": "What about all of  the American missionaries who go to protest abortion overseas?   Should they be removed for protesting the government?",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2025-03-29 15:31:12",
                                    "replies": [
                                        {
                                            "author": "BAUWS45",
                                            "body": "Yes",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-03-29 15:37:57",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ixvst01",
                    "body": "So why does the U.S. government describe it as authoritarian and anti-free speech when the Chinese government checks phones and social media of incoming visitors for anti-government content?",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-03-29 15:55:28",
                    "replies": []
                }
            ]
        },
        {
            "author": "BoNixsHair",
            "body": "I am in favor of border patrol actually protecting the border.  For far too long we have let anyone in the country, no matter their views. We let the 9-11 hijackers into the country without screening them at all.  And we didn’t learn anything from that.  We are letting Hamas supporters in the country and giving them visas.\n\nYou won’t hear anything from me about our country finally making a tiny bit of an effort to screen people before letting them in.",
            "score": -6,
            "depth": 0,
            "timestamp": "2025-03-29 06:47:22",
            "replies": [
                {
                    "author": "Raveen92",
                    "body": "I think AI is not good enough at this time for widespread use, more so for more sensitive things. It cannot tell sarcasm from actual statements. And as an AI tutor... I break AI all the time, and it can be pretty easy to make it ignore pre-set instructions. Hell it will break itself at times.\n\nIt still needs a human overlook to filter over and double check any AI work for accuracy.\n\nExample, I can say \"I love CP predators going to jail.\" And it can focus in on that first part of the statement and assume I am a fan of disgusting material. That is how obtuse AI can be at this time.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-03-29 12:54:07",
                    "replies": []
                }
            ]
        }
    ]
}