{
    "post_title": "The future of work - the gig economy, artificial intelligence",
    "post_timestamp": "2018-03-29 13:45:03",
    "last_comment_timestamp": "2018-04-01 01:46:18",
    "time_difference": "2 days, 12:01:15",
    "comments": [
        {
            "author": "Deleted",
            "body": "so this ties into universal basic income.  universal basic income isn't FI.  it's going to be barely enough to live off of (think current welfare system).  \n\nsure, small controlled studies show people on UBI will still work and increase their productivity due to not having to worry about expenses.  but if you apply that on a big enough level, there isn't going to be housing, jobs, whatever to go around.  so then it will create inflation and we're no better off than we started.  \n\nonce AI and robotics wipes out the industry for basic, repetitive, non cognitive jobs.  there's gonna be the \"working\" class of people and then there's the people dependent on UBI that become \"unemployable\" as jobs get more and more specialized and more technical training is required.  \n\npeople who will \"work\" will need to start their training at a very young age.  and there's just simply not enough supply/demand for people to \"find out what they love and want to do.\"  if you want to be a doctor, you'll go into doctor training at a young age, maybe even starting in high school.  to get into these programs, you apply and face competition harder than getting into ivy leagues.  \n\nso the vast majority of people are going to be unemployed and unemployable and just living on UBI.  it'll likely be something akin to that movie dredd where people live in huge housing blocks that are basically ghettos and no where near as glamorous as what people are representing.\n\nthoughts otherwise?",
            "score": 14,
            "depth": 0,
            "timestamp": "2018-03-29 14:00:12",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "I see no reason why there isn't enough wealth in this country to provide everyone with a basic level of housing, healthcare, education, and sustenance. Maybe not right this instant but if machines do end up taking over 90% of labor then there definitely will be. It's just a matter of distributing it. This doesn't necessarily \"cause inflation.\" Want more, work more seems fine to me. \n\nI really think that if we achieve a post-scarcity society, then we will need to think beyond capitalism since a lot of capitalist ideas simply won't apply or will cease to work. Say what you will about capitalism but I do not think it is some immutable natural law of human behavior. It is an ideology, a system, that works given a certain set of constraints like the ones we have on earth today.\n\nI think you can envision all of the \"UBI housing\" as futuristic projects/slums full of shitty people, but those places are called \"traps\" for a reason. If everyone has the resources to move freely, no good, rational person would choose to continue living in a trap/hood/project/ghetto/slum. People would likely self-organize into like-minded communities (kinda how they do on facebook/reddit, now there's a scary thought with it's own set of issues). If you get a \"bad apple\" that moves into your community there can be democratic processes to remove them, or you can move yourself away. Like how mods ban trolls. Holy fuck the more I think about this, it might actually be scarier than the Dredd version of the future. Everyone lives in their idyllic echo-chamber safe-space bubbles and if you don't fit in you get kicked out by a futuristic HOA. Lol. Now THAT could be a good black mirror episode.\n\nWhy do you assume early hyper-specialization? Machines are *great* at being hyperspecialized, and humans are better at generalized problem-solving and big-picture thinking. Why would you need to start studying to be a doctor at age 7 when there is a specialized machine that can do 90% of every routine surgery there is? Instead humans will need to take a more generalized, integrative approach to learning. Then as a doctor, you will be spending your time thinking about how you can get a machine to do a rare or specialized technique that there isn't already a machine for, or solving more systemic issues that bleed over into other disciplines, like how epidemiology has strong social, psychological, and cultural factors, and how you might approach those to reduce suffering. Things that are strictly human in nature, things that require wrestling with human value systems.\n\nI definitely think that during the TRANSITIONAL period there may be a hyper-stratification of society into the rich elites and a huge underclass of poor. Whether that is a stable state for society depends on how truly well-suited UBI is to satiating human needs and desires.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2018-03-30 13:09:44",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "There already is enough wealth for everyone to live comfortably.  It's just not distributed.  Communism China attempted to distribute it and have everyone become productive.  It failed.  \n\nIn your world where people have the resources to move freely assumes that there is enough supply of homes.  If there are big homes and small homes everyone will want the better homes.  Which by itself creates a supply problem.  Those dependent on UBI will be priced out and not able to freely move as you imagine.  \n\nThere are four basic classes of labor.  \n\nRepetitive, non cognitive.  Such as assembly line workers.  Easy for robots to replace.  \n\nRepetitive, cognitive.  Your surgeon bit would fall under here.  It's basically the same thing every time but you have to factor in some differences.  This would also be a self driving car. \n\nNon repetitive, non cognitive. Bookkeeping, clerical, some forms of lawyers.  \n\nNon Repetitive, cognitive.  Science, some forms of law, engineering etc.  \n\nHumans are good at the last one.  That's the general problem solving and critical thinking.  \n\nThe doctor who needs to think about how to get a machine to do a rare and specialized surgery would need to start training early on to learn both the medicine aspect and engineering aspects to design such a thing.  \n\n",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2018-03-30 14:30:45",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "barchueetadonai",
                    "body": "This will only be the case if the government can’t figure out how to distribute the created value from the extra productivity.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2018-03-29 18:24:23",
                    "replies": [
                        {
                            "author": "this1_isnt_taken",
                            "body": "When have they ever managed that?",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2018-03-30 13:43:03",
                            "replies": [
                                {
                                    "author": "barchueetadonai",
                                    "body": "Normally the most problems arise from people trying to *stop* the government from effectively carrying out things that are much naturally suited to being public goods/services.",
                                    "score": -1,
                                    "depth": 3,
                                    "timestamp": "2018-03-30 13:55:29",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "[deleted]",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2018-03-29 17:27:34",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "[deleted]",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2018-03-29 18:33:58",
                            "replies": [
                                {
                                    "author": "SteveRD1",
                                    "body": "Not to mention the process has only barely started for Cashiers.  \n\nSupermarkets and Fast Food joints will reduce employment numbers dramatically in the next 10 years tops.\n\nShelf stackers in retail stores will be needed less and less as 'retail' see more inventory remote (i.e. Amazon, or some kind of go to  a store to experience a good and it gets shipped to you)\n\nLots more jobs to get wiped out yet!",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2018-03-29 18:54:35",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Deleted",
                            "body": "Somewhat but not as impactful as what's yet to come.  ",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2018-03-29 18:07:39",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "_neminem",
                    "body": ">  there's gonna be the \"working\" class of people and then there's the people dependent on UBI that become \"unemployable\" as jobs get more and more specialized and more technical training is required. \n\nI agree with the former, but totally disagree with the latter. With UBI, there would definitely be two very distinct classes of people, those with jobs, and those without. On the flip side, it would be *way* easier for someone to look into getting the necessary training for whatever job they might want, if they don't have to juggle that against their obligations of an existing job if they don't want to starve!",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2018-03-29 14:53:18",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "once AI and robotics takes away all the low skill jobs.  exactly how much training do you think someone will need to reskill for another job?  \n\ni'm thinking that the available jobs in the future with AI and robotics is going to be so technical that reskilling will basically be impossible.  lets just look at the current people who's jobs have been lost to automation and understand exactly just how hard it is to retrain for a highly technical job.  ",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2018-03-29 14:57:01",
                            "replies": [
                                {
                                    "author": "_neminem",
                                    "body": "I'm not saying everyone would be able to do those jobs. The number of people who could potentially learn those skills would be the same as the number that could potentially learn those skills *now*. My point is, you'd have a lot more people *actually* trying to learn more technical skills once they didn't have to try to learn them while also working their mind-numbing, soul-crushing minimum wage job at the same time.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2018-03-29 15:28:56",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "And I'm gonna counter that there isn't enough supply/opportunities for everyone to learn skills they want to learn.  It's like going to college.  Not everyone can go.  Training will cost money they don't necessarily have.  And they will apply for training with limited openings.  \n\nEven those coding bootcamps are very hard to get into with low double digit acceptance rates. \n\nSure yes they'll have the time to learn new skills they want to learn.  But will they have the opportunities? ",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2018-03-29 16:55:26",
                                            "replies": [
                                                {
                                                    "author": "_neminem",
                                                    "body": "Will they have the opportunity? Maybe, maybe not. But that's no *worse* than now, either. ",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2018-03-29 17:26:23",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "Right exactly.  So ubi isn't this miracle that people are touting it to be.  People are touting ubi to be a miracle cure.  I'm under the impression it won't change a thing and it basically becomes the new welfare.  ",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2018-03-29 18:07:01",
                                                            "replies": [
                                                                {
                                                                    "author": "_neminem",
                                                                    "body": "Well yeah, it's exactly like welfare, except without nearly as much of the stigma, and without the fiddly wacky edge cases where you aren't allowed to do work, or you lose your benefits and end up even worse off. It's not a miracle cure for *everything*, but it would certainly make things universally better for everyone if implemented properly, over the alternative where there aren't enough jobs to go around, and poor/unlucky people can just suck it.",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2018-03-29 18:12:33",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Deleted",
                                    "body": "The call centers of the future will be people operating drones to carry out tasks off world. \n\nI'm absolutely certain Google's put engineering time into building datacenters on the moon, and logistics companies have to be looking at it too. Commercial space travel will follow the path of commercial air travel, accessible because of the cargo network commercial passengers don't see. Every warehouse, dwelling, and powerplant built will need a drone operator, and teaching you how to use *this model* of drone will just be on the job training. \n\nHIghly paid people of the future will have developed skills in a particular industry. Drone operators with geology degrees who understand how to find good build sites. Architectural designers who understand exometorology well enough to incorporate those design features into the luxury housing market. (Luxury goods and services are usually safe.) Drone operators who understand logistics best practices to keep a warehouse with no human staff running. \n\nIt takes a while before technical capability becomes cheap enough to really compete with human labor. Sometimes, it's cheaper to pay 15 people to stare at a screen and push a button if \"something weird\" happens, and those jobs will always exist.\n\nFor those times when throwing cheap human labor at a problem is the most economical, we'll have apps and platforms that allow people to throw their labor into that pool on their own schedule. Rather than eating out at the end of a week, you might schedule a professional chef who specializes in your wife's favorite ethnic cuisine and it'll be as easy as getting an Uber.\n\nAI and robotics are just tools. Adapt and learn how to use them as they become relevant to your industry and you'll be fine. ",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2018-03-29 18:31:30",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "flamethrower2",
                    "body": "Inflation is possibly a myth. Inflation in Alaska decreased after they started their UBI-like permanent fund. It was tried in Kuwait and inflation decreased.\n\nThe biggest argument against UBI for the United States is it is very different than what we're used to and for this reason I don't think people will go along with it. It's not within the realm of the politically possible.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2018-03-29 19:09:30",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "i assume you're refering to this article?  \n\nhttps://medium.com/basic-income/evidence-and-more-evidence-of-the-effect-on-inflation-of-free-money-a3dcc2a9ea9e\n\nall they did in that article was state they gave money to people, and here's what happened to inflation.  \n\nit's hard to conclude a cause and effect.  ",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2018-03-29 20:07:53",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "istareatscreens",
            "body": "I suspect there will be variety of futures, with some countries taking differing approaches:\n\n1) Corporation led nations. Elite get richer, middle classes work harder/longer, poor go die or get to play with toys/drugs to keep out of the way of the elites.\n\n2) Enlightened democracies. Legislate maximum working hours down over time so that work must be shared around rather than horded. People have more free time. Study / further education becomes more of an option post age 21. Retiring at 40 to go back to University becomes a thing. More people studying helps science progress,etc,etc.\n\n3) Deniers. Tax those with jobs to subsidize fake jobs for those who wouldn't otherwise have them.\n\nI suspect option 1 and 3 are the most likely and then maybe something horrible happening as a result.",
            "score": 4,
            "depth": 0,
            "timestamp": "2018-03-29 17:08:05",
            "replies": [
                {
                    "author": "MedPhys16",
                    "body": ">Study / further education becomes more of an option post age 21. Retiring at 40 to go back to University becomes a thing. More people studying helps science progress,etc,etc.\n\nThis is just fantasy. We already have a shortage of doctors in america. Further remove the financial incentive and that will become worse. There are not enough people that will willingly spend 13 years of their life to become a doctor if the financial upside isn't there.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2018-03-30 15:58:00",
                    "replies": [
                        {
                            "author": "Easih",
                            "body": "the shortage of doctor isn't because not enough people wants to be doctor but because college are limiting the number of place at medical school.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2018-04-01 01:46:18",
                            "replies": []
                        },
                        {
                            "author": "istareatscreens",
                            "body": "Maybe for specialized areas like doctors the scarcity would lead to even higher pay as a reward? \n\nHowever, I was actually talking about degree/masters or maybe even PHD type study. I suspect there are many people with a lot of very valuable experience who could make a huge contribution to academic research if they could only just afford to and had the time to go back and do so. ",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2018-03-31 16:19:46",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ivigilanteblog",
            "body": "Joke's on you guys. I'm already artificially intelligent.",
            "score": 2,
            "depth": 0,
            "timestamp": "2018-03-29 20:45:02",
            "replies": []
        },
        {
            "author": "NiceAsRice1",
            "body": "I think if it ever gets to the point where a good percentage of basic jobs are gone, the corporations that have an X amount of percentage work done through robots will have to pay some type of extra tax or something, which will be distributed to UBI for people. \n\nThe amounts people would get would depend on HCOL/LCOL areas and I do think would have the potential to end homelessness at the very least. \n\nIt should definitely make most products cheaper in the long run because companies would be saving money due to the automation.",
            "score": 1,
            "depth": 0,
            "timestamp": "2018-03-29 21:31:28",
            "replies": [
                {
                    "author": "MedPhys16",
                    "body": ">It should definitely make most products cheaper in the long run because companies would be saving money due to the automation.\n\nCompanies charge what the market can bear. Not a fixed % of whatever it costs them to make something. If you can sell something to someone for $10, you aren't going to leave money on the table and sell it to them for $5",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2018-03-30 15:59:17",
                    "replies": [
                        {
                            "author": "NiceAsRice1",
                            "body": "That's true, but in a free market, companies will make a profit for as much as they can; but, if all of them are making higher profits, I would imagine companies will start to undercut other companies to gain an edge over others. \n\nI'd imagine companies would love to do what Walmart does when it comes to undercutting for profit, but they can't compete because they simply can't make a profit and undercut them like Walmart can. ",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2018-03-30 19:13:00",
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}