{
    "post_title": "Why are most AI voices women's voices?",
    "post_timestamp": "2024-06-01 07:18:52",
    "last_comment_timestamp": "2024-10-28 07:12:06",
    "time_difference": "148 days, 23:53:14",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "If this submission above is not a random thought, please report it.\n\n  \n# Explore a new world of random thoughts on our [**discord server**](https://discord.com/invite/8tEqw3ZWQV)! Express yourself with your favorite quotes, positive vibes, and anything else you can think of!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RandomThoughts) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 07:18:53",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "There will be some market research/focus group testing floating around saying that’s what people prefer",
            "score": 108,
            "depth": 0,
            "timestamp": "2024-06-01 07:27:42",
            "replies": [
                {
                    "author": "wade_wilson44",
                    "body": "This is true. \n\nIt heavily depends on the use case, but these companies are directly playing into existing stereotypes and biases. \n\nIf you want something that’s simply helpful, it’s going to be a woman. Men don’t respond well to men and women are relatively impartial in these studies (I don’t have stats, but I was a small part of running private studies years ago). So in any case where it’s pretty open ended, or has a flavor of simple companionship, and you can only afford or start with one voice, it’s gonna be a woman because that is more acceptable to more people. \n\nThis leans harder as you get into specific cases, but it’s pretty predictable. If it’s a work out/physical use case, it’s gonna be a man. Men will rarely trust a woman in this use case, and women, again, are relatively impartial. But if you only want one voice it’s gonna be a man.\n\nIf you want something more formal and informative, not necessarily helpful then again you’re going to get a man, but more like a professor than a drill sergeant. My guess is a male voice sounds more confident whether or not it’s actually giving the right answer lmao.\n\nIf you’re talking about any kind of sensitive topics like mental health, sexual health, etc it’s gonna be a woman. Women’s voices come across as much more empathetic and caring. \n\nNow, I’ve gotten some heat for saying these things before, but it’s truly what I experienced in the studies. It is not a reflection of right/wrong, it’s a reflection of existing biases. You could, and we all probably should, start saying we should break the gender stereotypes rather than reinforce them with AI. But that’s just not the goal right now for most businesses. The goal is to grow, and playing into expectations is the smoothest way to do that. Once established, and ai is a norm, maybe we can break down barriers with it.",
                    "score": 27,
                    "depth": 1,
                    "timestamp": "2024-06-01 18:55:54",
                    "replies": []
                }
            ]
        },
        {
            "author": "astring9",
            "body": "To me they're also clearer. I find low-pitched voices sometimes very hard to hear clearly.",
            "score": 65,
            "depth": 0,
            "timestamp": "2024-06-01 09:29:06",
            "replies": [
                {
                    "author": "quarantineinthesouth",
                    "body": "This makes a lot of sense. I read somewhere humans have developed to immediately notice high-pitched sounds(like a baby crying), and that they can listen to them easier.\n\nBasses and guitars are a good example. Traditionally, the guitar stands out the most to most people. And listening to the bass with crappy speakers is much harder than listening to the guitar on the same crappy speakers.",
                    "score": 13,
                    "depth": 1,
                    "timestamp": "2024-06-01 12:21:14",
                    "replies": []
                },
                {
                    "author": "judicioussediment14",
                    "body": "Low-pitched sounds can sometimes be difficult to hear, especially in noisy environments or when there is background noise. This is partly because low frequencies are more easily masked by other sounds. In this case, it can help to have the speaker speak louder or repeat what they are saying🤷‍♀️🤷‍♀️",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-06-01 20:41:51",
                    "replies": []
                },
                {
                    "author": "nofun-ebeeznest",
                    "body": "Same. For awhile, I changed my Echo device to use the male version and I had a lot more trouble understanding it so I switched back to the default voice.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-06-01 16:29:57",
                    "replies": []
                }
            ]
        },
        {
            "author": "KeptinGL6",
            "body": "Science has shown that all humans, regardless of sex or sexual orientation, respond more strongly to female voices than male ones.",
            "score": 50,
            "depth": 0,
            "timestamp": "2024-06-01 08:27:13",
            "replies": [
                {
                    "author": "Mindofmierda90",
                    "body": "Unless directives are being given.  In New York, it’s a male voice that gives orders “stand clear of the closing doors!”",
                    "score": 34,
                    "depth": 1,
                    "timestamp": "2024-06-01 10:31:34",
                    "replies": []
                },
                {
                    "author": "Juntubre22",
                    "body": "Except for books on tape",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2024-06-01 10:00:33",
                    "replies": []
                },
                {
                    "author": "jemuzu_bondo",
                    "body": "I guess it depends what is meant by \"respond more strongly\". Studies have shown that people elect men with deeper voices, and men with deeper voices also get better wages and more easily promotions.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-06-01 12:22:36",
                    "replies": []
                },
                {
                    "author": "skippy_1037",
                    "body": "This raises the question of accent as well where it is predominantly the American accent with something like default siri adopting the valley girl American accent. What gives?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-06-01 18:58:24",
                    "replies": []
                },
                {
                    "author": "AylwinJoshua",
                    "body": "This is true that's why emergency warnings for pilots even in military jets are voiced by females",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-06-01 22:44:59",
                    "replies": []
                },
                {
                    "author": "Better_Ad2013",
                    "body": "Probably because in female for 9 months? The eternal feminine leads us aloft...",
                    "score": -22,
                    "depth": 1,
                    "timestamp": "2024-06-01 08:56:32",
                    "replies": [
                        {
                            "author": "ClaraGilmore23",
                            "body": "umm.. anyway look at this dog as a reward for not scraping ur eyes out after reading that <3\n\n![gif](giphy|QvBoMEcQ7DQXK|downsized)",
                            "score": 11,
                            "depth": 2,
                            "timestamp": "2024-06-01 10:35:24",
                            "replies": [
                                {
                                    "author": "Katharinemaddison",
                                    "body": "Thank you! A good dog.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-06-01 14:32:11",
                                    "replies": []
                                },
                                {
                                    "author": "Deleted",
                                    "body": "Not only did I have to read that, but I had to see a dog too, today is a bad day",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-06-01 13:04:22",
                                    "replies": [
                                        {
                                            "author": "ClaraGilmore23",
                                            "body": "i love dogs :(",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-06-01 13:40:34",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Revelation3-16",
                            "body": "r/MenAndFemales",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2024-06-01 12:14:58",
                            "replies": []
                        },
                        {
                            "author": "LonelyLoser_T-T",
                            "body": "Huh???",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-06-01 12:26:32",
                            "replies": [
                                {
                                    "author": "Better_Ad2013",
                                    "body": "I dont understand either...",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-06-01 12:29:36",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HansNiesenBumsedesi",
            "body": "Siri can be whichever gender you choose.",
            "score": 17,
            "depth": 0,
            "timestamp": "2024-06-01 08:42:37",
            "replies": [
                {
                    "author": "prtypeach",
                    "body": "But the standard one is fem",
                    "score": 17,
                    "depth": 1,
                    "timestamp": "2024-06-01 11:47:18",
                    "replies": [
                        {
                            "author": "HansNiesenBumsedesi",
                            "body": "Mine resets periodically, and it’s just as likely to be male as female.",
                            "score": -5,
                            "depth": 2,
                            "timestamp": "2024-06-01 13:38:29",
                            "replies": [
                                {
                                    "author": "prtypeach",
                                    "body": "Huh, that’s interesting! How’d that happen",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2024-06-01 15:18:16",
                                    "replies": [
                                        {
                                            "author": "skippy_1037",
                                            "body": "Sounds like m8's chatting out of his arse",
                                            "score": 4,
                                            "depth": 4,
                                            "timestamp": "2024-06-01 18:59:02",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "I liked to use the Irish male when I had my iphone, it was the smoothest voice and some pronunciations of street names gave me a good laugh",
                    "score": 10,
                    "depth": 1,
                    "timestamp": "2024-06-01 12:11:02",
                    "replies": []
                },
                {
                    "author": "Ko-jo-te",
                    "body": "Top answer by a long shot. I don't even know anything AI where you can't change the voice. It's like bickering about factory settings not being fine tuned to your preferences.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-06-01 23:23:12",
                    "replies": []
                }
            ]
        },
        {
            "author": "BabyKasica",
            "body": "Same with most car map software, including google maps.\n\nFemale voices are generally regarded as the calmer option, so its deafult for every tts voice need",
            "score": 17,
            "depth": 0,
            "timestamp": "2024-06-01 08:29:25",
            "replies": [
                {
                    "author": "MisterPaintedOrchid",
                    "body": "Idk if it's true, but I've read that the higher pitched female voice is easier to hear against lower pitched road and construction sounds. That might also be true other places -lower pitches would blend into the ambience while higher pitches are more distinct",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-06-01 18:46:23",
                    "replies": []
                }
            ]
        },
        {
            "author": "squatting_your_attic",
            "body": "Because it's a service. It's your little virtual assistant and people are more comfortable having a female assistant.",
            "score": 7,
            "depth": 0,
            "timestamp": "2024-06-01 15:25:06",
            "replies": []
        },
        {
            "author": "MartyMcFlyAsFudge",
            "body": "Men like to be served by women and women aren't particular.",
            "score": 18,
            "depth": 0,
            "timestamp": "2024-06-01 10:49:10",
            "replies": []
        },
        {
            "author": "BariTheRohimba",
            "body": "I will trust a woman giving me instructions any day. They dont guess and try to sound like they know what they are talking about. If a woman gives you info... she is 100% sure.\n\nMen tend to just make noises and ramble a bit. \n\nIn sweden we call it \"killgissa\" - Manguessing",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-06-01 14:08:28",
            "replies": [
                {
                    "author": "Stigbritt",
                    "body": "This answer is true manguessing, something we don't do in sweden.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-06-01 18:22:05",
                    "replies": []
                }
            ]
        },
        {
            "author": "74389654",
            "body": "because women are seen as servants in society",
            "score": 12,
            "depth": 0,
            "timestamp": "2024-06-01 12:37:49",
            "replies": [
                {
                    "author": "Desperate-Swing-7932",
                    "body": "ufffffff I am feeling attacked.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-06-01 16:25:42",
                    "replies": []
                }
            ]
        },
        {
            "author": "Youssef-Elsayed",
            "body": "Fr I want my AI to sound like Paul Bettany or Alan Tudyk",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-06-01 10:00:58",
            "replies": [
                {
                    "author": "SpookyOugi1496",
                    "body": "\"What was I thinking? You were usually so discreet.\"",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-06-01 23:24:09",
                    "replies": []
                }
            ]
        },
        {
            "author": "hawkwings",
            "body": "There are some YouTube videos with AI voices.  I don't know enough to know if women outnumber men.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-06-01 10:34:09",
            "replies": []
        },
        {
            "author": "IntenseYubNub",
            "body": "More soothing and pleasant to hear, generally speaking",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-06-01 11:04:43",
            "replies": []
        },
        {
            "author": "Last_Pay_8447",
            "body": "I worked for a major cell phone company when I was younger. I was a telemarketer. They chose me to record their voice prompts. At the time I thought it was really cool and because I was so good at sales. Later a few guys said it was because I’d make a good sex phone operator.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-06-01 11:15:32",
            "replies": [
                {
                    "author": "CanadianBaconne",
                    "body": "Are 800 sex numbers still around? Imagine AI getting into it. Eventually those doing only fans gonna be mad.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-06-01 16:54:47",
                    "replies": [
                        {
                            "author": "TooStrangeForWeird",
                            "body": "They already have sexting AI, they'll come for phone calls soon enough.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-06-01 18:54:33",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "Built by tech guys who are usually lonely guys and dream of perfect woman whispering to their ear.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-06-01 15:46:00",
            "replies": [
                {
                    "author": "Desperate-Swing-7932",
                    "body": "🤣 sed lyf!",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-06-01 16:26:29",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "eh?",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-06-01 17:27:39",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "rat_fossils",
            "body": "Same reason customer support roles are dominated by women: after a huge amount of trial and error in the industry, they were the ones with the most positive (or least negative) feedback, for whatever reason.\n\n\nConsidering we often speak to customer service when we're angry and upset, it's probably linked to the social expectation of women to be patient, compassionate listeners.",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-06-01 12:46:38",
            "replies": []
        },
        {
            "author": "Kosstheboss",
            "body": "less menacing",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-06-01 12:05:20",
            "replies": []
        },
        {
            "author": "Whut4",
            "body": "Male voices more often come across as arrogant assholes - maybe not even intentionally.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-06-01 13:27:59",
            "replies": []
        },
        {
            "author": "HarleyQueen90",
            "body": "Sexism. But also, I would be terrified if a man’s voice suddenly started speaking while I’m alone at home!",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-06-01 15:10:42",
            "replies": []
        },
        {
            "author": "Ok-Amoeba-1190",
            "body": "S",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-06-01 11:07:07",
            "replies": []
        },
        {
            "author": "CounterSYNK",
            "body": "The ppl who make the ai voices think that women’s voices are less likely to piss you off.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-06-01 12:09:51",
            "replies": [
                {
                    "author": "Equivalent-Willow179",
                    "body": "Shows what they know. I've never smacked a man for talking back to me.",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-06-01 16:47:14",
                    "replies": []
                }
            ]
        },
        {
            "author": "yogfthagen",
            "body": "In the 1980s, the US military made a fighter jet with voice warnings. After a lot of research, the military found that, during high stress, men would ignore male voices, bug they instantly picked up on female voices.\n\nSo, the voice of the fighter jets were female.\n\nIt's why the F/A-18s were called \"Bitching Bettys\"",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-06-01 14:53:33",
            "replies": []
        },
        {
            "author": "dhskdjdjsjddj",
            "body": "In the past, telephone operators (those with the switchboards) used to be almost exclusively female, because their voice could be heard better over the noise.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-06-01 15:04:51",
            "replies": []
        },
        {
            "author": "Aromatic_Note8944",
            "body": "I personally can’t focus on what they’re saying when it’s a man’s voice. I tried changing my iPad voice to a man’s for class work and couldn’t do it for more than 10 min, too distracting.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-06-01 18:46:05",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Why are most pornstars women?",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-06-01 19:01:46",
            "replies": []
        },
        {
            "author": "Emma1jane2",
            "body": "Because woman are seen as objects so naturally people associate an object as being feminine",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-06-01 19:03:07",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-06-01 20:30:26",
                    "replies": [
                        {
                            "author": "Emma1jane2",
                            "body": "Verb agreement doesn’t have anything to do with societal views of gender roles. Example: in Spanish, things are given a masculine or feminine form to agree with the masculine or feminine noun. The form of the noun doesn’t actually have anything to do with gender roles (milk and water are feminine. Cat is masculine). Whereas in the English language, people tend to have ai, robotic voices, boats, cars… all gendered as she. I hope that makes sense",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-06-02 11:54:42",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[removed]",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-06-03 07:44:02",
                                    "replies": [
                                        {
                                            "author": "Emma1jane2",
                                            "body": "No I’m saying men like to look at woman as something to use for their own benefit",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-06-03 14:33:54",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Juntubre22",
            "body": "The patriarchy",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-06-01 09:59:56",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Voices are more gentle",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 13:04:58",
            "replies": []
        },
        {
            "author": "deltaz0912",
            "body": "There was research done, funded by the U.S. DoD a long time ago now that compared voices for use in automated systems and concluded that women’s voices were easier to understand and performed better over background noise or when the audio quality was poor. Since then there have been other studies that came to much the same conclusion, plus people generally prefer them, probably because they really are clearer and easier to understand.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 15:11:28",
            "replies": []
        },
        {
            "author": "NonCorporealEntity",
            "body": "I think there is research that shows people take information berrer from a female voice, while they respond better to commands from male voices.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 16:01:17",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "siri can be a male too",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 16:26:57",
            "replies": [
                {
                    "author": "AmbitiousPeace-",
                    "body": "is there a statistic how many users actually prefer male siri?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-06-02 05:00:26",
                    "replies": []
                }
            ]
        },
        {
            "author": "GrittyMcGrittyface",
            "body": "I'm gonna guess surveys say they're less threatening.  Patriarchy!",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 16:42:03",
            "replies": []
        },
        {
            "author": "HumanHuman_2003",
            "body": "My Siri is a boi",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 16:44:13",
            "replies": []
        },
        {
            "author": "nntb",
            "body": "Open AI has more male voices now then girl ones \n\nI refer Cove",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 16:48:10",
            "replies": []
        },
        {
            "author": "Difficult_Series_544",
            "body": "Because at every big tech company there's a guy with a fetish for female robots",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 18:45:09",
            "replies": []
        },
        {
            "author": "proffesionalhuman",
            "body": "I think people are overlooking that now it is often both, however at the beginning a male would sound creepy and robotic. Evil robots were male. Sounds creepy, less clear, and harder to make when it sounds like a villain. Now they sound like humans which is why I think it’s 50/50 if not more males for tiktok cause the voice is funny idk. Might be reason or not",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 19:01:26",
            "replies": []
        },
        {
            "author": "NPC1_",
            "body": "You can change the voice to male if you want.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 19:04:59",
            "replies": []
        },
        {
            "author": "Zanza89",
            "body": "Most of the ai voices ive been hearing on youtube/insta are mens voices",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 19:10:55",
            "replies": []
        },
        {
            "author": "Tigeraqua8",
            "body": "I got told by an army guy that the female voice is clearer and easier to understand",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 20:00:34",
            "replies": []
        },
        {
            "author": "DaringMelody",
            "body": "One of the reasons is attention. Studies for aircraft warning systems showed that people, male and female, paid more attention to female voices than male. Sorry, I don't remember any references for this.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 20:39:46",
            "replies": []
        },
        {
            "author": "Totalwar2020",
            "body": "Males : Seggsy phones. \n\n\n\nFemales : I'd rather trust a bear than having a guys voice coming from my device.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 22:27:37",
            "replies": []
        },
        {
            "author": "RopeExotic4324",
            "body": "They are created by young horny straight men.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 22:41:17",
            "replies": []
        },
        {
            "author": "FLHX23",
            "body": "Men like the idea of being able to talk to a \"woman,\" and (some) women find another woman's voice to be less threatening than a man's voice.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 22:48:58",
            "replies": []
        },
        {
            "author": "SergiuBru",
            "body": "And all the male voices sound so gay. Probably because the software engineers working on the AIs tend to be male.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 23:00:28",
            "replies": []
        },
        {
            "author": "ThatUrukHaiMotif",
            "body": "So many armchair sociologist answers, and no one mentions the fact that in terms of sci-fi, robot voices have usually been female.\n\nFemale AI voice is embedded in our pop-culture, and it's what people subconsciously expect.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 23:05:10",
            "replies": []
        },
        {
            "author": "Intelligent-North957",
            "body": "The female voice is calming and allows one to relax and wonder what she would look like if she was real .",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 23:17:21",
            "replies": []
        },
        {
            "author": "Ko-jo-te",
            "body": "Because people don't care to change them to a male setting? Which implies a preference, but it could also be a high degree of user ineptitude regarding settings.\n\nI do think it points to a preference, though.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 23:25:03",
            "replies": []
        },
        {
            "author": "ClownShoeNinja",
            "body": "Wal-mart's self check out voice is the escort from the TV show Firefly.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 23:31:41",
            "replies": []
        },
        {
            "author": "UnitedMindStones",
            "body": "It's literally just a matter of preference and i don't think it's even true that most ai voices are female",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-02 01:10:48",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "They're just the default, bro. In settings you can make it male. There's nothing deeper than that. Or maybe because of the gender paygap it's cheaper to get a woman voiceover.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-02 01:50:49",
            "replies": [
                {
                    "author": "cloudpissery",
                    "body": "i know i can change them, i was wondering about *why* its the default for so many voices",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-06-02 03:09:03",
                    "replies": []
                }
            ]
        },
        {
            "author": "AmbitiousPeace-",
            "body": "I don’t want to hear a man talk all day",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-02 04:58:46",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "I’m not going to fap to a dudes voice..",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-02 05:14:25",
            "replies": []
        },
        {
            "author": "Progressive-Change",
            "body": "I don't know about you but I would love to have a Hulk Hogan AI voice talk to me but he starts everything out with \"brother\" before he says the thing and in his serious yet assuming accent. It would be joy to my ears.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-02 06:24:02",
            "replies": []
        },
        {
            "author": "leftclickdrip",
            "body": "you can change the voices, for siri,cortana and others",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-02 07:13:33",
            "replies": []
        },
        {
            "author": "Sufficient_Serve_439",
            "body": "Because bears aren't really eloquent?",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-02 07:20:42",
            "replies": []
        },
        {
            "author": "Comandante_Kangaroo",
            "body": "Because most engineers are lonely men, and more motivated to build something if it sounds female and asks to be touched?",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-02 07:43:11",
            "replies": []
        },
        {
            "author": "DocAndersen",
            "body": "Well the easy answer is more programmers are male. But that isn't fair to programmers. I suspect we can go back to the reality of what AI can be. As a resource a human augmentation tool, it brings us back to our early education. For the most part, that early education was delivered by female teachers.\n\nThat, by the way is my educated guess. I could probably test it but for now will just share it.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-02 08:25:33",
            "replies": []
        },
        {
            "author": "DinuxDino",
            "body": "When automated voices were first created, it was easier to replicate female voices since they are generally high pitched. Now, it’s possible to replicate male voices but companies prefer to keep female voices as default. This is an example of what’s known as AI bias",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-02 11:16:24",
            "replies": []
        },
        {
            "author": "Putrid-Language4178",
            "body": "Cause they gud at biin fake.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-02 15:43:16",
            "replies": []
        },
        {
            "author": "nerevar_moon_n_star",
            "body": "I thought “female” Siri is shrill so I switched to the “male” one that I find to be more chill.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-03 16:48:17",
            "replies": []
        },
        {
            "author": "Next_Combination_862",
            "body": "I have my Alexa set to Ziggy.  This way I don't feel as bad about screaming at it when it gives a wrong answer.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-04 14:50:10",
            "replies": []
        },
        {
            "author": "Away-Calligrapher959",
            "body": "because the world hates strong men",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-10-28 07:12:06",
            "replies": []
        },
        {
            "author": "CloudyTreeBay",
            "body": "I might get torched on a stake for this but.... AI is based on statistical analysis, and statistically women talk more.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 12:03:31",
            "replies": [
                {
                    "author": "Educational_Gas_92",
                    "body": "Lol",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-06-01 13:37:15",
                    "replies": []
                },
                {
                    "author": "squatting_your_attic",
                    "body": "Do they? I know much more men who talk and talk and talk with no regard if we're actually interested or if they should give more space to talk to their interlocutor.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-06-01 15:26:54",
                    "replies": [
                        {
                            "author": "CloudyTreeBay",
                            "body": "Well I know many more women who talk with no end. Is this an argumentative mexican standoff?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-06-02 06:08:46",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zealousideal_Dog_968",
            "body": "they're not, yo can change almost all of them now to anything.  I like the Australian man",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-06-01 14:18:03",
            "replies": [
                {
                    "author": "OfficialBobEvans",
                    "body": "Team Australian Man for maps 1000%",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-06-01 14:53:39",
                    "replies": []
                },
                {
                    "author": "Cbrt74088",
                    "body": "\"At the next intersection, turn right mate.\"",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-06-02 04:03:19",
                    "replies": []
                }
            ]
        },
        {
            "author": "Legend-Face",
            "body": "Women would think it’s sexist if it was a man’s voice",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-06-01 13:55:59",
            "replies": []
        },
        {
            "author": "htbroer",
            "body": "Because most users are heterosexual males, and are more attracted by a female voice.",
            "score": -1,
            "depth": 0,
            "timestamp": "2024-06-01 12:46:00",
            "replies": []
        },
        {
            "author": "Sci-fra",
            "body": "Because men don't like being told what to do or take advice from other men. That's why navigation systems use women's voices.",
            "score": -7,
            "depth": 0,
            "timestamp": "2024-06-01 09:17:06",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "And men are used to being told where to go by women!",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-06-01 10:34:16",
                    "replies": [
                        {
                            "author": "TheBarkingPenguin",
                            "body": "I actually laughed at this",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-06-01 11:38:05",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FedMates",
                    "body": "bro tf you yapping",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-06-01 09:41:18",
                    "replies": []
                }
            ]
        },
        {
            "author": "General-Condition833",
            "body": "because woman are women, period. (pun unintended)\n\nimo, it’s likely because either:\n\n1) womens voices are attractive\n\n2) women can rip a goddamn baby out of themselves, uncontrollably bleed for several days with terrible pain, and (most) are more mature and supportive than men.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-06-01 18:13:31",
            "replies": [
                {
                    "author": "TooStrangeForWeird",
                    "body": "While the first one is slightly true, hence the default Alexa voice that seems like it's trying to sound like a sexy secretary, the second one is nonsense. Neither of those things are even remotely considered lmao.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-06-01 18:59:37",
                    "replies": []
                }
            ]
        },
        {
            "author": "Valuable_Cookie8367",
            "body": "The world doesn’t like men 💁🏻‍♂️",
            "score": -1,
            "depth": 0,
            "timestamp": "2024-06-01 19:26:22",
            "replies": []
        },
        {
            "author": "Banjoschmanjo",
            "body": "How are you deducing that the voices are \"women's\" voices?",
            "score": -2,
            "depth": 0,
            "timestamp": "2024-06-01 14:48:41",
            "replies": []
        }
    ]
}