{
    "post_title": "Despite the STEM gender gap, most of the researchers at this B.C. AI lab are women",
    "post_timestamp": "2025-03-12 17:26:58",
    "last_comment_timestamp": "2025-03-13 04:27:36",
    "time_difference": "11:00:38",
    "comments": [
        {
            "author": "ForSaleMH370BlackBox",
            "body": "Cool. Let us know how they go. I expect their company should do just as well as any other. Why wouldn't it?",
            "score": 9,
            "depth": 0,
            "timestamp": "2025-03-12 17:37:17",
            "replies": []
        },
        {
            "author": "surrealutensil",
            "body": "reading through that article it sounds like they must be discriminating against hiring men. Which is fine; while the STEM gender gap continues. I'm curious if places like this have plans to remediate the male hiring gender bias they'll have firmly ingrained in their work culture when STEM gender gaps level out, as they're slowly but steadily doing though.",
            "score": -4,
            "depth": 0,
            "timestamp": "2025-03-12 17:38:40",
            "replies": [
                {
                    "author": "cromethus",
                    "body": "I guess you didn't read it that closely:\n\n\"Women still make up only one-third of the global scientific community, with the percentage stagnating over the past decade, according to a 2024 report by UNESCO (United Nations Educational, Scientific and Cultural Organization). In some countries, less than 10 per cent of researchers are women. \n\nThey hold just 22 per cent of STEM jobs in G20 countries, and only one in 10 ascend to leadership positions.\"\n\nWhat do you want to bet it's filled with women who couldn't get jobs elsewhere?\n\nRegardless, I love this article. It reminds people that, no, DEI is not reverse discrimination. It can't be because, unlike what people are whining about, that facts say that women and minorities are still underrepresented pretty much everywhere that isn't minimum wage adjacent.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-03-12 21:02:14",
                    "replies": [
                        {
                            "author": "surrealutensil",
                            "body": "I specifically mentioned that woman were still highly underrepresented in STEM fields as the article said, that being said 15 years ago that number was less than 5%, and the fact that it's up to 22% now, while great means that in entry level STEM position women are being hired at over 2:1 ratios compared to men. Which is fine for now, but it's going to lead to a situation in another 10 years where the gender roles are completely reversed and only men will need to be hired in entry level positions, it's turned into a see saw situation. It's currently much easier for women to get stem jobs than men so I believe asking what policies institutes that are primarily hiring woman have to even things out in a few years when it's a woman dominated field is reasonable.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2025-03-12 21:47:59",
                            "replies": [
                                {
                                    "author": "ForSaleMH370BlackBox",
                                    "body": "And surely, it won't be a problem for other firms to demand men only. After all, there will be plenty of places for women to work amongst themselves. Or isn't it supposed to work like that?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-03-13 04:27:36",
                                    "replies": []
                                },
                                {
                                    "author": "cromethus",
                                    "body": "You are bad at math, or logic, or both.\n\nYour assumption that women are getting entry level positions at twice the rate as men is based on the idea that *there is no turnover*. \n\nBut the numbers tell a *very different story* ([Source](https://www.hrdive.com/news/stem-staffing-shortage-retention-recruitment/693188/)):\nAs HR leaders, we must remember that staffing shortages are not just related to recruitment and hiring challenges— employee churn and turnover play an equally large role. As reported by the Bureau of Labor and Statistics, the national average turnover rate was 47.2% in 2021.\n\nYour whistleblowing on 'women taking over the workforce' isn't just bullshit, it exposed your fundamental biases. Maybe this is why you don't have a relationship. Studies say hard right conservatism is negatively associated with finding and keeping a partner in men.\n\nAnd for the record, people working on STEM fields consistently have lower unemployment rates and higher employment rates historically, by *wide margins* Maybe you should stop talking like men in these fields are suffering.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-03-12 21:59:04",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}