{
    "post_title": "Nearly 80% of women’s jobs could be disrupted, automated by AI - And it's relevant for an Independent Woman who practices 4B",
    "post_timestamp": "2025-02-25 23:46:13",
    "last_comment_timestamp": "2025-03-03 01:41:02",
    "time_difference": "5 days, 1:54:49",
    "comments": [
        {
            "author": "Beginning-Doubt9604",
            "body": "AI had the potential to be the great equalize, to remove biases, create fair opportunities, and let merit speak for itself. But instead of fixing systemic inequalities, humans coded their biases into AI, making it yet another tool of discrimination.\n\nWhy AI Failed to Remove Gender Bias\nBuilt by the Same Power Structures\n\nThe majority of AI developers, data scientists, and decision-makers are men, so AI reflects the biases they hold (even unconsciously).\nHistorical hiring, lending, and healthcare data favor men, so AI learns and reinforces those same patterns.\nBias in AI Training Data\n\nAI models are trained on past data. If past hiring trends preferred men for leadership roles, the AI assumes that’s the norm and keeps filtering out women.\nAI job screening tools have already been caught penalizing resumes with female-coded words (like \"women’s chess club\" or \"maternity leave\").\nMen Are Gatekeeping AI’s Power\n\nAI isn’t neutral, it’s a tool shaped by whoever is in control of it.\nInstead of using AI to fix wage gaps, workplace discrimination, and financial barriers for women, it's being used to automate job cuts in female-dominated fields (HR, education, customer service).\nWhere are the AI-driven policies that protect women? Nowhere, because the ones in charge don’t prioritize them.\nEconomic & Political Incentives Favoring Men\n\nGovernments and corporations don’t want AI to truly remove gender inequality, because they’d have to acknowledge and fix centuries of male privilege.\n\nInstead, they use AI to cut costs, maintain control, and keep power in the same hands even if that means women get left behind in job automation.\n\nAI isn’t the villain it’s just a mirror reflecting male biases at scale. \nBut instead of holding developers, corporations, and policymakers accountable, people will blame AI itself, as if it came up with sexism, job cuts, and economic inequality on its own.\n\nThere’s deep distrust in AI because of how it’s affecting women’s jobs, opportunities, and autonomy.\nMost people don’t understand that AI isn’t making decisions, it’s just executing the biases of those who control it.\nTech illiteracy is leaving women out of the AI conversation, which means men will keep running it while women resist from the sidelines, and that’s exactly what they want.\n\nWhat’s Alarming About This Backlash?\nIf women fear or reject AI instead of understanding and leveraging it, they’ll miss out on shaping the next era of power.\nHating AI won’t stop its progress, but learning how to control it will decide who benefits from it.\nThe more women disengage, the more the AI space remains male-dominated, which means more biased policies, hiring systems, and economic models.\n\nWhat’s the Smart Move?\n- Women need to enter the AI space instead of rejecting it.\n- Build AI tools that empower women instead of fighting the existence of AI.\n- Control AI’s narrative before it’s used against us.\n\nAI isn’t going away. \nThe question is, Will women shape it, or will they let it shape them?",
            "score": 57,
            "depth": 0,
            "timestamp": "2025-02-25 23:56:44",
            "replies": [
                {
                    "author": "GreenJadeEmpress",
                    "body": "I hope this won't be a big issue.  Once the economy fails, people wont even have enough money to have an internet connection or even a job that uses AI.  And a lot of tech will be put out of business.\nThere is already a feminist movement to address women's needs, so 4B does not need to go political.  \nGiven all this, what can women do?  Elect state democrats.  Since the federal government is kaput, we will need to rely on state government for equity.  Live in a blue state.  Women need to invest their money.  I am in crypto.  And we need to live together in communities and grow our own food off the grid.  I will open my house to feminists.  We need to create local 4B and feminist communities for support.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-02-26 14:00:31",
                    "replies": []
                },
                {
                    "author": "NapalmCandy",
                    "body": "\"AI isn’t going away. The question is, Will women shape it, or will they let it shape them?\"\n\nFull disclaimer, I'm nonbinary and was AFAB, but I am not a woman. Regardless, because I'm not a man I will be impacted by the same issues women face, as will all gender minorities. Unfortunately, the issue with all of this is education, and it not being equal between men and non-men. There are so many studies on how women are often neglected and even ignored in K-12 science, math and technology classes, and I'm sure it's not much better at the collegiate level (and God forbid we look outside of the binary to see how bad it is). So fighting to even have a voice in AI is going to be one hell of an uphill battle, one that should be fought, but my God is this all so exhausting. I was a STEM major and it wasn't always pretty, even though my degree (environmental studies) was fairly well balanced to leaning slightly woman as far as the binary gender representation went. I even knew someone in my degree field who was originally in computer science but couldn't take the sexism of some of the older professors so she switched majors. We definitely need more women in places of power within STEM fields, as well as in positions of teaching to try and help with the problem.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2025-02-26 08:39:26",
                    "replies": []
                }
            ]
        },
        {
            "author": "schwarzmalerin",
            "body": "Where does this data come from? Not being an expert though, I would GUESS the opposite is true.\n\nTypical women's jobs are the ones LEAST threatened by AI because they deal with people: service, care, education, counseling, sales. Obviously these are also the lowest paid ones because women do them.\n\nIt is the men's jobs that are threatened by AI the most, they are also the highest paid ones: lawyers, doctors, programmers, scientists, journalists. It is much easier to make AI replace a lawyer than make it clean a bathroom and wipe an elderly person's ass (sorry for the bluntness). These low level jobs, mostly done by women and foreigners, will be the last ones to go.\n\nSociety will change drastically.",
            "score": 40,
            "depth": 0,
            "timestamp": "2025-02-26 03:14:18",
            "replies": [
                {
                    "author": "shinkouhyou",
                    "body": "The problem is that there are a lot of people in power who *think* \"women's work\" jobs (the kind that require interpersonal skills) can easily be automated.  Just replace therapists with AI chatbots!  Customer service workers can be replaced by apps!  Who needs real salespeople when a marketing company can make micro-targeted social media ads?  Teachers can be replaced with homeschooling videos!  Nursing homes can be staffed by robots!  \n\nOf course these automated \"solutions\" already exist, and they're *garbage*.  But that hasn't stopped them from becoming ubiquitous.",
                    "score": 24,
                    "depth": 1,
                    "timestamp": "2025-02-26 03:31:11",
                    "replies": [
                        {
                            "author": "Rylandrias",
                            "body": "Character AI already saw the folly in making AI therapist bots.  They've got at least two lawsuits due to how it effected minors.  AI as customer service is also a major fail, the problem is because no humans are involved except the caller the people at the company never have to hear the complaints when there's only the AI to complain to.​",
                            "score": 8,
                            "depth": 2,
                            "timestamp": "2025-02-26 07:39:16",
                            "replies": []
                        },
                        {
                            "author": "NoCurrencyj",
                            "body": ">  Nursing homes can be staffed by robots!\n\nNow this is just fearmongering. The least likely jobs to be replaced are stuff like taking care of people (mostly elderly, kids and babies), maybe cooking and cleaning. Through all of history the automated jobs were always men's (carrying heavy stuff, factory, farming, computer-related things, war)",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-02-26 17:36:11",
                            "replies": [
                                {
                                    "author": "krisXiii",
                                    "body": "true on the fearmongering, but where does that leave women? only with the caretaking physical labor jobs that can't be robotized. yay",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-03-03 01:41:02",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "floracalendula",
                    "body": "You couldn't replace me with AI. Not possible. My entire job is about relationship building. \n\nThat said, ye gods, the day my doctor is an AI system is the day I self-delete.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-03-02 12:22:17",
                    "replies": []
                },
                {
                    "author": "Beginning-Doubt9604",
                    "body": "Just go through the link, financial independence is not because of the low stake job alone.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-02-26 03:26:16",
                    "replies": []
                }
            ]
        },
        {
            "author": "Beginning-Doubt9604",
            "body": "I am not trying to scare anyone but there is indeed a war out there and if we're not strategic now we might lose everything we have built upon. \n\nhttps://edition.cnn.com/2023/06/21/economy/women-employment-ai-disruption/index.html",
            "score": 37,
            "depth": 0,
            "timestamp": "2025-02-25 23:47:55",
            "replies": [
                {
                    "author": "sibilina8",
                    "body": "This article is really insightful. And I want to highlight the \"blue-collar jobs\" too. It's a much-needed job that many women could do. I think we picture men doing it because it is demanding physically, but it's not THAT demanding. For example, plumbers repair many easily manageable things in homes. That's another kind of job that can be promoted among women. Also, many women would feel safer if a woman came to her home, especially if she is alone. It's something to add to the list too.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-02-27 17:24:25",
                    "replies": []
                }
            ]
        },
        {
            "author": "18thcenturymadonna",
            "body": "I used to think this way until I realized ai was a gimmick. Its current capabilities are overexaggerated, often being nothing more than a marketing scheme for money obsessed executives. However, more women should be in tech, ai included, simply because for the reasons you stated. \n\nThat being said, the real issue is greed. If the future you stated happens, it won’t just be women affected, but everyone. There are too many humans on the planet for every single person to be working in tech, agriculture, and the trades. At that point, being able to survive will be a bigger issue than misogyny in tech.",
            "score": 17,
            "depth": 0,
            "timestamp": "2025-02-26 02:47:22",
            "replies": [
                {
                    "author": "Cattermune",
                    "body": "I’m also of the AI is a gimmick -so far- opinion. I work in marketing, which you think would be the first industry to be wiped out. But AI creates shitty work. Making stuff up, images are wrong, everything sounds the same as all the other AI crap people are churning out.\n\nTrying to get it to be less shitty is labour intensive. Audiences and clients are starting to quickly tell when things are AI. So the highest value marketers are those who create authenticity and innovate. \n\nI think 4B women could actually be excellent in the AI industrial shift because we have consciously stepped outside the paradigm. Those kind of brains can bring fresh and new approaches and are willing to step outside of “this is the way things are done”. Mainstream minded workers create mainstream work, and AI has that covered. Outside the box is a great place to be.\n\nFor women and girls, the primary risk I see right now is the tidal wave of misogynistic AI slop flooding our online spaces, which is training future AI models that will be used across society.\n\nBut yeah, I’m way more worried right now about surviving the climate change social breakdown fuelled by billionaires and fascism. ",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-02-27 02:02:02",
                    "replies": []
                }
            ]
        },
        {
            "author": "Candid-Feedback4875",
            "body": "Well we can start by looking at r/localllama",
            "score": 8,
            "depth": 0,
            "timestamp": "2025-02-26 00:30:07",
            "replies": []
        },
        {
            "author": "4bamerica",
            "body": "Women actually have many advantages in an AI-based world, because the remaining jobs ill be those that require being human. Women are much better at being human than men.\n\nWe definitely do need more women in the fields of AI itself though, to prevent male bias and to make them more suited towards women's interests.",
            "score": 3,
            "depth": 0,
            "timestamp": "2025-02-28 15:48:35",
            "replies": [
                {
                    "author": "Beginning-Doubt9604",
                    "body": "True",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-03-01 08:46:46",
                    "replies": []
                }
            ]
        },
        {
            "author": "ConsistentMap728",
            "body": "Okay! Love this! Do we have any advice on how t9!get involved? Maybe some women think tanks in AI or looking for women promoters? \n\nI have MA in anthropology and have published ethnographies. If anyone had advice for me on how to help integrate women’s perspectives and interests into AI lemme know",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-26 14:01:57",
            "replies": [
                {
                    "author": "Beginning-Doubt9604",
                    "body": "Wow, I think your ethnographic research can show a difference in behavior or pattern recognition between people who are cautious of AI and how it's just a gimmick for some and what's the right way that both groups should not ignore to be prepared of the future.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-03-01 08:46:24",
                    "replies": []
                }
            ]
        },
        {
            "author": "undercovershrew",
            "body": "I've been shouting this from the rooftops, and no one is listening. Thanks for this great post. The future is very grim for women. To survive in the future economy, we will need to group up with like minded women to split living costs, as an alternative to the traditional male-female dual income partnership system.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-26 21:57:42",
            "replies": [
                {
                    "author": "Beginning-Doubt9604",
                    "body": "I have the same experience, I don't know why nobody is seeing the threat, possibly because I am employed in AI and I am dealing with it everyday, I am heading an app and I feel like my job won't exist in a few years and no I am not trying to blow it out of proportions, it's like an inbuilt pattern recognition that's making me get scared of how quickly things are progressing",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-03-01 08:43:33",
                    "replies": []
                }
            ]
        },
        {
            "author": "psycorah__",
            "body": "Great post. Never considered this angle before.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-27 00:50:04",
            "replies": []
        }
    ]
}