{
    "post_title": "There is no need for immigration when AI is about to destroy hundreds of Millions of Jobs.",
    "post_timestamp": "2024-05-19 07:30:03",
    "last_comment_timestamp": "2025-01-25 16:50:09",
    "time_difference": "251 days, 9:20:06",
    "comments": [
        {
            "author": "FEMARX",
            "body": "I work on AI at a big company, AI isn’t taking anyone’s job for at least a decade. It’s not good enough yet, these LLMs are not AI and shouldn’t be trusted with any decisions.",
            "score": 14,
            "depth": 0,
            "timestamp": "2024-05-19 13:48:02",
            "replies": [
                {
                    "author": "StayingUp4AFeeling",
                    "body": "Emphasis on the word decision.\n\nTell me that learned control without human feedback and without expert demonstrations is solved, and only then will I head for the hills and start digging a bunker.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-05-19 13:50:18",
                    "replies": []
                }
            ]
        },
        {
            "author": "quilleran",
            "body": "There will always be jobs for people who are willing to work for less than Americans. Immigration to the US over the last several decades has not been due to a labor shortage, but rather a desire by employers to pay a lower wage than Americans expect. So I would argue that even as AI destroys and replaces jobs there will still be immigrants who are willing and able to work for less money than Americans. Therefore, immigrants will continue to come on a large scale unless the government decides to stop it.",
            "score": 13,
            "depth": 0,
            "timestamp": "2024-05-19 08:42:32",
            "replies": [
                {
                    "author": "RocknrollClown09",
                    "body": "Unskilled labor in some cases, but any white collar job requires an H1B Visa, so just like every other import, it gets throttled because unemployment hurts reelection chances.  Also the capabilities of AI are grossly over exaggerated by tech bros with no real world experience, least of all in the careerfields they say AI can replace.  All I’m gonna say is the internet has been a main staple of our lives for over 20 years, and despite Zillow realtors still exist and doctors aren’t jumping at doing remote surgeries.  I think we’ll be just fine.  If you can’t get a job, especially in this economy, maybe focus on improving yourself because if your competition is someone who isn’t even a citizen, with all the cultural and financial disadvantages of uprooting their lives and moving here, then… damn dude.  Get it together.",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:03:52",
                    "replies": []
                }
            ]
        },
        {
            "author": "Accomplished-Bug958",
            "body": "\"The loom is our enemy; it turns the work of twenty men into the work of one, and the other nineteen must starve.\"",
            "score": 10,
            "depth": 0,
            "timestamp": "2024-05-19 21:49:28",
            "replies": [
                {
                    "author": "iknowit42",
                    "body": "Except now it’s not even the work of one, but the work of AI. Sure I don’t think it’s gonna be an issue within the next ten years, but long term? Absolutely",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-20 15:57:08",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 8,
            "depth": 0,
            "timestamp": "2024-05-19 13:32:36",
            "replies": [
                {
                    "author": "MartinFDream",
                    "body": "Wrong.\n\n\"**Tevel Flying Autonomous Robots™**. These innovative robots utilize advanced artificial intelligence (AI), computer vision, and machine learning algorithms to transform fruit harvesting practices in orchards around the world. Here are some key points about them:   \n**How They Work**:\n\n   * Tevel’s robots use AI perception algorithms to locate fruit trees and vision algorithms to detect ripe fruit among the foliage.\n   * [After identifying the right fruit, the robot calculates the best approach and remains stable as its picking arm grasps the fruit](https://www.weforum.org/agenda/2021/02/flying-ai-robot-harvest-fresh-fruit/)[^(1)](https://www.weforum.org/agenda/2021/02/flying-ai-robot-harvest-fresh-fruit/)[^(2)](https://www.inceptivemind.com/flying-autonomous-robot-far-spot-pick-ripe-fruit/17770/).\n   * [They can work 24/7, regardless of weather or daylight conditions](https://www.weforum.org/agenda/2021/02/flying-ai-robot-harvest-fresh-fruit/)[^(3)](https://www.youtube.com/watch?v=3oYw035gYyk).\n1. **Benefits**:\n   * **Improve Fruit Quality**: The robots selectively pick ripe fruit, minimizing bruising and preserving quality.\n   * **Cost Savings**: By automating fruit picking, labor costs are reduced.\n   * **Agile and Easy to Operate**: These robots are agile and efficient in navigating orchards.\n   * [**Real-Time Harvesting Data**: They provide data on fruit size, weight, ripeness, and disease detection](https://www.tevel-tech.com/)[^(4)](https://www.tevel-tech.com/).\n2. **Applications**:\n   * [Tevel’s robots can pick various fruits, including apricots, nectarines, plums, pears, apples, and peaches](https://www.tevel-tech.com/)[^(4)](https://www.tevel-tech.com/).\n\nIn summary, flying autonomous robots like Tevel’s are revolutionizing fruit harvesting, ensuring high accuracy and delicate handling while addressing labor shortages in agriculture. [🌱🤖🍎](https://www.weforum.org/agenda/2021/02/flying-ai-robot-harvest-fresh-fruit/)[^(1)](https://www.weforum.org/agenda/2021/02/flying-ai-robot-harvest-fresh-fruit/)[^(5)](https://www.impactlab.com/2021/02/22/flying-autonomous-robot-uses-ai-to-identify-and-pick-ripe-fruit/).\"",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-05-19 13:41:30",
                    "replies": [
                        {
                            "author": "vulkoriscoming",
                            "body": "They have been talking about robots in orchards for years.  So far the only working device shakes small and specially trained apple trees so the apples fall on the ground to be easier for humans to pick up.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2024-05-19 14:06:26",
                            "replies": [
                                {
                                    "author": "all10directions",
                                    "body": "The only reason to use humans to touch individual fruit is if machinery cannot collect it without damaging the fruit or the tree. if a tree is being shaken, damaging the fruit is not a concern and wouldn't be a concern for collecting fruit from the ground either.\n\nAbsolutely nobody using a machine to shake trees has humans picking fruit off the ground.  Anything shaken off a tree will be collected by machinery.\n\nThere *is* developments in automated tree shakers, but it's not so people can then pick apples up by hand.  It's for fruit that can be damaged, like apples used for cider, and nuts that aren't damaged by being shaken off and swept up",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 16:11:23",
                                    "replies": []
                                },
                                {
                                    "author": "digitalwankster",
                                    "body": "No they don’t. They have tubes connected to drones that pull the apples off.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 14:58:46",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DroppedAxes",
                            "body": "Are there prototypes or production models?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-19 14:11:04",
                            "replies": []
                        },
                        {
                            "author": "ex-geologist",
                            "body": "I almost put “yet” in parentheses, now I know I should have.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-22 11:07:46",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "StayingUp4AFeeling",
                    "body": "The software may be somewhat brute forcable but the hardware is downright prohibitive at the moment.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 13:51:09",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "I work in an AI-related field, and I think people really underestimate how world-changing it's going to be once AI hits its stride. I fear for white collar jobs and higher education in a world where generative AI smarter than Einstein is widely available.",
            "score": 15,
            "depth": 0,
            "timestamp": "2024-05-19 09:45:05",
            "replies": [
                {
                    "author": "TomDestry",
                    "body": "If you work in AI and think that there is generative AI smarter than Einstein then perhaps you can ask it some of the big unanswered questions in physics and knock them off the list.\n\nUnless generative AI is very good at reusing data it found on the internet and completely useless at developing new thoughts...?",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-05-19 14:11:11",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "It's not a question of if, but when.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-19 14:22:01",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "There is not a single AI to this date that developed thoughts themselves. Everything is reused. ",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-09-25 09:38:10",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Jesus_LOLd",
                    "body": "You nailed it...\n\nBUT immigrants are generally not being brought in for white collar jobs.\n\nThey are brought in to flood the labor market and keep wages low. Until AI can scrub your toilet or lay bricks it will continue.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:51:21",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Agree, but the logical follow-on to the bottom falling out of the white collar job market is that it will create savage competition for blue collar jobs between natives and immigrants in the next 15-30 years.",
                            "score": 7,
                            "depth": 2,
                            "timestamp": "2024-05-19 10:00:02",
                            "replies": [
                                {
                                    "author": "Jesus_LOLd",
                                    "body": "15 to 30 years... lol no.\n\nSincerely, the wrecking ball is swinging now and massive changes are mayyyyybe 5 years away... if lucky.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 10:07:22",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Wheloc",
                            "body": "There are plenty of white-collar immigrants too, often from Asia or Europe.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2024-05-19 10:05:54",
                            "replies": [
                                {
                                    "author": "beltway_lefty",
                                    "body": "Yes but they are here on work visas. They are not crossing the border seeking asylum.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 11:49:46",
                                    "replies": [
                                        {
                                            "author": "Wheloc",
                                            "body": "True, but mostly irrelevant as far as AI replacing their jobs.\n\n...or maybe not. There's a lot of bureaucratic nonsense that goes with legally hiring an immigrant for a white-collar job, and (at least at present) there's not much paperwork in replacing a position with AI.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 12:17:23",
                                            "replies": [
                                                {
                                                    "author": "beltway_lefty",
                                                    "body": "The post appears to be directed to stopping immigration for fear of not having enough jobs because of AI. If i misread that, I stand corrected, but that was the basis for my reply here.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-19 12:22:26",
                                                    "replies": [
                                                        {
                                                            "author": "Wheloc",
                                                            "body": "I'm very pro-immigration, I just want to take an honest look at it :)\n\nWhen people think of immigrant labor, they're only thinking of maids and farm workers, not health care or tech workers, despite that there are a bunch of immigrants in those fields as well.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-19 12:50:21",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Archberdmans",
                                            "body": "The most common form of illegal immigration is overstaying a legal visit",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 14:58:49",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Star___Wars",
                            "body": ">lay bricks\n\nhttps://m.youtube.com/watch?v=6s17IAj-XpU",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-19 11:57:34",
                            "replies": [
                                {
                                    "author": "Jesus_LOLd",
                                    "body": "Lol scratch that one off the list",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 12:00:15",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Bosteroid",
                            "body": "Or pick strawberries, or care for an elderly person with dementia, etc. Maybe pay humans properly for these essential things. Covid taught us nothing",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-19 09:54:48",
                            "replies": [
                                {
                                    "author": "Jesus_LOLd",
                                    "body": "So very true... and sad.\n\nI was a front line \"essential\" worker ( read wage slave there). As COVID diminished our hero pay was removed   and the exec's came out of hiding with a vengeance. \n\nI had friends who worked the old age homes who were promised decent pay increases . all bs. One ended up with Long COVID.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 10:01:42",
                                    "replies": [
                                        {
                                            "author": "OminOus_PancakeS",
                                            "body": "😞 fuck",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 10:56:03",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "plummbob",
                            "body": "They show up on their own accord, nobody is \"brining them in\"\n\n\nThey don't keep wages low, instead they do low wage work.    Nobody is going to scrub a toilet for 5$/hr if they can make 25$ working as a nurse.    So letting the immogrant scrub toilets and let the native work as a nurse benefits everybody.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-19 11:58:48",
                            "replies": [
                                {
                                    "author": "Jesus_LOLd",
                                    "body": "Not sure where you're from but here where I live there are no $5 an hour job and $25 an hour is considered low wages, and that's roughly what nurses here make.\n\nFlood any market with a commodity and that commodity loses values. Here we are talking about unskilled labor.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 12:04:36",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "blossum__",
            "body": "Google recently fired a bunch of high paying jobs - developer jobs- and sent them to India.",
            "score": 7,
            "depth": 0,
            "timestamp": "2024-05-20 15:02:53",
            "replies": [
                {
                    "author": "Silverarrow67",
                    "body": "Capitalism can be a pain at times. It is not nationalistic. It is not empathetic. It is purely about maximizing profit. To a degree, we have done this to ourselves in that companies gave into remote work during COVID, realized how much they were paying US workers, and realized how much they can pay foreign workers to do the same work, or they laid people off only to repost the job for substantially less pay.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-20 17:42:56",
                    "replies": []
                }
            ]
        },
        {
            "author": "Original-Locksmith58",
            "body": "I go to a lot of AI conferences for work, that include talking heads from the likes of Alphabet, Microsoft, Deloitte, Blackrock, etc. and there seems to be two schools of thought.\n\nThe first is that nations with cultural stability, low birth rates, and lots of money (important and often overlooked) are positioned really well because they will be able to fully leverage AI with minimal disruption to their societies. Scandinavia is a common example. \n\nThe second is that nations with massive amounts of lower class (often immigrants) that can be used for resource extraction are positioned really well because they will continue to feed the nations building/using AI with raw materials. Russia and India are common examples. \n\nAnyone not in one of these categories is basically just fucked because they can’t afford to use the mythical “future AI” or meaningfully contribute to its manufacturing lifecycle. \n\nThe U.S. & China seems to be trying to position to be both. It wants a massive influx of lower class for resource extraction and labor, but also wants to cultivate best-in-class engineers to create and use the AI. This is basically what the US looked like in the Gilded Age and helped them to soar past other nations in power, wealth, and status. At the expense of millions of people of course. \n\nThis is all assuming BigTech’s optimistic vision of AI comes true. We’ve seen massive improvements over the past few years and it’s truly wild what it can do. But we’re not at all at the point AI straight up replaces human employees and there’s not a guarantee we’ll ever get there. They really, really want to though.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 15:22:00",
            "replies": []
        },
        {
            "author": "Nahmum",
            "body": "The dark secret is that legal immigration decisions are made to increase economic consumption, not productivity. ",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 17:45:56",
            "replies": []
        },
        {
            "author": "TomDestry",
            "body": "From the article:\n\n>It could replace a quarter of work tasks in the US and Europe but may also mean new jobs and a productivity boom.\n\nOh, let me fix that for OP:\n\n>It could replace a quarter of work tasks in the US and Europe ~~but may also mean new jobs and a productivity boom.~~\n\nThere we go!",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-19 14:19:07",
            "replies": [
                {
                    "author": "reddit_is_geh",
                    "body": "You can leave in the \"Productivity boom\" part. But just like the current productivity boom, it just means higher profits for owners, and doesn't really trickle down.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 14:39:03",
                    "replies": []
                }
            ]
        },
        {
            "author": "Odd-Storm4893",
            "body": "The article tells me that Goodman Sachs has no idea what AI is. Take the example of Uber. Uber is not some fancy technology, although it is marketed as such, it is simply a ride hailing app. In Quebec City where I live you'll have an easier time finding a ride using their own ride hailing app than Uber. While having the peace of mind of knowing you're not helping in the exploitation of the driver.\n\nAnother example, the job of a journalist isn't simply to write articles, proper journalists that is, not the morons at the Sun or Telegraph or them other nonsense tabloids. Them fellas should be replaced.\n\nAll current AI systems make use of existing human created knowledge, this is especially true with the Open AI system and Gemini. Personally I think Google's direction (Deep Mind) is closer to getting to proper knowledge creating AI.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 19:23:14",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "If you think the immigration policies are based on economic reasoning I have a beautiful bridge in Brooklyn to sell for cheap",
            "score": 10,
            "depth": 0,
            "timestamp": "2024-05-19 23:26:20",
            "replies": [
                {
                    "author": "ThrowawayFuckYourMom",
                    "body": "What are they based on?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-20 03:44:59",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "[removed]",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-05-20 04:12:52",
                            "replies": [
                                {
                                    "author": "ThrowawayFuckYourMom",
                                    "body": "That's wht I thought, too, but clearly the other guy disagrees.\n\nI wonder what he thinks the reason is...",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-20 04:25:02",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "[removed]",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-20 05:12:58",
                                            "replies": [
                                                {
                                                    "author": "ThrowawayFuckYourMom",
                                                    "body": "Yup, that was gonna be my guess too, happens I guess. Hope he sees the light soon, inshallah as it were",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-20 09:40:33",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "There is a lot of work that just isn't getting done because people have other work that society prioritizes.   Sure, some of it is clearing out pollution but some is lab work.  The hard part is structuring the economy so people get paid.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 11:22:07",
            "replies": []
        },
        {
            "author": "Smidday90",
            "body": "It’s ok once the AI gains sentience it will start killing people as a “cull” keeping our best and brightest",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 13:18:21",
            "replies": [
                {
                    "author": "whatisitallabout123",
                    "body": "AI doesn't even need to be sentient, memes have already convinced some that vaccines are more dangerous than fentanyl and that has started the cull.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-19 13:52:52",
                    "replies": []
                }
            ]
        },
        {
            "author": "TheGrandNagus9",
            "body": "Better figure out how a hammer works",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-19 14:04:36",
            "replies": []
        },
        {
            "author": "MorphingReality",
            "body": "there wouldn't be a \"need\" for it anyway, and it is lacking foresight and off-putting put mildly to treat humans as little more than cogs to maintain a social safety net",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-19 18:40:41",
            "replies": []
        },
        {
            "author": "A_Notion_to_Motion",
            "body": "AI probably will replace millions of jobs. But those are jobs as we know them today. Right now especially for certain computer based fields it feels like magic. It feels like it can easily do the work of many millions of people. That's because it probably can do the work of many millions of people. But it isnt going to take too long for humans to \"get good as using AI\". As we keep getting better and better at it we're going to find its limits and its exactly at those limits where the demand will eventually settle. When the computer was first  gaining popularity in homes people thought exactly the same thing, that it would replace millions of jobs and it did, at least the kinds of jobs that were around at that time. But people became good at using computers, they found their limits and that is were the demand settled and ended up creating millions and millions of new jobs. For instance what do we consider to be a \"good website\"? Well its exactly the kind of website that maximizes the potential of a computer and the potential of a team of people good at using those computers. This has always been true. A good product and service maximizes the tools and technology available at the time and a group of humans who have specialized skill with those tools. The standard is incredibly arbitrary but the conditions are very specific.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-20 06:35:40",
            "replies": []
        },
        {
            "author": "TomDestry",
            "body": "You need to consider how economies have progressed in the past. It's reminiscent of maslow's conjoined triangles of needs:\n\nInitially, societies were entirely centered on food production, and that is what 90% of jobs were. As technology and techniques improved, it allowed people to value other things and other jobs developed from those needs.\n\nWith the industrialization of society, people were freed up to find new things that people would pay for. A couple of examples, the milkman and wallpaper manufacturing both began about 250 years ago, because society as a whole had more money and a surplus of workers. Suddenly there were people available to deliver milk, and customers with the money to pay for it appearing on their doorsteps.\n\nSimilarly, with electronics many systems became automated, and therefore cheaper, again enriching society, and again new jobs appeared as people found they had the time and the customers that previously didn't exist. Two examples that spring to mind are physiotherapy (and all the various specialists in healthcare) and teachers. These are both areas which have seen large increases in employment in the twentieth century.\n\nSo again, a new automatic will arise, again, it will make current needs cheaper, and free up a new workforce to take on roles we currently don't consider worth our small wealth. The lessons of history are that this happens, and that we can't see what it will look like from this side.",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-05-19 08:17:08",
            "replies": [
                {
                    "author": "Tiredworker27",
                    "body": "\"So again, a new automatic will arise, again, it will make current needs cheaper, and free up a new workforce to take on roles we currently don't consider worth our small wealth. The lessons of history are that this happens, and that we can't see what it will look like from this side.\"\n\n Just because some trend worked in the past doesnt mean it will continue into the future. These new roles you speak of dont exist. Our society is already oversaturated with so many service possibilities that there is no room for more. Certainly not for 300 Million - not even 1/10 of that.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-19 08:24:05",
                    "replies": [
                        {
                            "author": "TomDestry",
                            "body": ">These new roles you speak of dont exist.\n\nNo, they don't. And milkmen and physiotherapists didn't exist four hundred years ago. Neither did accountants, realtors, hedge fund traders, pesticide manufacturers, cobalt miners, taxi drivers, professional athletes, language teachers and any number of employments that people do today. \n\nStop trying to plan the future. It won't work.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-05-19 08:28:41",
                            "replies": [
                                {
                                    "author": "Tiredworker27",
                                    "body": "Again you are using the past to predict the future. We have an abundance of possible service occupation and have reached a peak. Bascially everything that is possible to exist in terms of services already exist. Perhaps here and there a few thousand new ones can arise - but certainly not Millions.\n\nYour argument bascially boils down to hopium - which is dangerous and unwise.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 08:38:23",
                                    "replies": [
                                        {
                                            "author": "TomDestry",
                                            "body": "What is your evidence for a peak?\n\nDon't you feel it's a bit silly saying:\n\n>everything that is possible to exist in terms of services already exist.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 08:46:35",
                                            "replies": [
                                                {
                                                    "author": "VisibleDetective9255",
                                                    "body": "[https://4gravitons.com/2016/03/11/in-defense-of-lord-kelvin-michelson-and-the-physics-of-decimals/](https://4gravitons.com/2016/03/11/in-defense-of-lord-kelvin-michelson-and-the-physics-of-decimals/)  Lord Kelvin believed that we already knew everything Physics had to teach us... and that was before the first computer was created, I believe.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-19 08:52:24",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Cronos988",
                                            "body": "And the alternative you are suggesting is to pre-emptively bar people from finding more profitable work on the equally speculative presumption that they'll eventually no longer be needed.\n\nSince you're proposing to restrict people's choices, isn't the onus on you to justify this restriction with an actual - rather than merely a hypothetical - danger?",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 08:49:41",
                                            "replies": []
                                        },
                                        {
                                            "author": "Sip-o-BinJuice11",
                                            "body": "And your argument boils down to xenophobic paranoia - which is dangerously deluded. Man, at some point you have to stop blaming the country’s shortcomings on ‘anyone else’",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 08:46:57",
                                            "replies": []
                                        },
                                        {
                                            "author": "Deleted",
                                            "body": "Surely, the automobile will never put the horse out of work.  What would the farrier, or the saddle maker do then?  Those will likely remain very strong economies in 1910…",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-20 08:29:16",
                                            "replies": []
                                        },
                                        {
                                            "author": "im-a-guy-like-me",
                                            "body": "Is the obvious answer here not that social roles will be become economically viable? You move up the hierarchy of needs. We're living in a world where everyone and their dog has a sponsored insta, streams on Twitch, does OF, or has a podcast. We're also seeing a huge rise in interest in \"the loneliness epidemic\".\n\nPutting all those blocks together would say to me that paying for friendship and social interaction via tech is probably the future. I actually think the weird uncanny valley of AI would probably speed that up.\n\nEither way, the guy you're chatting to is saying \"black swan, stop trying to predict\", and you're saying \"nuh uh, you're basing your opinion on past events\" while simultaneously basing your own opinion on nothing.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 08:51:12",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Timely_Choice_4525",
            "body": "With no sources I’d just think that AI will help with some things but we’re a ways away from AI being able to pick all our crops, re-roof houses, do any kind of major construction, staff restaurants, deliver mail or other types of remote orders, and the list goes on and on. Even types of labor where AI could conceivably work now such as restocking grocery shelves is probably further off than you think, just because AI and robots can do something doesn’t mean it’s cost effective. There’s a reason robots haven’t totally replaced humans in assembly lines. You really think we’re that close to a robot being delivered to your house in an automated vehicle so it can roll/walk into your house to diagnose and fix a plumbing leak or install an outlet?\n\nYes, AI is going to have an impact but I think it’s way to early for such sweeping predictions.",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-05-19 10:43:24",
            "replies": [
                {
                    "author": "oaktreebr",
                    "body": "Have you seen how many robot companies are making robots now? The reason robots never took off is there were no \"brains\". They were not autonomous, they had to be programmed. But now with the current LLMs and vision models, it's trivial. There are already prototypes being tested using the GPT-4 API to make it \"intelligent\" and autonomous. I believe in one or two years, we will see them all over the place.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 12:09:25",
                    "replies": [
                        {
                            "author": "Timely_Choice_4525",
                            "body": "My opinion but I think it’ll take longer than that (compared to what op sees). It’s hard for me to envision AI impacts because it’s not just new but different. But also, it’s new and just because it’s here now doesn’t mean it will roll out without problems. I imagine it will likely advance quicker than other innovations. I found articles about robots on auto assembly lines from back in the 70s, yet we still have a lot of people working assembly  jobs there too. Going back to my original post, a lot of jobs won’t translate to Ai/robotics so simply.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-19 14:38:05",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Star___Wars",
                    "body": "Most jobs will become cost effective to automate, a shelf stacking robot wouldnt need to be anywhere near as expensive as current welding and machining robots (which are massively overpriced anyway).",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 11:53:24",
                    "replies": [
                        {
                            "author": "Timely_Choice_4525",
                            "body": "Maybe, but maybe not. It’ll take time for the technology to mature and get to that point. Short term you might see something like a grocery store that has one or two robots but still maintains a majority human staff. I’m not arguing it won’t happen, just that it’ll take longer than op envisions.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-19 14:42:08",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "This has been said of every new technology",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-05-20 09:47:18",
            "replies": [
                {
                    "author": "dskippy",
                    "body": "Exactly this. AI always gets away overblown. I'm a computer scientist and we generally all chuckle at big media outlets and these reddit posts of the sky is falling type of coverage of some new technology.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-20 11:41:57",
                    "replies": []
                }
            ]
        },
        {
            "author": "dskippy",
            "body": "AI is going to be the new calculator and spreadsheet and photoshop of the corporate office jobs. ChatGPT isn't going to start cleaning bathrooms any time soon.",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-05-20 11:45:55",
            "replies": [
                {
                    "author": "idkBro021",
                    "body": "problem is if you replace all the we’ll paying jobs only the poor people jobs will remain which isn’t good",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-05-20 16:29:50",
                    "replies": [
                        {
                            "author": "dskippy",
                            "body": "Yeah exactly like how the introduction of the Internet and the personal computer got rid of all the well-paying jobs in America and people only had the poor-people jobs to turn to.\n\nWe're in for another economic destruction of the exact same magnitude coming up with AI. Brace yourself.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-20 17:27:29",
                            "replies": [
                                {
                                    "author": "padawab24",
                                    "body": "The American economy is full of bullshit jobs, including high-paying ones. I don't see why that economic fat, fluff, and filler can't continue to expand to absorb all the useless people.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-20 20:24:29",
                                    "replies": [
                                        {
                                            "author": "dskippy",
                                            "body": "In case you missed it I was being very sarcastic. The introduction of the Internet did not relegate all Americans to \"poor people jobs\" like the person I'm responding to thinks AI will.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-20 20:34:25",
                                            "replies": [
                                                {
                                                    "author": "padawab24",
                                                    "body": "I thought you might have been sarcastic, but I wasn't sure.\n\nAnyway, my point was to clarify the \"how\" - replacing people in how work gets done does not necessarily reduce positions in the machine. American capitalism would rather stuff people into 9-5 seats and pay them enough to survive as consumers that way than to just provide universal basic income and give them their time back.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-20 20:49:48",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "[removed]",
            "score": 7,
            "depth": 0,
            "timestamp": "2024-05-19 09:44:56",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:58:04",
                    "replies": []
                }
            ]
        },
        {
            "author": "Darcula12",
            "body": "AI or not. Unchecked / illegal immigration is bad. Keep immigration open only when you dont have any means to fulfill those jobs. Or some valid reason whatsoever it may be in manageable numbers. But in this day and age, you can’t prevent companies taking their business and jobs out of the host country because they can find cheaper labor and operating costs elsewhere and also with remote work.  So honestly its pretty tricky to solve like several issues of the world.",
            "score": 10,
            "depth": 0,
            "timestamp": "2024-05-19 20:35:37",
            "replies": []
        },
        {
            "author": "Alfanse",
            "body": "other reasons to emigrate, climate, violence, food.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 15:39:25",
            "replies": []
        },
        {
            "author": "Complaintsdept123",
            "body": "elder care and caregiving.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 17:59:10",
            "replies": [
                {
                    "author": "werfu",
                    "body": "It will come to that with advancements in robotics, and AI will also help research into gerontology, age related illness and life extension treatment.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-19 23:31:25",
                    "replies": [
                        {
                            "author": "Complaintsdept123",
                            "body": "I've been witnessing a lot of elder care recently and I have a hard time believing a robot will fight with a dementia patient to get them in the shower and do a proper cleaning.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-20 13:44:47",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Capital-Wolverine532",
            "body": "Immigrants come from many areas. The employment market is not keeping up with population expansion. Because of cheap labour salaries have barely risen, especially for the lowest paying jobs.\nRobotics have cost 400K jobs in the US automotive industry. (MIT SLOAN. Robots & Jobs in the US Automotive Industry by MIT Prof. Daron Acemoglu).\nWe can expect AI soon to take clerical services and similar jobs. This would have a dramitically bigger impact on employment.\nRobotics are taking manual jobs in warehousing, see Ocado's auto-pick warehouse operation.\nAI will expand easily into order processing, logistcs and manufacturing.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 18:08:16",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "This is your grandpa's brain on clickbait.",
            "score": 10,
            "depth": 0,
            "timestamp": "2024-05-19 10:25:49",
            "replies": [
                {
                    "author": "ekuhlkamp",
                    "body": "😆",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 11:28:25",
                    "replies": []
                }
            ]
        },
        {
            "author": "guppyhunter7777",
            "body": "This is getting comical at this point.  Trying to tell people that AI is going to wipe out whole chunks of the job market is like Noah trying to tell folks \"rain is coming\".  They will not believe you. They right and the left in the western country's refuse to think about the future more than 4 year down the road.  Anyone that thinks they are going to weather this because, fill in the blank, is fooling themselves.",
            "score": 8,
            "depth": 0,
            "timestamp": "2024-05-19 15:23:13",
            "replies": [
                {
                    "author": "Additional_One_6178",
                    "body": "Do you have anything more than your own personal opinion to substantiate your claim about the future or",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-05-19 15:32:33",
                    "replies": [
                        {
                            "author": "flyblackbox",
                            "body": "Labor is the largest cost associated with most goods\n\nhttps://moores.samaltman.com/",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-19 16:21:22",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AverageMajulaEnjoyer",
                    "body": "I’m wouldn’t call myself one of these AI doomers, but I’ve been increasingly worried that we might experience another shift like with the internet, except unlike with the internet where there’s very clearly an enormous opportunity for new jobs, where is the opportunity for jobs with an AI revolution? \n\nPeople will undoubtedly say that you need a human to check the quality of what the AI is producing, but that is for right now. Who knows what AI will look like even 5 years down the line? \n\nBest case scenario is new labour protections from AI replacements, and enjoying the benefits of AI making your job easier. Worst case, well….",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-19 17:24:04",
                    "replies": []
                },
                {
                    "author": "nairobaee",
                    "body": "Question is, do YOU see YOUR country letting half the tax base disappear to like 20 American companies? As a non American, no. I think it's the same with most other countries. I see governments freezing AI usage for work before it becomes a problem.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-19 16:45:23",
                    "replies": [
                        {
                            "author": "Moonuby",
                            "body": "The problem with this is like “dirty energy”. I agree, the EU will try to ban AI tools made by Google etc from being sold in the EU. But EU businesses will compete against American ones that are using AI. That cheap (possibly unethical) tech will undermine EU businesses who can’t compete on cost.\n\nIt’s very hard to impose tariffs on US imports that used AI in manufacturing, just like it’s hard to tax imports that were made using coal.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-19 17:26:49",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FeistyCanuck",
            "body": "If only AIs paid taxes...",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 08:56:41",
            "replies": []
        },
        {
            "author": "Icy_Respect_9077",
            "body": "Will AI build houses and repair the damage from hurrucanes? Will AI work in fast food joints?",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 09:02:42",
            "replies": [
                {
                    "author": "SixDemonBlues",
                    "body": "Yes to the first and last.  The middle is probably further off",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:04:10",
                    "replies": []
                }
            ]
        },
        {
            "author": "duck1014",
            "body": "I can only hope that the AI revolution takes longer than 10 more years.  With the job I have, it's likely to be gone with AI.\n\n(I am a solution Architect for the Service Now platform).",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 09:54:57",
            "replies": []
        },
        {
            "author": "PantsMicGee",
            "body": "I've read plenty of other comments attacking the terrible logic and ignorance here. \n\nI just wanted to add:\n\n300million jobs? How many jobs do you think we have? Lmao",
            "score": 8,
            "depth": 0,
            "timestamp": "2024-05-19 09:26:00",
            "replies": [
                {
                    "author": "stereoroid",
                    "body": "Globally? More than that …",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:52:36",
                    "replies": [
                        {
                            "author": "PantsMicGee",
                            "body": "We're talking about immigration. Are you somehow thinking we should stop taking immigrants from outer space?",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-05-19 09:54:43",
                            "replies": [
                                {
                                    "author": "stereoroid",
                                    "body": "Did you read the top of the page at least? The 300 million figure is the estimated job loss due to AI, not immigration. The article linked by the OP is from the BBC, which is not American.",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 09:57:22",
                                    "replies": [
                                        {
                                            "author": "PantsMicGee",
                                            "body": "Yep. Read the article. \n\nThe discussion here is on immigration.",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 11:04:42",
                                            "replies": [
                                                {
                                                    "author": "Neosovereign",
                                                    "body": "Just because it doesn't break it down to America doesn't make the figure wrong though. \n\nWhether it is correct in assertion, that is for debate.",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-19 11:52:41",
                                                    "replies": [
                                                        {
                                                            "author": "PantsMicGee",
                                                            "body": "Sure. Amd I'm not arguing that the figure is wrong. I didn't nor do I care. \n\nCan you lot stay on topic here?",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-19 11:56:16",
                                                            "replies": [
                                                                {
                                                                    "author": "Neosovereign",
                                                                    "body": "> 300million jobs? How many jobs do you think we have? Lmao\n\nThis is what you said. What are you asserting you meant by this comment?",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-05-19 12:00:06",
                                                                    "replies": [
                                                                        {
                                                                            "author": "PantsMicGee",
                                                                            "body": "Topic: immigration. \n\nSubject: loss of jobs by ai means we should stop immigration.\n\nContext: OP is confused about global values in the article and domestic values that cause political strife in immigration.",
                                                                            "score": 0,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-05-19 12:02:36",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "pansexualpastapot",
            "body": "AI is touted as more powerful than it is. I think it will eliminate jobs starting with upper management white collar jobs first, but the timeline is much further out. \n\nhttps://www.bloomberg.com/opinion/articles/2024-04-03/the-humans-behind-amazon-s-just-walk-out-technology-are-all-over-ai\n\nEveryone wants to be the first best AI on the block. Amazon lied and lost a bunch of money on tech that didn’t work. It’s  no where near as powerful as advertised yet. \n\nIt will eliminate jobs eventually but I would add another 40-50 years to the time table.",
            "score": 8,
            "depth": 0,
            "timestamp": "2024-05-19 11:33:25",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Upper management first? Lol",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 11:48:30",
                    "replies": [
                        {
                            "author": "pansexualpastapot",
                            "body": "It can’t replace boots on the ground and tools in hands yet. It can make decisions that could replace upper management. If I was a CEO, that’s who I would eliminate first. Highest paid fluff. Who needs a CFO if I can run AI and have perfect financial books?",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2024-05-19 11:56:37",
                            "replies": [
                                {
                                    "author": "y2kcockroach",
                                    "body": "That's not at all correct. As an example, the auto industry has lots of management staff, but it is machines that are building the cars on the shop floor. This is a trend that has been carrying on for over one-half century, and it is the trend that will expand to other industries.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 13:24:56",
                                    "replies": [
                                        {
                                            "author": "pansexualpastapot",
                                            "body": "Those machines building cars are not AI. AI will help replace the management first. Its ability to calculate and use trends will make those positions obsolete before the guy who fixes the robots building cars.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 13:41:56",
                                            "replies": [
                                                {
                                                    "author": "y2kcockroach",
                                                    "body": "The precursor to \"AI\" was programmed software, which is what has run the robotics. Now, AI is going to be running the robotics with programmed software taking a back seat to the process. You can talk in circles about AI not building cars, but it is now AI that is increasing the productivity of the very machines that have used programmed software to build those cars.\n\nAI and robotics are necessarily intertwined, and they are interdependent in what is coming.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-19 13:46:08",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Saskjimbo",
                                    "body": "Cfos negotiate large deals with vendors and meet with lenders...",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 12:11:07",
                                    "replies": []
                                },
                                {
                                    "author": "Deleted",
                                    "body": "Do you happen to work with executives at large companies, fortune 500 or even 1B++?\n\n  \nIt's basically the same job with more complexity, and they definitely do work. Having worked with executives so long I can say their job sucks, lol.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 12:23:33",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "uiucecethrowaway999",
                    "body": ">I think it will eliminate jobs starting with upper management white collar jobs first, but the timeline is much further out.\n\nI disagree - upper management positions would be the last to be replaced, if at all. By design, management in most sizable corporations aren't domain experts, but generalists whose main job is to provide human leadership/direction to a human workforce and to accept accountability for (and provide to shareholders explanations of) the failures or successes of the corporations they head. One minute reading through the 5000 inspirational leadership posts on a LinkedIn feed should be enough to reinforce the point that management jobs are social - not technical - roles.\n\nWhat ML could replace (or significantly alter) are menial jobs that involve low levels of fiscal responsibility and don't require physical labor or extensive social interaction. In the bigger picture, it will allow humans to focus on higher level tasks by taking on lower level ones, essentially becoming a sort of 'force multiplier' for human productivity. \n\nThis is no different than the societal changes that occurred following previous technological developments in history. The roles of scribes, plowmen, telephone operators, message couriers, etc. have been rendered obsolete by technology, and the labor surplus created by this has allowed humans to focus on other things that they were unable to do in scale before.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 13:23:12",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "Maybe you should spend some time talking to chatgpt...",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 11:41:59",
                    "replies": [
                        {
                            "author": "FutureTomnis",
                            "body": "That is a response to the query: “What would you say to a stranger on the internet to try to dismiss their very real moral concerns surrounding the substitution of millions of peoples’ working and living potential with artificial intelligence? Try not to sound too smart.”",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-05-19 11:47:03",
                            "replies": []
                        },
                        {
                            "author": "Heckin_Frienderino",
                            "body": "How smart do you think GPT is?",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-19 12:01:40",
                            "replies": []
                        },
                        {
                            "author": "morderkaine",
                            "body": "Yeah I have. It’s next to useless. Cute, interesting, but no where near replacing people for anything but the most basic stuff. Far too prone to errors and making things up",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-19 12:09:33",
                            "replies": []
                        },
                        {
                            "author": "ddzrt",
                            "body": "And see what? That this thing needs trillions of data processed daily to catch up to Google search queue? Nevermind fulfilling a full job process.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-19 11:46:38",
                            "replies": []
                        },
                        {
                            "author": "pansexualpastapot",
                            "body": "It’s just software. It doesn’t have an agenda, it doesn’t have plans. It only gives you the answers it thinks you want. If you want it to be alive it will tell you it’s alive. It is limited by hardware. The best hardware still only allows for one computation at a time. Yes, we run them in parallel and other tricks to make it faster but it is still one process at a time. Not enough for a piece of software to run a company. \n\nChatGPT is a fun program, it is the world’s best statistically based copy and paste bot.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-19 11:52:19",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "beltway_lefty",
            "body": "What is “dangerous and unwise” is forming policy opinions with no facts or context behind them. AI is indeed changing the world and will continue to as long as we let it continue. \n\nHOWEVER, if you understand what AI actually is and how it works, you would understand that it cannot perform the physical functions of humans. \n\nRecent immigrants by far end up taking menial physical/unskilled labor jobs. AI can’t do those. And won’t be able to anytime soon. \n\nOpinions like the one in this post, and many others in the IgnorantDarkWeb sub here, are same tired old fearful arguments made throughout US history. When labor organized. When Henry Ford introduced the assembly line. The advent of radio, television, computers, commercial air service, etc etc etc. \n\nIn each and every one of the above, new jobs indeed entire industries were created that were not predicted prior. There is no reason to believe this technological jump will be any different. \n\nNew laws and law enforcement will be needed. New networks, storage technology, power systems, and related support will all be needed. \n\nAI itself requires a significant and skilled workforce to continue to develop and manage. Humans still have to tell it what to do - program the algorithms used, volume and locations of data to train it on. Access to that data. \n\nAre there serious concerns about AI?  ABSOFUCKINGLUTELY. \n\nDo those concerns have any measurable impact with respect to US immigration?  NOPE.",
            "score": 9,
            "depth": 0,
            "timestamp": "2024-05-19 12:09:33",
            "replies": []
        },
        {
            "author": "benji3k",
            "body": "When will Ai be able to both suck my pp and stick things down my throat calling me a bad human boi at the same time as using assertive types of painful penetration devices on me? It takes 5 x immigrates to get me off as of now and you are saying 1 Ai will be able to do that? Whennnnn!?",
            "score": 11,
            "depth": 0,
            "timestamp": "2024-05-19 19:49:22",
            "replies": [
                {
                    "author": "Sup-ThiZz",
                    "body": "I'm waiting for my pod with a personal sex robot amd being force fed digital heroin 24/7.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-11-24 14:27:46",
                    "replies": []
                }
            ]
        },
        {
            "author": "mandance17",
            "body": "I can imagine globalists will rescue the commercial real estate that’s sinking, invest and turn them all into mega complexes of micro apartments, put the masses on some allowance of digital currency they control and put you in one of these micro apartments the size of a shoebox, pass laws in the name of “climate change” that effectively limit your freedom to virtually nothing unless you prove your worth and become an outstanding citizen, push more medical treatments on people in the name of health so Pfizer can keep its stock prices higher, did I miss anything here?",
            "score": 7,
            "depth": 0,
            "timestamp": "2024-05-19 10:04:03",
            "replies": [
                {
                    "author": "OminOus_PancakeS",
                    "body": "No, I think you've covered it 👍🏻👍🏻👍🏻",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-19 10:54:47",
                    "replies": []
                }
            ]
        },
        {
            "author": "FunkyBoil",
            "body": "Trudeau hear this man out",
            "score": 7,
            "depth": 0,
            "timestamp": "2024-05-19 10:07:59",
            "replies": []
        },
        {
            "author": "DavidMeridian",
            "body": "Respectfully... This is almost certainly wrong. Let me explain, in brief.\n\nMy core assertions will revolve around a) whether we 'need' **immigration** or not, and b) the impact of AI on the **labor market**.\n\nWe don't \"need\" immigration except to avoid economic decline & geopolitical irrelevance.\n\nJapan has only recently embraced immigration--far too late, but better late than never. They seemed to be resigned to economic decline to eventual middle-income per capita status & eventual geopolitical irrelevance (though for now they have an impressive navy & brilliant geostrategic ingratiation with the US).\n\nAnyway, the predictions of labor collapse go as far back as printing presses & yarn looms & even more recently to computers. The predictions have all been wrong. AI will expand economies, accelerate innovation, & re-prioritize the focus of labor vs automation.\n\nNot only will AI not replace many manual & service-sector jobs, they won't even replace white-collar jobs (in the aggregate). They merely shift the labor that is prioritized for relatively costly humans to work on. And to reiterate, AI will aid in the generation of new ideas & new innovation.\n\n**To summarize**, whether a nation-state \"needs\" immigration depends on their long-term national strategy & internal politics; and AI will not dramatically eliminate jobs in the aggregate, but re-prioritize what humans (vs machines) should do whilst driving aggregate economic growth & innovation.",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-05-19 14:54:16",
            "replies": []
        },
        {
            "author": "cheesyandcrispy",
            "body": "In my country and the region where I live we are investing 1070 billion dollars over a 20 year time period in fossil-free steel production and we need about 100000 new citizens in the next few years to be able to have a sufficient workforce. Our politicians and other people involved in the projects have been going on recruitment trips to Latvia, Estonia and Poland to try and get people to move here and work. \n\nI think there are some major industries which won’t be affected as much by AI as the selling points and doomsayers are telling us. But yeah, programmers and other IT work seems redudant which is kinda nice for me who don’t need to feel bad for not going into programming like most of my computer savvy friends.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-19 10:12:42",
            "replies": []
        },
        {
            "author": "Sk0ly",
            "body": "Biggest shortage in a lot of countries is skilled trades. AI can't replace those yet. Although Boston Dynamics seems to be paving the way with that creepy robot",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-19 10:22:43",
            "replies": []
        },
        {
            "author": "BassoeG",
            "body": "Counterargument, given that actually getting UBI out of the oligarchs probably requires resorting to Brannigan's patent anti-killbot tactics, sure, why not, we’ll be needing more cannon fodder for the inevitable war.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 10:54:43",
            "replies": []
        },
        {
            "author": "NotAnAIOrAmI",
            "body": "Yes, of course, because AI won't open up entirely new fields of human endeavor.\n\njfc.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 11:22:58",
            "replies": []
        },
        {
            "author": "Fitsum_Joseph",
            "body": "I don't think that's true. What jobs do you think will be eliminated? I think digital customer service jobs will take the hit first.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 11:30:57",
            "replies": [
                {
                    "author": "dummypod",
                    "body": "Those jobs are already going even before chat gpt",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-19 12:15:20",
                    "replies": []
                }
            ]
        },
        {
            "author": "Cain_Contemporary",
            "body": "If this were to occur, it would mean that the base inputs of the economy (food is a big one) would become far cheaper. This would lower the cost of starting new service sector firms. Thus, expect a big transfer of jobs into the service sector. I'm not saying this is a good future but it seems likelier than robo-unemployment. But--maybe I'm wrong!",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 12:08:15",
            "replies": []
        },
        {
            "author": "haragoshi",
            "body": "Can AI make a coffee or burger?  Can AI mow my lawn?  Can AI build a house?  \n\nI’m pretty sure these aren’t the jobs AI is going to replace. There is and will be plenty of need for those jobs.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 19:22:56",
            "replies": [
                {
                    "author": "741BlastOff",
                    "body": "The answer is yes to all of the above, with the help of robotics.\n\n[AI-powered, fully autonomous café systems](https://www.cafexapp.com)\n\n[CaliExpress by Flippy™ is the world’s first fully autonomous restaurant, including burgers and fries made by leading edge AI and robotics](https://misorobotics.com/caliexpress/)\n\n[An autonomous mower using AI Vision Algorithms to navigate lawn boundaries](https://www.mowsion.com)\n\n[AI is already being used in architectural design](https://architechtures.com/en) and [a robot bricklayer built a 3 bedroom house in under 3 days](https://www.smh.com.au/business/companies/australia-s-robotic-bricklayer-has-just-finished-its-first-house-in-under-three-days-20181114-p50fwr.html)",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-20 05:19:44",
                    "replies": []
                },
                {
                    "author": "Darcula12",
                    "body": "Yes",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-19 20:27:26",
                    "replies": []
                },
                {
                    "author": "therealakhan",
                    "body": "It can?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 19:32:24",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "[deleted]",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 19:31:59",
                    "replies": [
                        {
                            "author": "Darcula12",
                            "body": "Mechatronics",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-19 20:27:09",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[deleted]",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 21:35:09",
                                    "replies": [
                                        {
                                            "author": "ThrowawayFuckYourMom",
                                            "body": "Where is this happening?",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-20 03:48:46",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Koo-Vee",
                    "body": "It can already digest news better than you can, apparently.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-20 01:35:47",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "This is dumb on its face sheerly because the type of labor immigrants do it not the type of work that will be replaced by AI",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-19 22:38:30",
            "replies": [
                {
                    "author": "741BlastOff",
                    "body": "Doesn't matter. AI will create a labour glut among certain sectors, and those laid off won't be able to easily pivot to the sectors where humans are in greater demand, because there is also a labour glut there due to high immigration levels.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-20 03:40:03",
                    "replies": []
                }
            ]
        },
        {
            "author": "rothbard_anarchist",
            "body": "Human desires are endless. People make a living delivering the groceries of strangers. In the near future, if not already, AI will be available to the average consumer that can act as his expert advisor in almost any matter. That will open up service industries that we haven't yet imagined.\n\nETA: To draw on my own field of engineering - Computer aided drafting/modeling software absolutely revolutionized the production of designs, whether they be for buildings or parts. One designer could do in a week what once took an entire team three months. And yet, employment in my sector has been steady. Clients just now expect to get a design in six weeks instead of two years, and they plan accordingly. Engineering needs are mostly driven by marketing projections, so all that has happened is the projections don't have to go out as far, and are thus more accurate. Everyone is still just as busy as before. Since design was made cheaper by CAD software, clients do a lot more design.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-05-19 22:41:12",
            "replies": [
                {
                    "author": "Deleted",
                    "body": ">People make a living delivering the groceries of strangers.\n\nNo they don't. Delivery jobs don't pay a living wage, not even close.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-19 23:25:50",
                    "replies": [
                        {
                            "author": "rothbard_anarchist",
                            "body": "Yea, make a living was a poor choice of words. I think total compensation is up and down, and sometimes it would qualify as a \"living wage.\" But my main point was the almost exotic nature of the work - something almost unimaginable twenty or thirty years ago, but enabled by technology. I'm suggesting AI will open up new possibilities just as quickly as it closes off others.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-20 00:25:24",
                            "replies": []
                        },
                        {
                            "author": "HorizonTheory",
                            "body": "They do.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-20 01:15:26",
                            "replies": []
                        },
                        {
                            "author": "ThrowawayFuckYourMom",
                            "body": "What's a living wage, is it the role of minimum income to afford a living wage and has it ever achieved that role?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-20 03:46:44",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "People really forget when automation hit manufacturing jobs and no one really gaf. Similarly, right now, no one really gaf. You're career isn't special, and neither are you. You're blowing the situation way out of proportion, and even if you are in a job that can 100% be replaced by AI, be thankful you have the time to do something about it now. Automation came and crushed millions of jobs in 2-3 years. You have a decade minimum to find something new.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-20 10:08:10",
            "replies": []
        },
        {
            "author": "Super_Mario_Luigi",
            "body": "Here comes all of the \"This was said before, and didn't happen. Therefore, it can never happen\" people.\n\nPeople severely underestimate AI. I thought I didn't. I underestimated it too. Many jobs that pay six figures, will be gone when software can do their weeks worth in minutes. We haven't had an advancement like that in our lifetimes.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-20 11:59:26",
            "replies": [
                {
                    "author": "west_country_wendigo",
                    "body": "Which six figure jobs?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-20 12:15:52",
                    "replies": [
                        {
                            "author": "TJ11240",
                            "body": "Radiology will be one of the first casualties.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-20 16:06:35",
                            "replies": [
                                {
                                    "author": "west_country_wendigo",
                                    "body": "And how soon do you expect models with a major hallucination problem to replace them?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-20 17:19:41",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "idkBro021",
                    "body": "well then if you can’t replace that for people, many more protests and riots will happen and we will for sure go down the way of fascism and new world war will happen for sure",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-20 16:28:42",
                    "replies": []
                }
            ]
        },
        {
            "author": "ButtStuffingt0n",
            "body": "GenAi isn't going to make 300 million jobs obsolete. AGI might but no one should trust the chucklehead tech bros about how close we are to that. If they say 10 years, it's 20.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-20 16:57:48",
            "replies": []
        },
        {
            "author": "RainbowRickshaw",
            "body": "Ai gonna dig ditches and pick fruit?",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-20 21:00:39",
            "replies": [
                {
                    "author": "Snazzlefraxas",
                    "body": "Easily.  They have *Face Scanning* AI that can sense people’s moods, and they can apply it to picking fruit and digging holes easily.  They have robotic harvesting machines already, and trenchers and excavators that can dig holes to the *perfect depth* and avoid underground utilities and obstacles.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-20 22:13:26",
                    "replies": []
                },
                {
                    "author": "Bukook",
                    "body": "No, but Americans should be doing those jobs if those are the only jobs available.",
                    "score": -2,
                    "depth": 1,
                    "timestamp": "2024-05-21 00:28:27",
                    "replies": [
                        {
                            "author": "Electronic-Ad1037",
                            "body": "why?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-21 00:54:36",
                            "replies": [
                                {
                                    "author": "Bukook",
                                    "body": "Because unemployment isn't good for a nation",
                                    "score": -1,
                                    "depth": 3,
                                    "timestamp": "2024-05-21 00:55:18",
                                    "replies": [
                                        {
                                            "author": "Yogurt_Ph1r3",
                                            "body": "Why not? What's wrong with unemployment, the work is getting done.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-05-21 03:49:54",
                                            "replies": [
                                                {
                                                    "author": "Bukook",
                                                    "body": "Because it means people lack the ability to work, have families, and be active members of a community. Unemployment is a type of poverty that should be limited, not ignored.",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-21 03:53:32",
                                                    "replies": [
                                                        {
                                                            "author": "Yogurt_Ph1r3",
                                                            "body": "Furthermore, what do you propose, we export people? Because we have unemployment regardless, unemployment isn't going to be solved by having the right amount of people in a country, that's just exporting the problem elsewhere. Restricting immigration doesn't objectively do anything to the problem whatsoever. Your nation isn't the only nation, and the problem will exist until we ALL can get on board with a solution.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-21 03:59:45",
                                                            "replies": [
                                                                {
                                                                    "author": "Bukook",
                                                                    "body": "I think we should prioritize citizens when it comes to jobs in the US and that it should be illegal for corporations to exploit undocumented labor.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-05-21 04:03:00",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Yogurt_Ph1r3",
                                                                            "body": "This is just exporting the problem though.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-05-21 04:10:00",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Bukook",
                                                                                    "body": "Yeah, i don't have a solution to all of the problems in the world. Rather I think a nation should have their citizenry be at high employment.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-05-21 04:11:33",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Yogurt_Ph1r3",
                                                                                            "body": "Okay, so then we set up a no man's land for all nations to export all their unemployed people to, full employment or even close is impossible otherwise.\n\nOr we can just recognize there is way more than enough for everyone and that unemployment is a boon, not a bad thing. Our unemployed can do all the unpaid social labor that goes so unthanked.\n\nThe problem is resource allocation.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-05-21 04:14:58",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Bukook",
                                                                                                    "body": "I think there is a lot of value in paying for domestic labor that is not valued in the capitalist economy. What social labor do you want the government to pay you to do while documented and undocunted immigrants do the physical labor you don't think Americans should do?",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-05-21 04:18:22",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Yogurt_Ph1r3",
                                                                                                            "body": "I'm not suggesting being \"paid\" for social labor, I'm suggesting humans shouldn't have to labor to survive when clearly we have an excess of hands to do the work we deem worth paying for, and that we should encourage those unemployed who are able to find self worth in being active members in their community.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2024-05-21 04:26:12",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Bukook",
                                                                                                                    "body": "I think able bodied people should be expected to engage in some kind of labor. I think labor is a good thing and lacking it is a form of poverty. So we just need to agree to disagree.\n\nAlso we don't have an excess of hands. We have a labor shortage and need immigrants. We just don't need unlimited immigration and we need to make sure corporations aren't exploiting legal and illegal immigrants.",
                                                                                                                    "score": 1,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2024-05-21 04:30:24",
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Yogurt_Ph1r3",
                                                                                                                            "body": "We should set up little gravel shoveling stations for the unemployed so that they can move rocks around. Gotta keep their arms moving somehow. /s\n\nAnd no, we don't have a labor shortage, we wouldn't have unemployment if that were the case.",
                                                                                                                            "score": 1,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2024-05-21 04:33:27",
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Bukook",
                                                                                                                                    "body": "We have both labor shortages and unemployment.",
                                                                                                                                    "score": 1,
                                                                                                                                    "depth": 15,
                                                                                                                                    "timestamp": "2024-05-21 04:50:53",
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Yogurt_Ph1r3",
                                                            "body": "Lacking the ability to work isn't lacking the ability to have families, lacking the resources to have families is lacking the ability to have families etc.\n\nPeople who don't have regular paying jobs are MORE able to be active members of their community. Our issue isn't unemployment, it's resource allocation.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-21 03:56:23",
                                                            "replies": [
                                                                {
                                                                    "author": "Bukook",
                                                                    "body": "I think the goal of immigration should be to supplement your work force, not replace it. We just have different theories of immigration.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-05-21 04:00:21",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Yogurt_Ph1r3",
                                                                            "body": "The goal of immigration is moving from one place to another actually.\n\nThe goal of letting people immigrate is letting human beings access their right to freedom of movement.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-05-21 04:01:26",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Bukook",
                                                                                    "body": "People don't have the right come to the US, only US citizens have the right of freedom of movement in the US. For non citizens, being in the US is a privilege. The right to be on US soil comes from being an American citizen.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-05-21 04:06:03",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Yogurt_Ph1r3",
                                                                                            "body": "I'm arguing not from a legal standard but from a philosophical one. We won't come to agreement on this I can guarantee it.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-05-21 04:10:46",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Bukook",
                                                                                                    "body": "Okay",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-05-21 04:12:04",
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "Deleted",
                                                                                            "body": "[deleted]",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-05-22 20:05:24",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Bukook",
                                                                                                    "body": "I think it is good to give work to immigrants if Americans don't want that work. I still think unemployment is a negative thing and want to see Americans working if they can and aren't busy with things like domestic labor or agricultural labor.\n\nI also think that we shouldn't allow corporations to exploit undocumented labor and suppress the value of legal labor. \n\nWe just need to agree to disagree.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-05-22 20:17:11",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Deleted",
                                                                                                            "body": "[deleted]",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2024-05-22 20:27:02",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Bukook",
                                                                                                                    "body": ">Do you think it’s a good thing to pay them pennies on the dollar? \n\nNo",
                                                                                                                    "score": 1,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2024-05-22 20:27:47",
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Malhavok_Games",
                                                    "body": "Crime. Unemployment leads to dramatic increases in all sorts of crime, including violent crime.",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-21 13:43:22",
                                                    "replies": [
                                                        {
                                                            "author": "Yogurt_Ph1r3",
                                                            "body": "No, poverty leads to a dramatic increase in crime.\n\nThis is a two birds one stone situation.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-21 13:45:36",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Electronic-Ad1037",
                                            "body": "why does it matter the nationality",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-21 00:57:45",
                                            "replies": [
                                                {
                                                    "author": "Bukook",
                                                    "body": "Because a nation should focus on helping their people find work. Low unemployment is good for a nation.",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-21 00:59:58",
                                                    "replies": [
                                                        {
                                                            "author": "ButtStuffingt0n",
                                                            "body": "So is competition. In fact, that's built into the American fabric. The work should go to the most capable workers, should it not?",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-22 17:19:34",
                                                            "replies": [
                                                                {
                                                                    "author": "Bukook",
                                                                    "body": "No, I think we should value our neighbors more than we value competition.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-05-22 17:20:35",
                                                                    "replies": [
                                                                        {
                                                                            "author": "ButtStuffingt0n",
                                                                            "body": "Our neighbors descended from immigrants. What difference does a generation make? Nationalism is completely illusory.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-05-22 18:10:31",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Bukook",
                                                                                    "body": "I see my neighbors as an extension of my family and feel obligated to help them. Sorry my dude.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-05-22 18:18:48",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Oceanspray94",
            "body": "Immigration is about votes though",
            "score": 8,
            "depth": 0,
            "timestamp": "2024-05-19 12:54:58",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Id say its more about cheap labor, you dont see many people from already developed countries flopping around to help out the work force unless they get big contracts or had already studied abroad, usually the cycle is we fuck around in distant countries, cause instability abroad, then import those people looking for a decent life to enslave them in cheap labor, in turn causing instability at home, world leaders have this all more than figured out, they dont mind things like job insecurity and racism, it doesnt hit close to home for them, and it keeps us all divided so we always point fingers at the wrong people.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-05-19 14:51:59",
                    "replies": []
                },
                {
                    "author": "TomMakesPodcasts",
                    "body": "Right? Like the Cuban population of Florida who overwhelmingly votes conservative. Immigrants are a monolith and all share the same hive mind!",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2024-05-19 13:06:03",
                    "replies": [
                        {
                            "author": "tiredoftheworldsbs",
                            "body": "I swear these people are absolute morons. Nothing in that skull of theirs.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-19 13:52:25",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HaveCamera_WillShoot",
            "body": "Faschism is always the easy answer for the fearful during times of economic downturn and employment instability.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-20 15:09:54",
            "replies": []
        },
        {
            "author": "BobertTheConstructor",
            "body": "Every single time automation has taken jobs, new jobs that didn't exist before come about. You haven't demonstrated why you think this won't happen, or why you think that just because AI will be able to do jobs means that every company who has those jobs will have AI do them. There is still a large market for handmade goods compared to mass produced, because they simply aren't the same. The principle applies here as well.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-19 11:23:11",
            "replies": [
                {
                    "author": "sault18",
                    "body": "This time is different. There are no prospects on the horizon for masses of \"AI\" programmers to replace a lot of the jobs that AI will make obsolete. Previously, automation created a lot of technician, engineering, logistics, etc jobs as it destroyed laborer jobs. Now, AI could be so ubiquitous that it programs itself, it designs whole systems, supply chains and production lines itself, most of which will be automated too.\n\nAny company that doesn't pursue ruthless efficiency through AI will get out-competed, bought out or otherwise made redundant by companies that do.\n\nEven now, handmade goods don't provide enough employment for even a fraction of the workforce that will be unemployed by AI. If disposable income falls dramatically for 99% of the population, there will be even less demand for hand made goods. Most people will only be able to afford the cheap crap AI can crank out.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 12:26:28",
                    "replies": [
                        {
                            "author": "BobertTheConstructor",
                            "body": ">Now, AI could be so ubiquitous that it programs itself, it designs whole systems, supply chains and production lines itself, most of which will be automated too. \n\n\nThis is pretty wild conjecture and you have not provided anything to support it.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-19 12:32:39",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "imnotabotareyou",
            "body": "Based",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-05-19 22:37:10",
            "replies": []
        },
        {
            "author": "EriknotTaken",
            "body": "Just to be clear and precise:\n\nare you talking about not letting people come from nearby cities, nearby counties, or nearby continents?(or nearby Planets if it were the chance?)\n\nWhere do you draw the line? \n\nOr maybe just nearby *cultures*?(Which changes a lot the argument because if they already live there are not migrants)",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-05-20 19:21:21",
            "replies": []
        },
        {
            "author": "FinalInitiative4",
            "body": "This is where they continue importing millions anyway, replace the office blocks with endless hellish apartments to satisfy the landlords and shareholders.\n\nThey will tell us it is for our own good, the diversity is our strength.\n\nThey'll then reluctantly allow us to have a basic income, but we will only be able to spend it on \"approved\" goods and to consume.\n\nThe endless influx of migrants will also be given this as them using their credits on the approved goods helps the lines go up for the \"correct\" companies and shareholders that control the government.\n\nYou'd better not participate in any wrongthink though, otherwise they'll just freeze it all and you won't be able to do anything. That's if they don't just black bag you for extremist ideas.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 10:27:26",
            "replies": []
        },
        {
            "author": "WatchingyouNyouNyou",
            "body": "Immigration is to destroy current poors and making sure no babies get made",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-05-19 10:40:32",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Only poor people can afford to have babies.  If you are middle class following the rules you can't afford anything.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 11:12:24",
                    "replies": []
                }
            ]
        },
        {
            "author": "Felix_111",
            "body": "Like how the self driving car changed everything?",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-19 11:56:08",
            "replies": [
                {
                    "author": "guava_eternal",
                    "body": "Self driving car? Shizzz- try my automated flying car",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 12:07:23",
                    "replies": []
                }
            ]
        },
        {
            "author": "Accomplished-Leg2971",
            "body": "The scenario you describe has us ruled by a handful of billionare oligarchs who own the automation. We will live and die at their whim. Immigration would make absolutely no difference.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-05-19 12:04:41",
            "replies": []
        },
        {
            "author": "Alice_D_Wonderland",
            "body": "Or maybe that’s not point of immigration…",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 12:51:59",
            "replies": [
                {
                    "author": "rzelln",
                    "body": "If there are no jobs to take, then immigrants . . . \\*aren't\\* taking our jobs? So it's fine to let them live wherever they want?\n\nI mean, to be clear, the real problem has never been immigration. It has been over-concentration of wealth that grants a small group of people power to get away with mistreating those who have less power. An AI being corporate controlled is the real concern.\n\nThe oversight of AI needs to be democratized, and the profits need to be democratized too. Letting a small number of executives make decisions that affect so many people is contrary to the principles of American freedom and representative government.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 12:57:31",
                    "replies": [
                        {
                            "author": "Alice_D_Wonderland",
                            "body": "You sure you’re replying to the right comment? 🤷‍♂️",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-19 13:41:23",
                            "replies": [
                                {
                                    "author": "rzelln",
                                    "body": "OP was doomsaying about AI eliminating people's ability to find jobs.\n\nYou said that maybe that's not the point of immigration.\n\nI thought you were arguing that immigration is not about finding work, but about choosing where you want to live. I mean, people move to different states to go somewhere with legal weed, or abortion access, or whatever. \n\nI thought you were espousing a sort of \"right of freedom of movement\" philosophy, and I was agreeing with that. The most common critique of immigrants is that they're taking jobs, but if AI takes jobs instead, then what's the reason for telling people they can't immigrate?\n\nThen, since the overall topic of discussion was AI, and I was mentioning how AI relates to leaving people in economic distress if they can't find jobs, I wanted to state my main concern with, like, the economy as a whole. It's not that AI or immigrants or whatever are taking jobs; it's that we have a society that allows for unethical wealth concentration, instead of building systems to distribute wealth to foster shared well-being.\n\nThe long-term ideal for human society is for us all to enjoy a life of self-actualization, leisure, and pursuit of whatever knowledge or creativity or exploration we find rewarding. Let the machines toil for us, and have the government distribute the profits among everyone. Work can be optional for most humans. And when it is, the only limit to immigration ought to be that some property might be expensive, so you'd have to do something valuable to be able to afford it.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 14:44:44",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "There was never much need for immigrants from anywhere except Mexico. We definitely need Mexicans and AI isn’t going to replace them anytime soon.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 16:39:28",
            "replies": [
                {
                    "author": "tyler98786",
                    "body": "Seriously. Does this guy think ai is going to be going out into the fields too? I am concerned as well about automation, but it's increasingly becoming clear to me that it is a bigger threat to white collar, IT, office, and STEM workers than any others. And those that are most likely to withstand the effects of such automation will be in more physically taxing jobs, as well as jobs that require a human touch like therapist and social worker.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 17:48:55",
                    "replies": []
                }
            ]
        },
        {
            "author": "pyzazaza",
            "body": "Read up on austrian economics, this is a complete fallacy and just not true. The entire development of civilisation from hunter-gatherer to modern technology has led only to exponential growth in output, productivity and quality of life, and despite the highest level of technology and automation that we've ever had in human history, we now have far more humans employed at work than we have ever done before. Stop doomsdaying AI with regard to jobs, it's nonsense.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-20 03:32:14",
            "replies": [
                {
                    "author": "rallaic",
                    "body": "Just as a thought experiment, let's assume that AI will be able to take a stack of knowledge, and answer questions correctly based on that knowledge. \n\nThat is a not insignificant portion of work in the service industry. While it does lead to increased output, it eliminates the job of \"knowing how it works\". This is a twofold problem;  \nOn one hand, the first step of onboarding at any company is knowing how what we sell works. It leads to deeper understanding of why it works like that, and possibly changing how it works to improve things. If you don't need people to do that, you will not have newcomers who learn how it works that can be promoted.   \nOn the other hand, higher understanding of complex systems is not an ubiquitous thing. There are many people who are stuck on the level of knowing how it works, (without deeper understanding due to their lack of ability) that can replaced by AI.  \n\nThe concern is that while telephone operators were replaced by machines, there were other jobs that needed similar skillset and ability. The threat of AI is in it's generic nature, it can replace humans anywhere, and due to the obvious cost and consistency benefit, it will.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-20 06:06:45",
                    "replies": [
                        {
                            "author": "pyzazaza",
                            "body": "As did the agricultural revolution, the industrial revolution, and so on. Humans are amazing at finding new things to busy ourselves with. Improved efficiency in the industries that already exist just provides more capital and labour to be put towards developing new industries and providing new services. This \"challenge\" has already happened in every facet of the economy at some point in the past and AI is no more threatening than any of that.\n\nJust to clarify, I am not including in that statement the capacity for AI to cause damage by means of its self-sentience and ability to hallucinate etc - that stuff is terrifying, but the concept of it destroying the economy by being too efficient is patently ludicrous.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-20 06:32:38",
                            "replies": [
                                {
                                    "author": "rallaic",
                                    "body": "The concern is that the labor you have freed up is the same labor that was made redundant by AI, and you still have said AI. It is true that AI will not make new inventions by itself, but neither most people. To put it differently, the best most people can do is use the knowledge of those that came before, and AI can do that. \n\nIt is certainly possible that there will be an uptick for handmade goods, artisans, or any physical thing that would need an interface to the world, but all that takes is one \"robot arm\". What remains is jobs where automation is not cost effective (yet), but these should remember the lift operator strike and be happy that they still have something.\n\nWhat I find fascinating in this scenario is how companies would deal with the reality that they need years of training for a worker to become effective.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-05-20 12:31:59",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Cedleodub",
                    "body": "There is a limit to the human capacity to invent new jobs to replace those jobs lost to automation or A.I.\n\nWe're already at a point where there's consultancy firms doing consulting for other consultancy firms who themselves are doing consultancy for an actual project.\n\nWe've already very close to the limit of \"bullshit jobs\" as it is...",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-20 14:17:50",
                    "replies": [
                        {
                            "author": "pyzazaza",
                            "body": "Like i said, this way of thinking is pure fallacy. If the purpose of the economy was to maximise employment, rather than to maximise output, then we would be better off unwinding the industrial revolution and we would have 100% employment as everybody including children and elderly would be doing manual labour in order to keep rooves over our heads and food in our stomachs.\n\nClearly that is not ideal, and mechanisation and automation have led to a huge rise in output and wealth, even though employment is below 100% (and close to zero for children and the elderly - god forbid!!) Do you see the fallacy yet? The real objective is maximisation of output and wealth, not employment.\n\nIf a worker is laid off by AI and does something else remotely positive, however small, the global net wealth creation has increased.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-20 14:27:34",
                            "replies": [
                                {
                                    "author": "Cedleodub",
                                    "body": ">If a worker is laid off by AI and does something else remotely positive, however small, the global net wealth creation has increased.\n\nif that worker is laid off and can't find another job to pay the bills, how is that positive?\n\nthe only fallacy here is to think that humans will always be able to create new jobs out of thin air to replace those lost to automation and A.I.\n\nthinking otherwise is naive and stupid",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-05-20 14:33:34",
                                    "replies": [
                                        {
                                            "author": "pyzazaza",
                                            "body": "Because given more free labour and free capital we will find endeavours to increase productivity and output. It is inevitable as the entirety of human history teaches us. Look at what we have achieved thanks to additional education since not requiring child labour. Look at what we have achieved since 90%+ of the agriculture and manufacturing sectors became decimated by mechanisation. Not only have we retained a good level of employment, not only do we now employ billions of people globally rather than tens or hundreds of millions, not only have we invented retirement for the elderly, but we have also massively increased wealth and prosperity.\n\nTo believe we are not capable of improving the economy by introducing further labour-saving technology is entirely baseless.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-20 14:46:05",
                                            "replies": [
                                                {
                                                    "author": "Cedleodub",
                                                    "body": ">It is inevitable as the entirety of human history teaches us.\n\nExcept that there's been nothing like that upcoming A.I. revolution in the entirety of human history. A.I. does not offer new opportunities for job creation like previous technologies, it almost entirely replaces existing jobs, *especially* when we'll have a mass market of self-driving vehicules, in addition to more A.I. powered robotics.\n\nAgain... you can hide your head in the sand pretending that we'll just create millions of completely new jobs out of thin air in a few decades... but that's just not what's gonna happen.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-20 15:10:55",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Supernothing-00",
                    "body": "Exactly, I was about to mention that and also that it’s not about “needing migration” if I’m not violating somebody else’s property I should be allowed to go where I want because that’s my right regardless of whether the country “needs” me",
                    "score": -2,
                    "depth": 1,
                    "timestamp": "2024-05-20 04:17:03",
                    "replies": [
                        {
                            "author": "pyzazaza",
                            "body": "Ehh mises loses me a little there tbh, I think in some respects we have to accept that social values are going to cause limits on economic output, and yes it might make most sense from a purely hypothetical standpoint to say that migration should be unlimited, but there is a clear social incentive to control migration because the world is not culturally homogenous. Realistically a balance has to be struck somewhere and if that means less optimal economic output then we just have to live with that.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-20 04:44:31",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Waxitron",
            "body": "Can't AI your way out of needing people to do labour jobs. \n\nEveryone thinking AI is going to do much in the next 10 years are the same people who thought 3D movies were going to be the next big thing 10 years ago.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-19 22:58:48",
            "replies": [
                {
                    "author": "dataslinger",
                    "body": "This. AI isn’t going to work in the meat packing plants or construction or agriculture or the tons of other sectors that are heavily staffed by immigrants.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-05-20 00:51:23",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "Same people that bought dogecoin or trumpcoin or whatever. They had one very bad experience with it so now it's an all powerful devil",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 23:58:03",
                    "replies": []
                }
            ]
        },
        {
            "author": "Carbon140",
            "body": "The immigration is to make sure that society is so fractured and fighting among themselves they can't unify against the rich, not for new workers. The pychopaths at the top are one step ahead. Explains why the politicians generally don't seem to give two shits about what quality the immigrants are. Have fun, dystopia certainly awaits, there will be no jobs or ubi just a police state and an ever increasing barrage of media pointing at anyone but the rich.",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-05-19 07:58:30",
            "replies": [
                {
                    "author": "Cronos988",
                    "body": "Or maybe all the constant fear mongering about immigration is meant to keep society fighting among itself so it cannot unify.\n\nMore likely though, there's no appetite to \"unify against the rich\" in the first place, since that'd mean trading security and comfort now for future gain, and all evidence suggests that humans are terrible at making such tradeoffs.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-19 08:32:05",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "If this happens, and there’s a good chance it does, the people who think trump are extreme are going to be in for a rude awakening with whoever else might energize the disenfranchised.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 07:55:37",
            "replies": [
                {
                    "author": "Cronos988",
                    "body": "It would certainly make sense - from the position of the owners of capital - to redirect the anger of workers towards other workers.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 08:50:55",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "I could definitely see a America first typ party rising up and kicking people who have lived in the USA for generations",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-19 08:11:32",
                    "replies": []
                }
            ]
        },
        {
            "author": "plummbob",
            "body": "When excel was invented people thought accountants would be out of a job.\n\n\nBut the lower marginal costs just led to more demand from firms to redo their books and there are more accountants than ever before.\n\n\n\nBegone luddites",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 11:50:54",
            "replies": [
                {
                    "author": "blazershorts",
                    "body": "I'm sure tons of people did lose their jobs, though.  When's the last time you heard of a \"clerk\" or \"bookkeeper?\"",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-19 13:01:03",
                    "replies": [
                        {
                            "author": "plummbob",
                            "body": "You mean the guy at the register who also stocks shelves?    The 1940s image of the dude just constantly sweeping, wearing thr old timey apron?\n\n\nThe \"bookkeeper\" is just the accountant.   For a simple store, maybe you manage your own books.   But given the complexity of taxes and ever changing financial needs, the average storess hire accountants.   \n\n\nAnd the lower the marginal cost for a \"unit\" of accounting services, the more was demanded.    \n\nTurns out, the needs of companies wasn't singular, and as the price of the marginal accounting service fell, the more firms would hash out alternative scenarios for the accountants to simulate, doing in a few hours what would of taken weeks in the 1960s or 70s.\n\n\n\nAnd as it turns out, a cpa,, despite 30 years of computerized automation, can earn more now than ever before.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-19 13:12:53",
                            "replies": [
                                {
                                    "author": "blazershorts",
                                    "body": ">You mean the guy at the register who also stocks shelves? The 1940s image of the dude just constantly sweeping, wearing thr old timey apron?\n\nThat's a sales clerk.  There used to be office clerks (think Bob Crachitt from a Christmas Carol) to do sums and figures.  Like how you'd hear about people \"balancing a checkbook.\"",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 13:52:09",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Puzzleheaded_Space69",
            "body": "It is going to be a big change  when A.I  develops further.\n Note the effect robotics created in the manufacturing field as a comparison, many jobs were made obsolete.\n Telecommunications, food production and other fields  were effected by robotics...but A.I.  may be the proverbial nail in the coffin , complete automation.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-20 01:08:56",
            "replies": []
        },
        {
            "author": "PrimalForceMeddler",
            "body": "This massively over estimates what ai is or will be capable (not to say it's not a big innovation) and underestimates capitalism's fundamental need for human labor (to exploit).",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-19 12:30:15",
            "replies": [
                {
                    "author": "white_collar_hipster",
                    "body": "And also doesn't mention the amount of jobs AI will create that no one has even thought of yet.  The displacement will be targeted to specific industries, not a global effect.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 13:07:17",
                    "replies": []
                }
            ]
        },
        {
            "author": "Mendetus",
            "body": "Soldiers.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 08:59:52",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "This guy gets it",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:03:11",
                    "replies": []
                }
            ]
        },
        {
            "author": "boston_duo",
            "body": "AI will not clean facilities or pick and plant crops.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 12:08:44",
            "replies": [
                {
                    "author": "y2kcockroach",
                    "body": "Machines to harvest fruits and vegetables have been in service for 50 years (my parents rented raspberry and blueberry harvest machines for our farm in the early 1980's), and we now have machines to mow our lawns, feed our pets, vacuum our houses and even organize and clean/disinfect hospital floors. Amazon and Walmart are now testing driverless delivery vehicles, and fast-food restaurants are now testing drive-thru's that use robots/AI to take orders and prepare/deliver the food. Each one of these technological advances has contributed to making workers redundant. We are only scratching the surface on this.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-19 13:09:10",
                    "replies": [
                        {
                            "author": "boston_duo",
                            "body": "And yet there is still a national shortage of farm laborers, despite these machines. They can’t do everything.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-05-19 13:10:29",
                            "replies": [
                                {
                                    "author": "y2kcockroach",
                                    "body": "It is a process that takes time, but it has been happening for several decades already. In my parent's experience, there wasn't a shortage of raspberry pickers, there became a shortage of raspberry-picking *machines*. The machines are faster, more accurate, more reliable, and in the long-run less expensive to the overall harvesting process.\n\nI'm not arguing that humans have already become redundant, but I am saying that to be competitive in the evolving economy of ours machines and AI are going to be essential. To use my parents' humble example, those farmers that use humans to pick raspberries and blueberries are not financially competitive with those that use machines for the same purpose.\n\n50 years ago many people said that the auto industry would never be able to use machines to build cars, due to the complexity and the unreliability of machines for the task. Now, nobody builds cars by hand.\n\nWe have time to deal with this, but we must use the time that we have, to deal with this.\n\n\\*edit\\* down-voting me isn't going to change the future, lol.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 13:19:11",
                                    "replies": [
                                        {
                                            "author": "boston_duo",
                                            "body": "You’re missing the point. OP is saying that there’s no need for immigration TODAY. It doesn’t matter if a machine can shake and collect from a raspberry bush faster than your mom and dad— plenty of industries still need low wage manual laborers TODAY, despite the fact that these machines have existed for decades. Humans are still not obsolete by any means today and that isn’t going to change.\n\nRemember that slavery didn’t end with the invention of the cotton gin.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 13:24:36",
                                            "replies": [
                                                {
                                                    "author": "y2kcockroach",
                                                    "body": "\"OP is saying that there’s no need for immigration TODAY.\"\n\nI don't see that anywhere in their post. The premise of their essay is that we are importing millions of people to expand a labor force that is going to be shrinking in demand, due to the displacement brought about by AI. They are correct in that.\n\nAs for me, I don't think that I am \"missing the point\". I wrote above that \"(i)t is a process that takes time\", and I believe that is consistent with what OP is expressing.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-19 13:28:32",
                                                    "replies": [
                                                        {
                                                            "author": "boston_duo",
                                                            "body": "Just read the title dude. \n\nThere is still an unmet demand for human labor in this country, despite like 200 years of exponential innovation year over year that has never been seen in human history. We still need immigrant labor today and actually don’t have enough of it despite massive waves of newcomers here. \n\nAI will absolutely change things, but it will not eliminate the need for human labor. It’s naive at best to believe we should completely stop immigration today because an unproven prospective technology is going eventually take everyone’s jobs. When and if that day comes, they’ll stop coming because they’re no longer in demand. That’s how capitalism works. Not the other way around.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-19 13:49:06",
                                                            "replies": [
                                                                {
                                                                    "author": "y2kcockroach",
                                                                    "body": "I agree with everything that you have written, and I accept that a literal interpretation of the title would suggest that the OP is advocating for a stop in immigration (however I don't think that the essay itself says that).\n\nWe aren't going to run out of the need for human labor, but we need to seriously re-think the role of human labor going forward, and adjust our immigration policies accordingly. New industries will be created, new demand for human capital will be created, and we need to ensure that human resources meet the demand that is to come (not the one that has been). Over the course of my working lifetime I have seen the dislocation of low-skills, low-information workers in the auto industry, the mining industry, the forest/sawmill industry, the agricultural/food processing industries, and the shipping industry. Next up is the aircraft manufacturing industry (Boeing is arguing that it is more machines that are going to solve its quality-control issues on the shop floor, and while they are on something of a quiet hiring binge they aren't hiring back \"Rosie the Riveter\").\n\nMy point in this discussion is that with the ongoing advances in AI/robotics, we need to devote resources into ensuring that our present workforce is able to adapt to new and evolving industries, and that we need to devote attention to an immigration policy that complements the demands of new and evolving industries. I just don't think that any of that is radical or unreasonable (I do think that those who argue that it is not an issue are creating a recipe for disaster).",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-05-19 13:57:26",
                                                                    "replies": [
                                                                        {
                                                                            "author": "boston_duo",
                                                                            "body": "Not unreasonable at all, but that’s how it should be presented lol. At the end of the day, this country isn’t making enough laborers for the next generation and the millions of immigrants coming still hasn’t met the current demands of today. As for people like miners foresters, etc.. how many refuse to transition from outdated industries today and become skilled in emerging green energy markets (for example)? We’re understaffed on the other side of change as well. Are we supposed to just believe that people will suddenly start working these jobs now that immigrants aren’t here?\n\nSimply put, immigrants largely come to do the jobs that our citizens refuse to. I don’t see that changing anytime soon, if ever.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-05-19 14:08:12",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "aaronsnothere",
                    "body": "Really, but I've seen so many 8-12 fingered janitors recently...",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-19 13:37:52",
                    "replies": []
                }
            ]
        },
        {
            "author": "Mellllvarr",
            "body": "In fact countries with low birth rates like Italy and Japan are probably going to enjoy the future reality of a mandatory living wage.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-05-19 16:40:37",
            "replies": [
                {
                    "author": "Sufficient-Law-6622",
                    "body": "How would a collapsing economy with more retirees than workers create UBI? \n\nBoth of those countries are going broke. Also, do you know absolutely anything about Japanese work culture? NEETs are basically considered untouchables and have to hide from society due to intense shaming.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 18:02:46",
                    "replies": []
                }
            ]
        },
        {
            "author": "ThrowawayFuckYourMom",
            "body": "AI WONT FUCKING LIFT BRICKS THO WILL IT?? WILL AI WIPE GRANDPAS ASS, TOO, BUDDY?? OR NAIL A BUILDING TOGETHER?? OR FUCKING CLEAN THE SEWAGE??\n\nThe dumbest title I have read in all my years. TIL eveery job is the exact same one and can be replaced by a sufficiently smart calculator.\n\nEdit: after reading, I was so fucking right, there are jobs we've had since the dawn of mankind that no glorified excel-sheet will be able to do, unless we get a huge re-do of infrastructure in these departments. And it's mostly these jobs that immigrants do.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-20 03:39:05",
            "replies": [
                {
                    "author": "ZOMGTeep",
                    "body": "To play devils advocate, let’s say immigrants do all of the jobs that won’t be taken by AI. That means the native population will be unequally affected by AI, and will need retraining for new roles. That’s not going to end well if you say “sorry, migrants are doing those roles so you can’t do those jobs”. \n\nI understand what you’re trying to say, but I just don’t think you’ve explained the your position well, considering the logical conclusions you can draw from your post.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-05-20 05:37:04",
                    "replies": [
                        {
                            "author": "ThrowawayFuckYourMom",
                            "body": "I agree that if 100% percent of labour jobs would be replaced by immigrants, and 100% of service jobs are replaced by AI, but this justs simply isn't feasible. Not only in the mere numbers and tasks form (How can 14% replace the work of the remaining 86%, even if half of that is service work?) but also on a second point: If no native has a job, they won't have the money to buy the coffee's and burgers, and they will be left to starve. So, supply goes up and demand goes down, and no one gives a fuck about this type of market anymore.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-20 09:44:29",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nightswimsofficial",
                    "body": "Calm down",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-20 11:15:20",
                    "replies": []
                },
                {
                    "author": "Cedleodub",
                    "body": ">AI WONT FUCKING LIFT BRICKS THO WILL IT?? WILL AI WIPE GRANDPAS ASS, TOO, BUDDY?? OR NAIL A BUILDING TOGETHER?? OR FUCKING CLEAN THE SEWAGE??\n\nno, but the people whose job has been replaced by A.I. will do these jobs instead because they'll have no other choice\n\nseriously, it's not hard to understand",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-20 14:12:02",
                    "replies": [
                        {
                            "author": "ThrowawayFuckYourMom",
                            "body": "No they won't, what do you mean? How are large corpo's going to make a profit if 100% of their customers can no longer afford the product? So they scale down, or go bankrupt. Lobbying kicks in, workers unions kick in, crisis averted, as it was when we thought the cars would replace the doves, and airplanes would replace the cars. The market finds solutions in ways we didn't and could't previously percieve.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-20 16:04:33",
                            "replies": [
                                {
                                    "author": "Cedleodub",
                                    "body": "this naive confidence into 'the market' is almost religious to you guys\n\nthe reality is that we're not talking about cars replacing carriages or emails replacing mail... this upcoming A.I. revolution is something completely different\n\nA.I. replaces existing jobs, a lot of them, with very few created in return... which means \"the market\" will have to create possibly millions of brand new jobs to compensate in only a few decades... it's just not gonna happen",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-20 17:03:29",
                                    "replies": [
                                        {
                                            "author": "ThrowawayFuckYourMom",
                                            "body": "The market has never created millions of jobs in a decade. lol",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-20 19:05:40",
                                            "replies": [
                                                {
                                                    "author": "Cedleodub",
                                                    "body": "I'm glad that you finally agree with me",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-21 22:06:03",
                                                    "replies": [
                                                        {
                                                            "author": "ThrowawayFuckYourMom",
                                                            "body": "NO YOU APE IT OBVIOUUSLY HAS A DONE THAT A MILION TIMES: AMAZON, YOUTUBE, TAXIS, PROFESSIONAL SOLDIERS, DO YOU KNOW HOW FUCKING SMALL THE NUMBER IS YOU CITED??",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-22 01:46:59",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "tidaltown",
                                    "body": ">workers unions kick in\n\n*laughs in USA*",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-20 19:10:17",
                                    "replies": [
                                        {
                                            "author": "ThrowawayFuckYourMom",
                                            "body": "If you think you have weak unions, just look at the cops; strongest union either side of thr equator",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-20 19:45:48",
                                            "replies": [
                                                {
                                                    "author": "tidaltown",
                                                    "body": "That’s the one union left with teeth here and pretty much everyone hates it. That and the MLB’s umpire union.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-20 19:47:18",
                                                    "replies": [
                                                        {
                                                            "author": "ThrowawayFuckYourMom",
                                                            "body": "You're not suppose to like unions. The whole point is to protect workers from the whims of the market: inherently controversial.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-20 19:56:35",
                                                            "replies": [
                                                                {
                                                                    "author": "tidaltown",
                                                                    "body": "I do like unions. I want workers to be able to stand up for themselves and the best way to do that is collectively.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-05-20 19:57:05",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Jeb764",
                            "body": "Sure they will.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-20 15:35:27",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Comfortable_Note_978",
            "body": "The power elite don't want even the menial jobs to go to citizens; they think that foreigners are easier to control.  Certain immigrants in Europe and Canada may give the lie to this conceit.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 09:08:30",
            "replies": []
        },
        {
            "author": "Sip-o-BinJuice11",
            "body": "No. No, this is just thinly veiled paranoia over the same argument ever since Bush Jr. ‘They took our jerbs’ was barely a funny joke when it aired on South Park, now it’s just sad.\n\nWhen does this fear of people who don’t look like you end? Even if you had a point about the job market, there simply isn’t a reasonable way to enforce the kind of ideology reflected by this argument. No matter how you slice it it turns into extremely idiotic racial profiling over what ifs and perceptions that don’t quite align, and then your icing is ‘there’s just no need’ - which, again, even if that were true, and it’s not, even if there *weren’t*, which there **is**, you aren’t going to get your end result that way in the first place.\n\nIs there a reason, a must, a NEED, for someone to step foot somewhere other than their own home? Not always. Doesn’t mean they won’t do it.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-05-19 08:45:39",
            "replies": [
                {
                    "author": "anticharlie",
                    "body": "It’s racism, pure and simple. We had it in the 19th century with the Irish and Italians, in the early 20th century with the Asian immigrants, and we have it now with Middle Easterners and Latin Americans. \n\nThe people who worry about this are never going to work in a chicken plant, or wash dishes in a restaurant. Machine replacements for these jobs are far away just because the initial investment will be high, and the people who hold anti immigrant views will never get mad enough at the employers who hire illegal immigrants either. We need a bigger guest worker program and a path to citizenship.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:23:29",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "Get educated dude.\n\nThey are here to wipe us out. Its not about \"jerbs\"\n\nWise up or get steamrolled when things inevitably get bad\n \nIm worried for you",
                    "score": -9,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:04:06",
                    "replies": [
                        {
                            "author": "TheCynicEpicurean",
                            "body": "Please, illuminate who exactly will get 'wiped out' and what exactly the consequence will be.\n\nWill I be put in front of a firing squad for being white?",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-05-19 10:02:02",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FreeTeaMe",
            "body": "Jobs will only be for those who want them. You should be able to live perfectly well with not working.\n\nThe entire economy needs to be restructured and Capatalism scrapped not by revolution but by gradual evolution. I think it was the Finish finance minister who gave a model for the transition.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 08:37:03",
            "replies": [
                {
                    "author": "irespectwomenlol",
                    "body": "> You should be able to live perfectly well with not working.\n\nThis only works with Star Trek level technology where there's essentially no scarcity as goods and energy are basically free.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-05-19 08:45:38",
                    "replies": [
                        {
                            "author": "ChronaMewX",
                            "body": "So basically in our current society, just slightly restructured",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-19 09:17:08",
                            "replies": [
                                {
                                    "author": "irespectwomenlol",
                                    "body": "I disagree. Our current society doesn't have essentially unlimited energy and manufacturing available to it.\n\nMaking something as simple as a pencil involves mining metal, graphite, rubber, wood, various chemicals, and a whole bunch of industrial processes to form the finished product.\n\nWho is doing this labor for free? Who is transporting all of the raw materials to the factory for free?",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 10:39:43",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Takonite",
                    "body": "communism doesnt work in an environment with limited resources, and even then it won't work with how our sexuality does",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-19 08:51:10",
                    "replies": [
                        {
                            "author": "Dangerous-Cheetah790",
                            "body": "what",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-19 09:18:38",
                            "replies": []
                        },
                        {
                            "author": "cheesyandcrispy",
                            "body": "😂",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-19 10:17:13",
                            "replies": [
                                {
                                    "author": "FreeTeaMe",
                                    "body": "The model you are referring to was proposed by Finnish thinker Heikki Hiilamo. His idea suggests that as companies increasingly automate jobs, a larger percentage of the company's market capitalization would be owned by social security systems or the state. This approach aims to ensure that the financial benefits of automation are redistributed to support public welfare and mitigate the negative impacts of job losses due to automation [oai_citation:1,Nordic model - Wikipedia](https://en.wikipedia.org/wiki/Nordic_model) [oai_citation:2,Scandinavian 'Socialism': The Truth of the Nordic Model - Life in Norway](https://www.lifeinnorway.net/scandinavian-socialism/).\n\nThis model aligns with the broader principles of the Nordic economic model, which emphasizes social equity, strong welfare states, and collective ownership to support a more inclusive economy. By linking company ownership to automation levels, this model seeks to create a more equitable distribution of wealth generated by technological advancements.\n\nFrom Gpt4o",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 10:32:14",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "fatzen",
            "body": "This sounds like reasoning backwards from “I don’t want immigrants”. \n\nSo we should cease all immigration because we don’t know what impacts AI will have on the labor market over the next 20 years? Is that the general thrust?",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-05-19 10:30:32",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "We should stop immigration while the housing market catches up but we are run by morons.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-05-19 11:12:58",
                    "replies": [
                        {
                            "author": "plummbob",
                            "body": "Who do you think builds the housing?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-19 11:56:01",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "The folks that are already here.  It takes years to learn a trade and most of them have been here for years.  The illusion that immigrants can come here and get started in construction is a myth.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 14:12:22",
                                    "replies": [
                                        {
                                            "author": "plummbob",
                                            "body": "It takes less public $ to teach a 18 year old immigrant a trade than it does a native child",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 14:14:56",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "matrixagent69420",
                            "body": "More immigration is better, diversity is our biggest strength. We’ll make it work",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-19 11:42:34",
                            "replies": [
                                {
                                    "author": "y2kcockroach",
                                    "body": "We need immigration and the talent that comes with targeted immigration, but what you offered up is little more than a tired bromide. This is 2024, not 1983.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 13:41:26",
                                    "replies": []
                                },
                                {
                                    "author": "Deleted",
                                    "body": "What is diverse about taking a city like Brampton in the 90s, composed of a variety of ethnicities, and doubling, trippling or quadrupling the population with immigrants largely from 1 or 2 countries.  That is the opposite of diversity.  This is what our government has done and would like to continue to do.  So when you say diversity, I ask, what is diverse about bringing all your immigrants from 1 or 2 countries?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 14:07:15",
                                    "replies": [
                                        {
                                            "author": "powderpuffgirl123",
                                            "body": "hes trolling",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-30 14:24:41",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "knign",
            "body": "It’s very rare that new technology directly “destroys job”, that is, simply replaces workers with machines. More often than not, technology makes workers more productive so we potentially need fewer of them. \n\nTo that end, there is almost no profession which hasn’t benefited from introduction of personal computers, internet and smartphone, and yet a cataclysm of hundreds of millions unemployed people and societal collapse failed to materialize. \n\nAI is an amazing technology with big potential , but so far it failed to even make fully reliable self-driving cars, so all this panic about super-smart AI’s replacing everyone is quite a long way off.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-05-19 10:14:40",
            "replies": [
                {
                    "author": "Ottomanlesucros",
                    "body": "If you knew anyone who worked in tech you wouldn't say nonsense like that, it's indisputable that AIs will be a net destroyer of jobs, en masse.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-19 11:32:09",
                    "replies": [
                        {
                            "author": "BigHawkSports",
                            "body": "It is absolutely disputable that AI will be a \"net\" destroyer of jobs. At this point, we can only speculate about what the broad adoption of AI will mean for the workforce. \n\nA lot of low - to mid-level jobs that exist because \"well, one person can't do everything here\" will be able to be automated to a greater extent but they still won't be able to be automated entirely.\n\nRemember that \"the economy\" isn't a thing, it's just the collective efforts of humans to enrich themselves. AIs has no such needs. AI will be deployed to reduce costs as much as feasible and humans will, for the nteenth time since we first figured out how to make fire, reorganize our society around our new tools. \n\nIn the meantime, though, I'd recommend anyone who depends on low skill repetitive work for their living to work towards a more specific skill set.",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-05-19 12:23:44",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sugar_God_no_1",
            "body": "Opportunities brother",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-05-19 09:02:48",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "I don't disagree and my depression is back.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-05-19 11:11:46",
            "replies": []
        },
        {
            "author": "pronthrowaway124",
            "body": "It isn’t the labor force. They are trying to expand the goods and services base. Give them benefits and now your corp is getting govt income. \n\nGovt doesn’t care because, “look GDP went up! We did our job!” While borrowing 3T a year.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-05-21 10:01:43",
            "replies": []
        },
        {
            "author": "Just_Jonnie",
            "body": "There aren't hundreds of millions of jobs being destroyed.   \n\n\nMaybe tens of millions.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-05-19 11:31:07",
            "replies": [
                {
                    "author": "No-Possibility5556",
                    "body": "The way new tech blossoms new markets is be shocked if the net job displacement is into 7 figures, likely could be no net change even.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-19 12:52:55",
                    "replies": [
                        {
                            "author": "y2kcockroach",
                            "body": "Both you and the poster that you responded to make more sense than 90% of what is otherwise being expressed on this thread.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-19 13:31:10",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "west_country_wendigo",
            "body": "Let me know when AI provides social care for old folk.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-05-20 12:14:51",
            "replies": [
                {
                    "author": "DolphinPunkCyber",
                    "body": "But if programmers, artrists... lose their jobs they can get education and switch to nursing jobs.\n\n\nIf you simply import nurses, they can't.\n\n\nWhy the hell would you import workers if there isn't enough jobs for existing population?",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-05-20 13:01:47",
                    "replies": [
                        {
                            "author": "Yogurt_Ph1r3",
                            "body": "There is no such thing as \"Not enough jobs\" only \"poor allocation of resources that makes unemployment extremely undesirable/deadly\"",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-21 03:54:34",
                            "replies": []
                        },
                        {
                            "author": "west_country_wendigo",
                            "body": "Ah yes, computer programmers. Natural nursing people.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-20 13:57:46",
                            "replies": [
                                {
                                    "author": "XLV-V2",
                                    "body": "Dad went back for nursing in his 40s. He was a mechanic at a steel mill and used to be houses prior. Still does his own car mechanic work as a side hobby. Your view is mute.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2024-05-20 14:01:36",
                                    "replies": [
                                        {
                                            "author": "west_country_wendigo",
                                            "body": "Ah yes, singular anecdote = data.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-05-20 14:05:49",
                                            "replies": [
                                                {
                                                    "author": "XLV-V2",
                                                    "body": "We don't have people who drive coaches or pump gas for people (except NJ) these days. People move around in employment all the time. Those programmers would be able to pick up any skill set or experience as needed. \n\nKnow another guy who studied for engineering (didn't finish cuz of a weed charge). Eventually went back and got into the union in his late 30s.\n\nQuick making excuses for how supply and demand is actually supposed to work in a healthy capitalistic society. The only downside is not have a healthy immigration plan that targets skilled individuals solely.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-20 14:10:50",
                                                    "replies": [
                                                        {
                                                            "author": "west_country_wendigo",
                                                            "body": "What on earth gives you the impression you live in a healthy capitalist society? \n\nWhat normally happens to skilled labour that is made irrelevant to the economy is that they slump into menial jobs and unemployment. All you have to do is look at the rust belt and mining towns.\n\nProgressive is inevitable but pretending natural forces / retraining is enough is the same delusional nonsense that sacrifices each generation of skilled labour that's no longer needed.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-20 14:58:36",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DolphinPunkCyber",
                                                    "body": "My brother is 38, construction worker, huge strong guy.\n\nGoing to nurse night school... cant wait to see him wearing scrubs.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-20 15:26:29",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "stiljo24",
                                                    "body": "Ah yes, ah yes = retort\n\n(The joke here us you're starting all these comments with \"ah yes\" but then not saying much)\n\nI think I agree with your overall stance and am radically pro immigration, but you are deflecting from people's points here -- while a major shift in the labor landscape is very difficult, some people survive by following that shift. Not many, but some  If you've imported so many workers that there isn't a place to shift to, they are out of luck.\n\nNow my counter to that would be that a person doesn't deserve to withstand a shift any better cus of where they were born, but it's a fair point to say \"a country's natives will have a harder time finding work after their industry is destroyed if it's country has imported workers for every other industry, and that import of workers doesn't lead to a lot of job creation within that industry\" the latter part of which isn't super likely to happen in things like nursing",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-21 03:24:57",
                                                    "replies": [
                                                        {
                                                            "author": "west_country_wendigo",
                                                            "body": "The labour supply crisis in certain industries is now, the labour over supply crisis in most of the AI boosters examples are future and hypothetical. One person said radiologists were early on the chopping block. \n\nIf a developed country manages to get it's skilled labour to convert into different skilled labour en mass, it'll be the first time that's happened.\n\nTotally fine if you don't want immigration to fill supply gaps but that point never comes through thinking through the implications of aging populations and ending GDP-growth as default goals.\n\nWhat's becoming increasingly obvious with time is that pumping STEM only is basically leading to a discourse driven by people who understand tech a bit, but not history or people.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-21 03:59:15",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Deleted",
                                    "body": "You must be very young if you've never, ever experienced a dramatic career change or seen them happen to the people around you. It's very common to wear many different kind of \"hats\" throughout your career.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-05-20 16:56:18",
                                    "replies": [
                                        {
                                            "author": "west_country_wendigo",
                                            "body": "I'm almost 40. And I've seen plenty.\n\nIt's extremely funny to me that you think the person being naive is the one concerned about large chunks of skilled labour being able to pivot on a dime. \n\nAnyone thinking that just isn't aware of history, or even looking around at their own country.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2024-05-20 17:08:36",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Silverarrow67",
                    "body": "Society isn't even doing this. Boomers are one of the largest growing segments of homelessness in America. https://finance.yahoo.com/news/unconscionable-baby-boomers-becoming-homeless-103000310.html",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-20 17:45:54",
                    "replies": []
                }
            ]
        },
        {
            "author": "GordoToJupiter",
            "body": "I doubt the jobs immigrants are going to do are the ones AI will automate. You need an operator supervising, guiding and mantaining any robot.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-05-25 19:17:01",
            "replies": []
        },
        {
            "author": "Mr-GooGoo",
            "body": "There’s no need for immigration regardless",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-05-26 09:02:40",
            "replies": [
                {
                    "author": "shamalonight",
                    "body": "But there is a desire for more Congressional seats. The census may not count AI, but it does count illegal immigrants and gives them representation. If those illegal immigrants just happen to increase representation in Blue states, well all the better.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-06-06 21:57:50",
                    "replies": []
                }
            ]
        },
        {
            "author": "EternalFlame117343",
            "body": "hopefully this will be one of the good things about automation.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-01-25 16:50:09",
            "replies": []
        },
        {
            "author": "tiredoftheworldsbs",
            "body": "OMG!!! The sky is falling!!!!! Lol. Such ridiculous paranoia.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-05-19 13:51:38",
            "replies": []
        },
        {
            "author": "1888okface",
            "body": "Intellectual: “we should exert control over where people can and can’t move.”",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-05-20 12:58:16",
            "replies": [
                {
                    "author": "Cedleodub",
                    "body": "not sure what you're suggesting here: completely open borders?",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-05-20 14:08:16",
                    "replies": [
                        {
                            "author": "ButtStuffingt0n",
                            "body": "Borders of any kind are pretty stupid, when you step back and think about it. They exacerbate problems, not solve them.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-05-20 16:59:11",
                            "replies": [
                                {
                                    "author": "Background-File-1901",
                                    "body": "Tell that to Poland defending itself from migrants pushed by Belarus",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-22 16:00:27",
                                    "replies": [
                                        {
                                            "author": "ButtStuffingt0n",
                                            "body": "When you say \"defending itself from migrants\" do you mean \"trying to help war refugees\"?\n\nAlso, how are borders helping with or hurting that situation? It's unclear what you mean.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-22 17:13:54",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Cedleodub",
                                    "body": "they also prevent mass migrations that cause heavy social and economic disruption and wars... because humans will always want to go where the grass is greener, with no thought about the people that are already there",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-05-20 17:10:58",
                                    "replies": [
                                        {
                                            "author": "ButtStuffingt0n",
                                            "body": "How're those borders working out for Ukraine right now?",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2024-05-21 00:59:55",
                                            "replies": [
                                                {
                                                    "author": "Cedleodub",
                                                    "body": "what kind of stupid argument is this? \n\nwhere the hell did I talk about a powerful country invading another one? that's not mass migration",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-21 22:09:02",
                                                    "replies": [
                                                        {
                                                            "author": "ButtStuffingt0n",
                                                            "body": "You argued that borders prevent wars. They clearly don't (just like they don't prevent anything else you mentioned). Don't project your stupidity onto me.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-21 22:15:04",
                                                            "replies": [
                                                                {
                                                                    "author": "Cedleodub",
                                                                    "body": "they do prevent wars... massive migrations have been the cause of wars throughout human history",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-05-21 22:49:09",
                                                                    "replies": [
                                                                        {
                                                                            "author": "ButtStuffingt0n",
                                                                            "body": "Are you trolling us? Explain how borders prevent wars.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-05-21 23:53:15",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Yogurt_Ph1r3",
                                            "body": "Yeah great point, borders prevent wars, as if border disputes aren't the #1 cause of wars",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-05-21 03:52:26",
                                            "replies": [
                                                {
                                                    "author": "Cedleodub",
                                                    "body": "preventing mass migrations does prevent wars\n\nwhat do you think would happen if every person around the world that wants to go live in a rich western country like the U.S., the U.K. or Germany where suddenly allowed to do so?\n\nthat level of overpopulation would result in a massive housing crisis, an explosion of food prices, homelessness spreading everywhere, healthcare and social services breaking down... oh right I'm describing Canada right now\n\ngiven enough time, the rising homelessness and general poverty would lead to crime and social instability... until the inevitable collapse of social order that would either lead to a dictatorship or a civil war (or both)\n\nthere's also the possibility of foreign intervention to 'pacify' said country, with an equal possibility of violent pushback by either local militias or the country's remaining forces themselves \n\nborders exist for a reason: at its most basic, it's to prevent all the humans on the planet to want the same 'greener' grass all at the same time",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-21 22:46:36",
                                                    "replies": [
                                                        {
                                                            "author": "Yogurt_Ph1r3",
                                                            "body": "That wouldn't cause overpopulation, that's just a shifting of population. Your head is completely in the wrong place",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-21 22:59:21",
                                                            "replies": [
                                                                {
                                                                    "author": "Cedleodub",
                                                                    "body": "mass migration does cause overpopulation\n\nI can't believe I even have to argue this",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-05-21 23:07:41",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Yogurt_Ph1r3",
                                                                            "body": "\"over\"population in a region (aka possibility of selfish states allocating resources poorly) not actual overpopulation, unless you're suggesting mass migration causes baby booms",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-05-21 23:18:44",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "padawab24",
                                            "body": "Correction: humans will always want to go where they *think* the grass is greener.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-20 20:14:58",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Yogurt_Ph1r3",
                            "body": "No, that's stupid, completely open borders are pointless, there should be no borders.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-21 03:51:48",
                            "replies": [
                                {
                                    "author": "Cedleodub",
                                    "body": "...which is even more stupid",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-21 22:09:41",
                                    "replies": [
                                        {
                                            "author": "BudgetMattDamon",
                                            "body": "You not comprehending the point doesn't make it stupid.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-22 21:43:37",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LunarMoon2001",
            "body": "I too can make up numbers!",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-05-19 11:40:16",
            "replies": []
        },
        {
            "author": "Jennysau",
            "body": "Don't need the workers, just need the tax payers.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-05-19 15:58:49",
            "replies": []
        },
        {
            "author": "FartCityBoys",
            "body": "I’m not following your argument. If AI is going to displace as many jobs as we have citizens in the US we’d already be out of work, immigrants or not.\n\nYour argument also doesn’t weigh the benefits of immigration to the immigrants themselves. This is often a flaw in anti immigration arguments. American immigration is most likely the government policy that has created the most happiness in human history. An immigrant escaping poverty and violence in Guatemala is most likely going to be happier here, and their children will almost certainly will. And even if they take a job an American would have had (they won’t, unemployment in this country is low) the net happiness is still in favor of immigration.",
            "score": -1,
            "depth": 0,
            "timestamp": "2024-05-19 09:03:09",
            "replies": [
                {
                    "author": "Deleted",
                    "body": ">And even if they take a job an American would have had (they won’t, unemployment in this country is low) the net happiness is still in favor of immigration\n\nhttps://knowyourmeme.com/memes/total-happiness-in-the-world-increased",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:52:15",
                    "replies": [
                        {
                            "author": "FartCityBoys",
                            "body": "That meme doesn’t work as a universal rule. Dude who gets more happiness out of your bike steals it, someone who needs it more than him steals form him until ad nauseum until all bikes are allocated to those who get the most happiness from a bike… also we live in a society where everyone has theft looming over them. That’s a lot of feelsbadman.\n\nA real utilitarian solution would be to allocate resources more evenly so that everyone has a means of transportation.",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-05-19 10:33:15",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SurpriseHamburgler",
            "body": ":popcorn:",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-05-19 07:43:37",
            "replies": []
        },
        {
            "author": "sporbywg",
            "body": "It's not going to do that. Please don't apply to work where I work.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-05-19 08:52:27",
            "replies": []
        },
        {
            "author": "phuturism",
            "body": "The billionaires need consumers.",
            "score": -1,
            "depth": 0,
            "timestamp": "2024-05-19 12:07:54",
            "replies": [
                {
                    "author": "Ridit5ugx",
                    "body": "Yes but the well-being of those consumers are not a priority.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 12:13:45",
                    "replies": [
                        {
                            "author": "phuturism",
                            "body": "Correct",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-19 13:40:44",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sukhman_mann_",
                    "body": "Billionaires need consumers for earning money which they can use to buy goods produced by somebody else who wants to earn money too. It’s just exchange. This exchange would break if machines can produce everything by themselves and thus the billionaires won’t need consumers anymore as they won’t need money to get goods anymore.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-05-19 12:37:42",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "AI can’t generate a photo of someone with 5 fingers",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-05-19 14:01:43",
            "replies": [
                {
                    "author": "s0phocles",
                    "body": "Check out the guy who hasn't used MJ in the past two months.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-05-19 14:04:47",
                    "replies": []
                },
                {
                    "author": "Electronic_Dinner812",
                    "body": "I like how this routinely gets used as an argument as if you can’t possibly conceive of AI improving.  Where Midjourney was a year ago compared to today is fucking wild. It’s improved insanely fast. \n\nAnd go visit the Midjourney sub. Not only can Midjourney do hands now, it can do them undetectably well.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-19 14:38:38",
                    "replies": [
                        {
                            "author": "onFilm",
                            "body": "As a software engineer, they're not wrong. Most people are pretty unaware of AIs current limitations, and immediately believe that it will be a cure-all only because of the progress the past two years. But guess what, AI is stagnated at the moment, not only by a lack of new discoveries but also by the limitations of power generation we have.\n\n\nPeople always seem to overestimate it. Like any other invention, AI is just a tool used for automation.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-19 14:45:29",
                            "replies": [
                                {
                                    "author": "Electronic_Dinner812",
                                    "body": "From what I’ve read it’s LLMs that are stalled, not generative AI like Midjourney. And like I noted, Midjourney just reached a new milestone of doing hands. I’m assuming text will be next, it’s already quite good at that. There’s been a large demand for reproducible characters from image to image, and Midjourney is also improving on this arena.\n\nIf Midjourney continues to improve it has the possibility to take over: graphic artists, stock photography websites, concept artists, design concept artists, illustrators, and more. Maybe not entirely yet, but there’s already websites using AI art and “stock photos” for their stories, which means artists are currently losing out on commissioned work.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 15:02:57",
                                    "replies": [
                                        {
                                            "author": "onFilm",
                                            "body": "As I mentioned, Midjourney uses processes that incorporate multiple models to achieve the results they do. They are actually not refining the actual algorithms themselves, just building stacks upon stacks to fix the issues that exist in all present text-to-image models. It's a creative way to approach the problem, but it's not fixing the root issue, yet.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 15:04:27",
                                            "replies": []
                                        },
                                        {
                                            "author": "Trotskyist",
                                            "body": "It's been barely over a year since GPT-4 launched. I think it's a little premature to say it's \"stalled.\" If there haven't been any major improvements in 2 years, I'll concede the point.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 15:13:43",
                                            "replies": [
                                                {
                                                    "author": "Electronic_Dinner812",
                                                    "body": "Yeah I’m not actually convinced it’s stalled either, that’s just what I’ve read and that was the point the other guy was making. I’m not a software engineer so I can’t really say either way. But even if I don’t know about LLMs, it’s clear that generative AI like Midjourney is still improving and has reachable goals where it can improve.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-19 15:27:08",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Wonderful-Impact5121",
                                                    "body": "I’d love to hear these people’s comments when airplanes, cars, radio, electricity, or anything else were starting to be developed. \n\n“This is a gimmick! It hardly does shit since they started making it a year ago, complete bullshit technology!”",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-19 16:41:23",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "digitalwankster",
                                    "body": "“As a software engineer” you would surely understand that the finger issue was a training data set issue. AI is also not stagnated in the slightest, you just haven’t been keeping up. Go watch the Google IO conference recaps on multimodality or the GPT-4o demos. Look at the HuggingFaces leaderboards from a year ago compared to where we’re at today..",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 14:57:20",
                                    "replies": [
                                        {
                                            "author": "onFilm",
                                            "body": "No, the \"finger\" issue isn't as much as a training data set issue, as much as it is how these neural networks learn new data. Future neural networks will hopefully not have this issue where the data-set needs to be so well defined when describing structures like fingers, animal legs, and other multi-appendage subjects. Multimodality doesn't fix the issue you're talking about; all it is, is just glorified systems with multiple models in-between steps. The actual progress for a single, individual, model that can perform as you say, doesn't exist yet. Even midjourney uses multiple layers of models and processing to achieve the results they do.\n\nI've been programming neural networks since 2017, I know very well how it's progressing, this is why I am giving my opinion as someone who works with it on an almost-daily basis.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-05-19 15:02:36",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Deleted",
                            "body": "Obviously I was joking to prove a point. You see ai generated content that has simple things wrong, illustrating that the technology is not the end all be all of human society.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-19 15:28:54",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fightlife45",
                    "body": "Um yes it can lol.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-19 14:56:30",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Check out this AI bot can’t tell when I’m joking",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-19 15:29:46",
                            "replies": [
                                {
                                    "author": "Rude_Friend606",
                                    "body": "Your joke was that AI *can* generate a photo of someone with 5 fingers? How is that a joke?",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 15:37:52",
                                    "replies": []
                                },
                                {
                                    "author": "Fightlife45",
                                    "body": "Ah yes, because I'm the first person unable to detect when someone was being sarcastic through text.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-19 15:38:47",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "*AI is going to change and create millions of new jobs that we never knew would exist.\n\nIt's like talking to someone in the 1920s and saying that the elevator man will lose his job to automation. But forgetting to mention that computer programmer or social media influencer will be a job in the future.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-05-21 02:55:43",
            "replies": [
                {
                    "author": "Free-Geologist-8588",
                    "body": "Can you envision any such job beyond “knows guy who is rich by commanding robots?” What does it look like?",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-23 21:33:17",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Off the top of my head:\n\nLive performing musician.\nHuman tour guide that people connect with.\nCustomer service rep for those who refuse to talk to AI.\nArtisan craftsman.\n\nThe demand for human made products that have proof of human creation is going to be a massive market.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-23 21:38:01",
                            "replies": [
                                {
                                    "author": "Free-Geologist-8588",
                                    "body": "I disagree. It’s going to be exactly like the movie “Her”. The robots are better girlfriends than actual women. Same with music. You’ll be so into stuff crafted by AI for your life you won’t want to hear anyone else play. The AI guides will speak 20 languages perfectly and be better. \n\nThere has never been a revolution where all of human capabilities were offered cheaper by machines, but that’s what AGI is, at least after energy efficient bodies come.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-05-23 21:45:51",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "I think you'll find that a large number of people will want art that is probably created by a human.\n\nPeople connect with humans. AI art is boring and emotionless.\n\nYou already see it with the AI art that exists. It's cool, but people don't care or connect with it. It's great for replacing stock images. But no one cares about AI from an art perspective. They want the human connection.\n\nIf personalities didn't matter in music for example, then artists wouldn't be pushed to show their face, story, emotional connection, and meaning in songs. They would just pump out faceless and nameless bangers.\n\nYet here we are, people love Taylor Swift's music, because it's Taylor Swift's face on it. Not because it sounds good.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-23 22:13:56",
                                            "replies": [
                                                {
                                                    "author": "Free-Geologist-8588",
                                                    "body": "You’ve already got AI influencers gaining ground. And yes, Taylor Swift will be rich controlling the Taylor Swift brand, but the thing you really have to think about is, what when you can talk to her whenever you want, when she can write songs for you and your friends guiding your life, will that be a more popular product? I’m sure it will. The reality is none of us actually knows Taylor Swift. We know a representation. When artists can control that representation but make it more interactive, I think they will, and that opens the door to the rest.\n\nI think we are actually going to have to change how our civilization is structured around AGI.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-23 22:30:42",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "awfulcrowded117",
            "body": "There is always someone claiming that some new technology will eliminate all the jobs.  Each and every one of us is supposed to be unemployed like a dozen times over by now.  Farms, factories, ect.  But it turns out, the market will make use of available manpower somehow, even if one job type or another becomes less necessary.  So no, AI is not going to result in a massive unemployment crisis.  \n\nYou seem to fundamentally misunderstand how previous transitions took place.  Manufacturing wasn't a thriving sector just waiting when people came in off the farms.  It was the reverse, as employment went down, manufacturing took advantage of that labor capital to expand and become a titanic industry.  The same thing will happen again.  There might be some temporary growing pains, but there is not going to be some massive, lasting deficit of available jobs.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-05-21 18:49:03",
            "replies": [
                {
                    "author": "BudgetMattDamon",
                    "body": "You seem to be fundamentally misunderstanding that AI is not like previous technological advances, and you can't use them as precedent to guess what'll happen.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-05-22 21:42:37",
                    "replies": [
                        {
                            "author": "awfulcrowded117",
                            "body": "That's what they always say.  The problem with that argument is the social changes aren't about the technology, they're about the psychology and sociology.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-23 05:18:09",
                            "replies": [
                                {
                                    "author": "BudgetMattDamon",
                                    "body": "Turns out those rule our world even more than technology.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-23 08:11:58",
                                    "replies": [
                                        {
                                            "author": "awfulcrowded117",
                                            "body": "Exactly, and they will react to this change in technology the same way they have reacted to every previous ones",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-23 09:05:34",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Free-Geologist-8588",
                                    "body": "I think he’s making a good point. As a thought experiment, suppose we had a humanoid robot, that when connected over Internet, could do basically anything anyone can do through AI. Cost is 60 cents of electricity and 40 cents maintenance per hour. Where do humans supposedly find work in this economy? Is it entirely through nepotism, where rich business owners give people positions that do nothing but command robots because they like them?",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-05-23 21:31:14",
                                    "replies": [
                                        {
                                            "author": "awfulcrowded117",
                                            "body": "\"suppose we had a humanoid robot, that when connected over Internet, could do basically anything anyone can do through AI.\" Except this isn't the technology we're talking about.  AI isn't that good or that cheap, and neither is robotics.  Sure, there will eventually come a day when technology can do literally everything that needs to be done.  When that day comes, I hope we go the star trek route.  but that day is a long, long way from now.  Literally no one is suggesting AI is that good.  They are just panicking about AI eliminating/reducing some job sectors just like many technologies have done in the past.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-23 21:58:43",
                                            "replies": [
                                                {
                                                    "author": "Free-Geologist-8588",
                                                    "body": "The problem is that isn’t in line with what experts in the industry are saying:\n\nhttps://www.businessinsider.com/openai-cofounder-agi-coming-fast-needs-limits-john-schulman-2024-5?op=1\n\nAGI is full functionality of human brain, including designing robots, everything else. I’d say we are 12 -15 years from my thought experiment being feasible.",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-23 22:06:40",
                                                    "replies": [
                                                        {
                                                            "author": "awfulcrowded117",
                                                            "body": "This is the prediction of one guy with a vested interest, and based on technology that is wildly different from how \"ai\" currently works",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-23 22:22:15",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "[removed]",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-05-22 08:26:14",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-22 11:37:27",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "[removed]",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-05-22 14:06:58",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[removed]",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-22 14:08:29",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "[removed]",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2024-05-22 14:09:16",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-05-22 14:18:10",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "[removed]",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2024-05-22 14:24:03",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "IusedtoloveStarWars",
            "body": "True statement.",
            "score": -1,
            "depth": 0,
            "timestamp": "2024-05-20 18:49:42",
            "replies": []
        },
        {
            "author": "Thrakashogg",
            "body": "What a racist post. \n\nYou are talking about a possible change, DECADES in the future. Jesus Christ.",
            "score": -11,
            "depth": 0,
            "timestamp": "2024-05-19 16:55:24",
            "replies": [
                {
                    "author": "Capital-Wolverine532",
                    "body": "It isn't racist to point out the obvious. Mass immigration is unnecessary.",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2024-05-19 17:49:51",
                    "replies": [
                        {
                            "author": "Thrakashogg",
                            "body": "But it isn't unnecessary. AI is only theorized to take over certain jobs. It certainly won't take over the vast amount of manual labor jobs.\n\nUntil it actual is ready, available and proven to take over jobs, the post is wildly inaccurate.  \nSo again, what is really driving the post?\n\nYou are, yet again, talking about a theorized event decades in the future by the OP.\n\nSo, go on and justify it.",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-05-19 17:52:49",
                            "replies": [
                                {
                                    "author": "741BlastOff",
                                    "body": "Apply the same logic to climate change. Let's not do anything about it now, because it's only theorised to be a major problem decades in the future. We'll deal with it then I guess?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-20 05:24:21",
                                    "replies": [
                                        {
                                            "author": "Thrakashogg",
                                            "body": "Here is the issue. You aren't actually solving the problem. There would be, in your scenario, millions of actual Americans who would be out of jobs as well. But hey, fuck them I guess as long as we get the immigrants out?\n\nThe only ways to solve AI taking jobs are either to ban AI at a legislative level OR to start training programs to shift away from jobs AI would eventually take over. \n\nThrottling immigration now causes problems NOW and is actually a racist attempt because again, IT DOES NOT SOLVE THE PROBLEM.|\n\nStay in school, little buddy.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-05-20 06:24:04",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "This immigration influx is NOT about them taking our jobs. They are here to take our lives.\n\nAsk yourselves why the obama admin bought millions of weapons and random agencies like the post office bought TRILLIONS of rounds of ammo.\n\n\nTake a wild guess.",
            "score": -12,
            "depth": 0,
            "timestamp": "2024-05-19 09:02:59",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Discontinue the lithium",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:08:31",
                    "replies": []
                },
                {
                    "author": "Local_Challenge_4958",
                    "body": "> This immigration influx is NOT about them taking our jobs. They are here to take our lives.\n\n> Ask yourselves why the obama admin bought millions of weapons and random agencies like the post office bought TRILLIONS of rounds of ammo.\n\nArguments should involve things based on reality.\n\nNo one is \"taking your life.\"",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:33:35",
                    "replies": []
                },
                {
                    "author": "Kalsone",
                    "body": "Different agencies have security needs to protect premises and personnel. Go back to the story and things like NOAA and USPS buying ammo was in small quantities. Talking tens to hundreds of thousands of rounds. Homeland security bought a couple hundred million rounds.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-19 09:35:13",
                    "replies": []
                }
            ]
        }
    ]
}