{
    "post_title": "AI Is Detaining Sex Workers at the Border—and You’re Next",
    "post_timestamp": "2023-12-27 13:53:10",
    "last_comment_timestamp": "2024-11-28 09:24:49",
    "time_difference": "336 days, 19:31:39",
    "comments": [
        {
            "author": "Flat_Shame_2377",
            "body": "Why are people surprised by biometrics and by using social media to find grounds of inadmissibility? The job of border guards is to keep out people who are not admissible. They have the widest authority of any U.S. law enforcement agency. \n\nProstitution has always been a ground for inadmissibility. \n\nI suppose most people are unaware of biometrics and face recognition.",
            "score": 82,
            "depth": 0,
            "timestamp": "2023-12-27 14:29:57",
            "replies": [
                {
                    "author": "XxX_Dick_Slayer_XxX",
                    "body": "observation dinner crush hungry alleged reminiscent march secretive roll quarrelsome\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                    "score": 38,
                    "depth": 1,
                    "timestamp": "2023-12-27 15:11:44",
                    "replies": [
                        {
                            "author": "pensezbien",
                            "body": "If you and your GF are US citizens, my understanding is that the US border face scanning is still officially optional for you. But yeah opting out is a pain in the ass, and most foreign nationals do have to do it.",
                            "score": 15,
                            "depth": 2,
                            "timestamp": "2023-12-27 15:19:25",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "I tried opting out and the officer didn’t know it was even possible, despite the sign in front of him saying it so lol",
                                    "score": 14,
                                    "depth": 3,
                                    "timestamp": "2023-12-27 16:38:19",
                                    "replies": [
                                        {
                                            "author": "pensezbien",
                                            "body": "Hah. Did you succeed in the end? And was this CBP (on the way in) or an airline official (on the way out)?",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2023-12-27 17:01:03",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "Yeah, every time. But at the end meh they already have my face from other sources, so I stopped caring.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2023-12-27 17:01:50",
                                                    "replies": [
                                                        {
                                                            "author": "pensezbien",
                                                            "body": "Understandable, yeah. Privacy can be an overly wearying battle at times in the modern US, sadly. Thanks for the reply.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2023-12-27 18:10:41",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "HonestPerspective638",
                                                            "body": "lol they have a camera above the desk where you \"opt out\"",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2023-12-27 22:06:22",
                                                            "replies": [
                                                                {
                                                                    "author": "elieax",
                                                                    "body": "But I guess in theory those images aren’t checked against and stored in a database",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-01-15 09:11:26",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "timoddo_",
                                    "body": "Genuine question, what do you gain by opting out at the border? They already have at least one picture of your face via your passport (and likely more through various other means)",
                                    "score": 10,
                                    "depth": 3,
                                    "timestamp": "2023-12-27 16:49:23",
                                    "replies": [
                                        {
                                            "author": "pensezbien",
                                            "body": "I'm not sure - I've never opted out of that. In fact I participate in Global Entry (through NEXUS), which means I can use facial recognition to enter the US (and Canada) at many airports, sometimes  without showing or scanning my passport upon arrival. (Yes, of course, I do have a WHTI-compliant document with me when legally required, i.e. US passport or NEXUS card in my case, whether or not I have to present one of them.)\n\nIf I had to speculate, I imagine opting out of this would either be an expression of trusting the State Department's handling of your facial data more than CBP, or a protest against the facial recognition system overall by using US citizen privilege to make it more costly/slow for the airlines (on the way out) and/or CBP (on the way in).",
                                            "score": 7,
                                            "depth": 4,
                                            "timestamp": "2023-12-27 16:58:37",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "> participate in Global Entry (through NEXUS), which means I can use facial recognition to enter the US (and Canada) at many airports, sometimes without showing or scanning my passport upon arrival\n\nI've done that without global entry, it was just random",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-01-03 11:13:25",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "bubbabubba345",
                                            "body": "To me it’s more on the principle of government using and developing expansive facial recognition databases for god knows what - they already are incredibly abusive even to US citizens with what the NSA collects re emails and phone records. Of course I’m being tracked regardless in a million ways out of my control, but if I can control one thing w/ respect to government, I’ll do it.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2023-12-27 18:53:56",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Deleted",
                                    "body": "“Optional” they probably scan you when you walk around the airport.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2023-12-28 22:25:06",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pensezbien",
                    "body": "The biggest problem with this as applied to prostitution specifically is that the CBP officers rarely reliably apply the rather non-obvious definition of prostitution in the immigration regulations, which is far more narrow than the usual legal and lay definitions, and from the article it sounds like the AI will worsen rather than reduce this mismatch. Quoting 22 CFR §40.24(b):\n\n>The term “prostitution” means engaging in promiscuous sexual intercourse for hire. A finding that an alien has “engaged” in prostitution must be based on elements of continuity and regularity, indicating a pattern of behavior or deliberate course of conduct entered into primarily for financial gain or for other considerations of material value as distinguished from the commission of casual or isolated acts.\n\nI'm not sure what the judicial definition of \"sexual intercourse\" is for immigration law purposes, but it's possible that blow jobs don't count as \"sexual intercourse\", and reasonably likely that hand jobs don't count. Certainly mere foreplay wouldn't. A sex worker whose business is limited to these acts - yes, they do exist - would remain admissible.\n\nSimilarly, someone who engages in one paid sex act in January 2022 and then one in February 2023, or even just two in January 2022 with none since then, probably doesn't meet the \"continuity and regularity\" / \"pattern of behavior\" criterion. They would fall into the \"casual or isolated acts\" wording.\n\nEven more importantly, someone whose purpose of \"financial gain or [...] other considerations of material value\" is a secondary purpose rather than a primary purpose, or not a purpose at all but only a consequence of a non-material primary purpose, falls outside the scope of this narrow definition. For example, someone with a non-material primary goal and who uses the sex work simply to stay financially afloat in order to achieve their primary goal, in a way that would not be necessary if they didn't have that other primary goal, is not inadmissible. (Why would someone do that? Usually because attempts to stay financially afloat in more socially acceptable ways have failed.) Same thing for people who are doing a bit of paid sex work on the side mainly for self-affirmation while they pursue a different primary academic or professional career - don't laugh, I've met someone who did this.\n\nYet again even more importantly, someone who does sex work under duress as a victim of human trafficking is not inadmissible under this ground, since they don't have the purpose required by regulation, but AI wouldn't know that.\n\nDo you really think the AI being discussed is likely to make CBP enforce all of these nuances better than they already do? Their pre-AI status quo is pretty sloppy as to exploring the boundaries of this legal definition. I don't think AI will help this at all. And most foreign sex workers can't afford the best US immigration lawyers to hand them a well-crafted letter for CBP with the right legal arguments, not that there's any recourse anyway for most foreign nationals if the CBP officer doesn't believe them.\n\nEven worse, the process to challenge a CBP decision after the fact is slow, broken, and expensive, and some consequences of CBP error (such as the loss of NEXUS or Global Entry and/or a 5-year ban) are nearly impossible to reverse. The consequences at the border can be especially severe for a permanent resident, since if CBP thinks they've engaged in prostitution within the last 10 years, the INA definition of \"admission\" treats them as arriving aliens applying for admission, unlike most returning residents, meaning they might get removed from the country they live in. At least LPRs get to argue before an immigration judge, but nothing forces CBP and its AI assistants to get the regulatory definition right before making a mess of people's lives.\n\nAnd once this concern is on a person's file, almost all subsequent applications to CBP, USCIS, or US visa officers will be complicated for roughly forever, with no redress - even though the inadmissibility for people who are covered under this ground automatically goes away by operation of law, with no formal waiver needed, 10 years after the last covered act. It's not the kind of job people usually do for a lifetime, but the consequences of CBP error here can last for that long. (So can CBP/USCIS/DOS unfamiliarity with how this inadmissibility automatically vanishes over time, unlike almost all other grounds of inadmissibility.)\n\nAs for that extra word \"promiscuous\" in the regulatory definition, which I didn't address, I'm not really sure what that means in this context that would not be redundant with the rest of the wording. But there is a statutory construction principle that tries to make the included words meaningful somehow, so I can imagine that there is some way that a sex worker with a pattern of behavior of sexual intercourse for hire and primarily for financial gain might still be admissible if their sexual intercourse is not promiscuous. Whatever that means. Maybe if they just do it with one paid partner instead of many?\n\nSo, yeah, my problem with this is my problem with many things about our immigration system, with AI just making the problem worse: there is no way for the US general public to know if the government is doing things correctly according to the law, because of how confidential many of these procedures are, and no effective way to get courts to enforce and monitor a correction (whether for the general procedure or for individual affected people) when they aren't.",
                    "score": 14,
                    "depth": 1,
                    "timestamp": "2023-12-27 15:15:06",
                    "replies": [
                        {
                            "author": "bubbabubba345",
                            "body": "This is a great response and I think the answer to your last question is unequivocal that the government is probably not doing the right thing and is probably not being responsible. Why would they? There’s hardly accountability for rouge ICE officers, CBP agents, immigration judges etc that completely violate professional and legal standards - but the larger government (DHS/DOJ) hardly bat an eye since it is almost always to their benefit (restricting immigration).",
                            "score": 8,
                            "depth": 2,
                            "timestamp": "2023-12-27 18:57:36",
                            "replies": []
                        },
                        {
                            "author": "Flat_Shame_2377",
                            "body": "That’s not accurate. Courts have checked immigration when they’ve gone too far.\nYou do understand this is common, right? \nEvents in NYC  have police helicopters doing facial recognition and have been doing so for more than a decade.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-12-27 18:55:24",
                            "replies": [
                                {
                                    "author": "pensezbien",
                                    "body": "Courts have often refused to check immigration. Most importantly, there are extreme limits to when courts are even willing to consider the merits of an immigration case in the first place, and extreme limits on what data can be obtained from the government in this area by either the public, the courts, private watchdog organizations, and even many elected policymakers.\n\nYou are right, of course, that some court rulings do in theory apply some restrictions to government behavior in certain contexts. But even where that is the case, there is approximately zero ability of anyone (including the courts) to effectively oversee the government’s compliance in general with the court’s order, beyond the case of any individual whose situation was specifically litigated.\n\nThe NYC example doesn’t mean what you think it does. Illegal overreaches by NYPD happen frequently and have for decades. Courts have ruled that way on many occasions, have even imposed consent decrees, and have found noncompliance with those consent decrees. NYPD is frequently unaccountable and frequently law-breaking.",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2023-12-27 19:51:02",
                                    "replies": [
                                        {
                                            "author": "Flat_Shame_2377",
                                            "body": "Looks like I was wrong. They don’t use this to identify people in crowds.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2023-12-28 10:03:46",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Deleted",
                            "body": "Maybe it’s because for marriage based visas “consummation of marriage” is required factor to permanent residency. \n\nConsummation doesn’t mean much if you’re a prostitute, but the legal definition. \n\nAs far as the other visa types… no clue. \n\nI’ll endeavor that because being a prostitute is illegal in most places, they worry about you breaking the law, working illegally, and not paying taxes. \n\nJust guessing though!",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-01-22 18:43:38",
                            "replies": [
                                {
                                    "author": "pensezbien",
                                    "body": "> Maybe it’s because\n\nWe don't have to speculate at the reason - it's simply because INA 212(a)(2)(D)(i) specifically creates a statutory a ground of inadmissibility for engaging in prostitution within the 10 years before applying for a visa or admission to the US.\n\nOne can wonder why Congress enacted that provision, and maybe consult the legislative history to see what was said about it at the time, but for enforcement purposes the reasons why the provision exists don't really matter to USCIS or the State Department when it very clearly does exist.\n\n\n> for marriage based visas “consummation of marriage” is required factor to permanent residency.\n>\n> Consummation doesn’t mean much if you’re a prostitute, but the legal definition.\n\nConsummation is only legally required immigration as a spouse based on proxy marriages, where one or both of the parties was not physically present at the ceremony. Neither consummation nor any other kind of prior sexual intercourse is in general mandatory in order for a marriage to be considered bona fide and valid for immigration purposes, not even for most marriage-based visas. See e.g. Matter of M-, 7 I&N Dec. 601 (BIA 1957) and Matter of Peterson, 12 I&N Dec. 663 (BIA 1968), which are still good law in all aspects relevant to this conversation. \n\nDespite that still-binding legal precedent, sometimes USCIS or the State Department will consider the presence or absence of consummation as a factor in deciding whether a marriage is bona fide. Still, it doesn't usually come up as a question when there is adequate other evidence of a bona fide marriage, and plenty of current or former prostitutes would consummate their marriages regardless of whether the law cares about that.\n\n> Consummation doesn’t mean much if you’re a prostitute\n\nI'd disagree on that - performing any activity as a job feels very different to me than doing it to celebrate or otherwise explicitly mark the solemnization of a marriage, whether or not the activity involves sexual intercourse. But anyway that's a tangent, because as above, the law never cares about why the consummation occurs and rarely cares that it occurs at all.\n\n> As far as the other visa types… no clue.\n\nAgain, it's relevant for any visa type solely because there's an explicit statutory provision about it, as with all grounds of inadmissibility.\n\n> I’ll endeavor that because being a prostitute is illegal in most places, they worry about you breaking the law, working illegally, and not paying taxes.\n\nThe regulations explicitly make legality irrelevant. Quoting §22 CFR 40.24(c):\n\n> An alien who is within one or more of the classes described in INA 212(a)(2)(D) is ineligible to receive a visa under that section even if the acts engaged in are not prohibited under the laws of the foreign country where the acts occurred.\n\nThis is either Congress deciding to punish engaging in prostitution even when it was done fully legally, executive branch regulatory policymakers deciding Congress intended to do that when they passed the statute, or executive branch regulatory policymakers deciding to do that themselves regardless of congressional intent. \n\nBut as with the statutory text itself, it doesn't really matter why this regulatory language exists - it's legally binding unless a court were to somehow find it unconstitutional, which is unlikely to happen in this case.\n\nAlso, there are some places in the world where prostitution activities can be fully legal for everyone involved if properly registered and taxed etc, such as Germany; and many others where the prostitute themselves commits no legal violation even if many of the other participants in the activity do, such as Canada and Norway. Presenting the US government with proof of acting legally is irrelevant to inadmissibility determinations under the ground of inadmissibility I've been discussing so far.\n\n(Tangent: Canada's laws are currently being challenged in court by organizations supporting the rights of sex workers, so it's possible that those legal prohibitions will be found retroactively invalid. Nobody is asking the courts to make anything more illegal, just less illegal.)\n\nEven when an applicant's prostitution was a crime under the applicable laws, the separate ground of inadmissibility for committing a crime of moral turpitude could only apply where there was a conviction, or where there was neither a conviction nor an acquittal but where the US government has received an admission meeting the very strict requirements laid out by the Board of Immigration Appeals. I say \"could only apply\" rather than \"would only apply\" because a conviction only triggers that ground of inadmissibility if either the wording of the criminal statute or the record of the conviction reflects a crime of moral turpitude. If the statutory wording of the crime is broad enough to encompass crimes not involving moral turpitude, and if the record of the conviction does not make it clear that this case did involve moral turpitude, it actually doesn't legally matter if the facts underlying the conviction clearly involved a crime of moral turpitude.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-01-23 05:38:08",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "[deleted]",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-12-28 13:17:15",
                    "replies": [
                        {
                            "author": "ratonbox",
                            "body": "Nobody says it’s not wrong sometimes. It’s just less wrong than a human being. All it’s doing is reducing the errors.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-12-29 02:53:27",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "calcetines100",
                    "body": "Face recognition has been more and more mainstream in other developed countries. Some Americans think that this is a prelude of totalitarian dystopia, and I just laugh at their obliviousness.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-29 01:16:26",
                    "replies": [
                        {
                            "author": "Bman847",
                            "body": "What obliviousness\nThis could be used against the people.\nHow do you not understand that?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-01-02 18:40:55",
                            "replies": [
                                {
                                    "author": "calcetines100",
                                    "body": "Yeah, I m so scared of government having an information on my face which they already have in four different states DMV and USCIS and CBP. \n\nIt's not that I don't understand it. It's people like you being delusional and pant up with unwarranted victim complex.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-01-02 18:50:11",
                                    "replies": [
                                        {
                                            "author": "Bman847",
                                            "body": "So they have all our info and can now use it to deny us certain things... I'm sure this won't get worse. \nIt's really crazy how you seem to enjoy it",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-01-02 18:57:36",
                                            "replies": [
                                                {
                                                    "author": "calcetines100",
                                                    "body": "Don't be a criminal or a sped then, lol. So far my life in the US has been rewarding as a non white immigrant. Must be all the government surveillance.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-01-02 19:25:59",
                                                    "replies": [
                                                        {
                                                            "author": "Bman847",
                                                            "body": "The word criminal changes as the law changes. If bad or inhumane laws are passed... Guess what happens. You're a criminal.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-01-07 12:53:14",
                                                            "replies": [
                                                                {
                                                                    "author": "calcetines100",
                                                                    "body": "Arbitrary fearmongering woo woo shit. Stay in Russia that you love so much lo.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-01-07 13:09:23",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Bman847",
                                                                            "body": "Fear. Mongering.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-01-07 13:32:35",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "Where do they get the data of people faces ID to do this?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-01-14 01:42:06",
                    "replies": []
                }
            ]
        },
        {
            "author": "CptS2T",
            "body": "This article is so badly written…and contradicts the title so badly. It looks like in those cases the officers were looking up escort ads and comparing them to flight manifests, which isn’t exactly cutting edge technology",
            "score": 18,
            "depth": 0,
            "timestamp": "2023-12-27 19:01:45",
            "replies": [
                {
                    "author": "MagnarOfWinterfell",
                    "body": ">officers were looking up escort ads\n\nFor \"research\"?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-27 19:50:03",
                    "replies": []
                }
            ]
        },
        {
            "author": "SueNYC1966",
            "body": "I doubt I am next unless there is a market for post-menopausal women.",
            "score": 11,
            "depth": 0,
            "timestamp": "2023-12-27 16:34:02",
            "replies": [
                {
                    "author": "zoinkasaurus",
                    "body": "Has the internet taught you nothing? :)",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2023-12-27 16:37:23",
                    "replies": []
                },
                {
                    "author": "HonestPerspective638",
                    "body": "this is actually a category in most porn sites lol. Welcome to your sexual peak lol",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-12-27 22:11:26",
                    "replies": []
                }
            ]
        },
        {
            "author": "ohmany88",
            "body": "Good? I won't be complaining about this?",
            "score": 6,
            "depth": 0,
            "timestamp": "2023-12-27 17:49:33",
            "replies": []
        },
        {
            "author": "Satan_and_Communism",
            "body": "I’m probably not next tho",
            "score": 5,
            "depth": 0,
            "timestamp": "2023-12-28 01:20:21",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "unwritten absorbed worm jellyfish concerned cow direful quickest childlike secretive\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "score": 5,
            "depth": 0,
            "timestamp": "2023-12-27 15:41:56",
            "replies": []
        },
        {
            "author": "LudicrousPlatypus",
            "body": "I wonder what the F1 is for the facial recognition models used at the border",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-27 16:21:55",
            "replies": []
        },
        {
            "author": "ToyotaComfortAdmirer",
            "body": "The problem with detaining people trying to illegally work (like in the article) in another country is?",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-28 03:09:09",
            "replies": [
                {
                    "author": "yelyos",
                    "body": "That's not what this is, they were combing Canadian escort ads (where the work is legal) and turning back people coming to the US on vacation.\n\nMoreover, they're not even applying the law correctly, the article mentions a vtuber fansly creator being denied a visa on the prostitution ground, when that content clearly doesn't even contain intercourse for hire",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-12-31 19:49:26",
                    "replies": []
                }
            ]
        },
        {
            "author": "delcodick",
            "body": "I am next?  🤣🤷‍♂️🤣🤣🤣. The Daily Beast proving that it is indeed possible to get exponentially absurd on a daily basis",
            "score": 7,
            "depth": 0,
            "timestamp": "2023-12-27 14:33:22",
            "replies": [
                {
                    "author": "LurkerNan",
                    "body": "Are we supposed to be outraged that some Canadian hookers didn't get to go on their beach vacation in a country they are prohibited to enter into?",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2023-12-27 19:32:14",
                    "replies": [
                        {
                            "author": "fjhforever",
                            "body": "No, we're supposed to be outraged that AI is being used to deny people entry into the US, because AI is always so reliable and trustworthy",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-12-27 21:24:20",
                            "replies": [
                                {
                                    "author": "HonestPerspective638",
                                    "body": "That was agents looking things up and looking in phones...  a person delegated to make the all ultimately makes the call.   Might be worse than A1 in some cases",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2023-12-27 22:10:38",
                                    "replies": [
                                        {
                                            "author": "fjhforever",
                                            "body": "They were using data to train the AI",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2023-12-27 22:33:11",
                                            "replies": [
                                                {
                                                    "author": "HonestPerspective638",
                                                    "body": "you mean database searches with multiple query options?   This is what they have always done.  Now they have more data points to query. Border agents can’t train a puppy.    They just do data entry",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2023-12-27 22:36:07",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pensezbien",
                    "body": "Overly sensationalist clickbait headline, yes, but the general point of the article is not nearly as absurd as the headline. AI being overly general and inadequately nuanced in leading undertrained and overworked CBP officers to sloppily enforce many of the grounds of inadmissibility in overbroad ways will indeed wreck far more lives than is humane.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2023-12-27 15:18:29",
                    "replies": [
                        {
                            "author": "zoinkasaurus",
                            "body": "While I accept **your** point (and the excellent points you have raised in your other comments in this thread), that is most definitely **not** the general point of the article.  Which focuses almost exclusively on \"full-service\" (i.e., offers intercourse) sex workers, who would be inadmissible under the definition you shared earlier (regular pattern of intercourse for hire, which they do not deny), with the exception of speculation about travel to Pakistan (and even that person was a full-service sex worker). And an abortion story that had nothing to do with the border at all.  And a brief review of the law around prostitution in Canada and Sweden which are not relevant to the situation in the US.\n\nThe article is almost counter-productive, because while I agree that there are concerns and there should be discussion around unsophisticated AI encouraging sloppy enforcement and \"over-enforcement\" that should be addressed... this article doesn't really further that discussion.  Picking examples of people who ARE actually inadmissible and are being \"correctly\" turned around at the border (legally I mean, leaving aside the debate around what people might think \"should be correct\"), makes it seems like things are kind of working the way they should be.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2023-12-27 15:53:21",
                            "replies": [
                                {
                                    "author": "pensezbien",
                                    "body": "Yeah, the article is definitely a sensationalist, journalistically sloppy, and mostly counter-productive mess. The article does briefly mention one example of the legally inaccurate overbreadth I'm talking about, while alluding to others:\n\n> In Feb. 2023, a sex worker named Hex was denied entry to the United States for “prostitution.” Hex’s story was familiar in many ways, from the surveillance to the assumption that every sex worker, including “legal” sex workers like adult-content creators and strippers, is a “prostitute.” Hex creates virtual-reality content and appears as a 3D avatar, making it unlikely that border patrol matched her face.\n\nAnd the word \"denied\" in that paragraph links to a very interesting Vice article about this incident: https://www.vice.com/en/article/z34p5a/a-virtual-reality-sex-worker-was-denied-entry-to-the-us-for-prostitution It seems pretty clear that online virtual avatar activities fall outside the regulatory immigration law definition of prostitution, but CBP can freely assume the worst without evidence and wreck lives of admissible foreign nationals just because they're creators of legal online adult sex content, often with no viable recourse for the affected foreigners and no consequence either for CBP as an organization or for the individual officer.\n\nI do know one or more cases of sex workers incorrectly getting in trouble at the US border which are not discussed in the article, at least some of which would be very sympathetic examples. But those are not ones which I have permission to discuss publicly, so I'll have to leave that claim unsubstantiated. (I'm saying \"one or more\" both to preserve privacy through vagueness and because I'm not sure if some of the pseudonymous examples in the article are ones I already know about. Definitely not all of them are.)\n\n> And a brief review of the law around prostitution in Canada and Sweden which are not relevant to the situation in the US.\n\nLegally you're correct, but the general public in the US often assumes that prostitution is illegal, as do members of the media and policymakers. Many of them further assume that \"criminals\" (treated as an epithet) deserve whatever punishments come to them (even beyond whatever the law may specify), and that their opinions and perspectives don't matter. Therefore, the fact that the people profiled in the article acted legally is unfortunately relevant to the court of public opinion on this overall policy matter.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2023-12-27 16:05:30",
                                    "replies": [
                                        {
                                            "author": "zoinkasaurus",
                                            "body": "I appreciate your points, and I must have skipped over the part about Hex.  The Daily Beast should consider offering you a position, since you write much more persuasively and succinctly than this author. :)",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2023-12-27 16:17:33",
                                            "replies": [
                                                {
                                                    "author": "pensezbien",
                                                    "body": "Hah. Overall they're too right-wing for me to want to work for them. Thanks for the praise! Mutually civil, thoughtful, facts- and logic-driven exchanges about controversial policy issues are too rare on this subreddit. Enjoy the rest of your day.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2023-12-27 16:22:22",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "delcodick",
                            "body": "You are either inadmissible or you aren’t. Much like pregnancy you are not a little bit inadmissible",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2023-12-27 15:21:00",
                            "replies": [
                                {
                                    "author": "pensezbien",
                                    "body": "True, but doesn't contradict what I said. The AI described in the article and human CBP officers are both applying many grounds of inadmissibility more broadly than what the law says, including the prostitution ground. The AI isn't helping them get it right, it's helping them exclude as many inadmissible people as possible even at the cost of unjustly wrecking the lives of too many admissible noncitizens, with inadequate access to means of redress for those inaccurately flagged and excluded.",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2023-12-27 15:27:06",
                                    "replies": [
                                        {
                                            "author": "delcodick",
                                            "body": "No it isn’t, no matter how much you wish it were to prove your incorrect assessment. \n\nThere are numerous decisions on inadmissibility on these grounds and likewise numerous decisions on waiver applications. \n\nThe Mental gymnastics undertaken by you throughout your other reply in this thread is tortuous but amusing in its total avoidance of these decisions and presence of the wording “(iii) is coming to the United States to engage in any other unlawful commercialized vice, whether or not related to prostitution,” \n\nRhetoric is fun and amusing on Social media and in sloppy faux journalism but beyond that serves no useful purpose in the real\nWorld where the law is applied   \n\nHappy to help clear that up for you 🍺",
                                            "score": -3,
                                            "depth": 4,
                                            "timestamp": "2023-12-27 15:35:53",
                                            "replies": [
                                                {
                                                    "author": "pensezbien",
                                                    "body": "> No it isn’t, no matter how much you wish were it were to prove your incorrect assessment.  \n\nI would much rather be wrong than be right on this. But:\n\n> There are numerous decisions on inadmissibility on these grounds and likewise numerous decisions on waiver applications.\n\nYes. There are numerous correct and numerous incorrect decisions on these grounds. Both the correct and the incorrect decisions continue. Most noncitizens turned away incorrectly at the border have no recourse. The AI will make this problem worse.\n\n> The Mental gymnastics undertaken by you throughout your other reply in this thread is tortuous but amusing in its total avoidance of these decisions and presence of the wording “(iii) is coming to the United States to engage in any other unlawful commercialized vice, whether or not related to prostitution,”\n\nThat wording is irrelevant to people who are turned away due to sex work outside the US, but who are not coming to the US for sex work. I know of multiple examples of people who have suffered this outcome.\n\nBeing subjected to condescending phrases like \"mental gymnastics\" and \"tortuous but amusing\" makes me think you're not going to continue this discussion with respect and in good faith. Therefore, because there's a limit to how confrontationally I want to spend my voluntary spare time on Reddit, I don't intend to continue this sub-thread further. I'm disabling inbox replies to this comment.",
                                                    "score": 9,
                                                    "depth": 5,
                                                    "timestamp": "2023-12-27 15:46:34",
                                                    "replies": [
                                                        {
                                                            "author": "delcodick",
                                                            "body": "🤣🤣🤣🤣 cool story",
                                                            "score": -1,
                                                            "depth": 6,
                                                            "timestamp": "2023-12-27 15:48:07",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ResoluteDuck",
            "body": "Wait - am I a sex worker???",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-12-27 17:42:24",
            "replies": []
        },
        {
            "author": "Psychological-Cut-78",
            "body": "Arrest those hookah hookers!!!!",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-11-07 10:59:03",
            "replies": []
        },
        {
            "author": "Psychological-Cut-78",
            "body": "Prostitution is sin !!!! Fornication!!!!",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-11-28 09:24:49",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "This has already been happening. I know of people through the grapevine who were denied visas because they were found on escorting sites. I assume it’s biometrics.  \n\nThankfully the porn I upload on the internet is free of charge, faceless and does not involve sex work :)",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-28 00:32:40",
            "replies": []
        },
        {
            "author": "TeddyMGTOW",
            "body": "The window is closing on traveling and moving money around. All the tools in place, probably another 10 years and the window slams shut.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-28 09:11:07",
            "replies": []
        },
        {
            "author": "RoyalAd9796",
            "body": "Based.",
            "score": 0,
            "depth": 0,
            "timestamp": "2023-12-27 14:58:22",
            "replies": []
        },
        {
            "author": "Forever49",
            "body": "Is this a US centric sub? If so, shouldn't it be called USimmigration?",
            "score": -3,
            "depth": 0,
            "timestamp": "2023-12-27 22:14:33",
            "replies": []
        },
        {
            "author": "Isa229",
            "body": "Based AI",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-28 00:14:42",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Problem is that Facial recognition still isn't a perfect system.\n\nThere's a whole bunch of bias that goes into training those models.  \n\nAnd was still terrible at recognizing people of color correctly (this was 2 years ago when I was still in school)",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-28 01:40:53",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "I routinely fail facial recognition AI systems.  Possible because of a common name combined with a facial issue.  It's biased towards something and not me.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-12-28 08:20:09",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "Got to keep sex work jobs for Americans can’t have foreign pussy under cutting American pussy.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-28 13:52:51",
            "replies": []
        },
        {
            "author": "eric987235",
            "body": "Was that a typo that was supposed to say *sexy workers*? If so, then yes I'm definitely next.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-29 16:43:45",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "zesty bells sparkle act lock run different plucky ring school\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-12-29 18:36:15",
            "replies": []
        },
        {
            "author": "TypeONegativ",
            "body": "Good riddance, get a real job, and actually know what it’s like to earn money",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-01-10 19:18:53",
            "replies": []
        }
    ]
}