{
    "post_title": "Why the Importance of Diversity in Tech Can’t Be Ignored",
    "post_timestamp": "2025-02-14 06:20:22",
    "last_comment_timestamp": "2025-02-21 20:51:21",
    "time_difference": "7 days, 14:30:59",
    "comments": [
        {
            "author": "lelanthran",
            "body": "FTFA:\n\n> Embracing diversity is not only the right thing to do—it’s a powerful competitive edge! \n\nWell, we're gonna find out soon, aren't we?\n\nWhen it's no longer enforced top-down the best-performing companies and teams will be diverse, right?\n\nRight now it is premature to have this discussion. Let's have this discussion in 5 years when we can see what the best-performing companies and teams look like.",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-02-14 08:46:24",
            "replies": [
                {
                    "author": "lieutdan13",
                    "body": "That's fair. Only time will tell. However, there are already studies that back up this claim and I have referenced them in my article",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-14 09:54:03",
                    "replies": [
                        {
                            "author": "lelanthran",
                            "body": "> However, there are already studies that back up this claim and I have referenced them in my article\n\nIn the social sciences they mostly  practice \"science\" not science. IOW, in the social sciences they make their conclusion first and then go run tests that agree with the predetermined conclusion.\n\nIn brief, in the social \"sciences\", you can find a published study that agrees with any viewpoint you want.\n\nIf you think you can trust the conclusions of social science publications, I have a bridge to sell you.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2025-02-14 22:25:51",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EsShayuki",
            "body": "Diversity is fine, as long as it means giving the job to the most deserving person, regardless of sex, race, sexual orientation, and so forth. That is, diversity should be a natural byproduct, as a result of not discriminating against anyone.\n\nOn the other hand, diversity is not fine when it's pursued as if it was the purpose itself, where your main goal is to not hire the most appropriate person, but to make your employee pool as diverse as possible, which is what I call \"checking diversity boxes.\" I think that that's toxic. And it's an actual problem.",
            "score": 10,
            "depth": 0,
            "timestamp": "2025-02-14 08:41:15",
            "replies": [
                {
                    "author": "lieutdan13",
                    "body": "I support this view. I'm not going to hire someone that has an inferior skill set rather than someone that is qualified for the position. Period.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2025-02-14 09:51:52",
                    "replies": []
                },
                {
                    "author": "Senior-Perspective24",
                    "body": "DEI benefitted white women. So if you see any groups outside of that demographic, they’re likely the qualified hires. I’m just curious about the longterm effects of certain industries if diversity isn’t considered to a degree. Tech is already dominated by Asian groups and I can’t imagine a diverse flow of ideas is being considered if the entire team looks the same or comes from the same place. \n\nI believe businesses will stunt their growth and companies that do prioritize diversity (it’s not illegal to have preferences) will stand out in the future.  ",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-21 20:51:21",
                    "replies": []
                }
            ]
        },
        {
            "author": "FourDimensionalTaco",
            "body": "The E in DEI nowadays means equity. And I am skeptical of that. \"Equity\" can very easily morph into de facto racism. I understand that minorities might need help due to unfair disadvantages in real life, but while equality is easy to define, equity isn't.",
            "score": 12,
            "depth": 0,
            "timestamp": "2025-02-14 06:39:15",
            "replies": []
        },
        {
            "author": "RagnarDannes",
            "body": "I love the stupid people looking over the fence image socialists use when they want to pitch equity. It pretends that all you are doing is giving the less fortunate a step stool out of thin air. It takes no account for where it came from. Reality is you dig a hole under the tall guy and force him to stand in it so you can give the dirt to the small one. Worst part is, your only judgement on who gets a hole dug under them is what their skin color is, what genitals they have, or who they like to put said genitals in. Things that no one can control and not merit based\n\nCongrats, you’ve managed to be racist, sexist and make your whole company dumber in the process. \n\nDei needs to die.",
            "score": 19,
            "depth": 0,
            "timestamp": "2025-02-14 06:44:02",
            "replies": [
                {
                    "author": "Mammoth_Loan_984",
                    "body": "You don’t understand what socialism is, do you?\n\n*edit: he blocked me like a big baby so I’ll write my most recent reply here*\n\n*I’d suggest googling “what is socialism”*",
                    "score": -8,
                    "depth": 1,
                    "timestamp": "2025-02-14 06:48:53",
                    "replies": [
                        {
                            "author": "RagnarDannes",
                            "body": "DEI is a form of ethnic based socialism. Where race, ethnicity, gender are used as metrics for distributing equity similar to the traditional economic socialism. Obviously, in this case it’s a business implementation vs government but the ideas are all the same.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-02-14 06:53:36",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lieutdan13",
                    "body": "I appreciate your view on equity. It can be really difficult to give up something that you have worked hard for and have earned to give to someone else that may not \"deserve\" it.\n\n\nI would be interested in your perspective on the actions we could take to be an ally in the workspace. Are there any of those in that section that you disagree with or have arguments against?",
                    "score": -4,
                    "depth": 1,
                    "timestamp": "2025-02-14 08:45:48",
                    "replies": [
                        {
                            "author": "RagnarDannes",
                            "body": "Being an \"Ally in the workspace\" is inherently the issue.  By definition, it means that just because of someones race, ethnicity, gender, etc they need you as an ally because they can't do it without your help.  If you do this you are pushing your predjudice onto others assuming we all only see things through this same shallow lense.  We don't, we don't care who you sleep or what you look like.  You are a name on slack and a voice in huddles.",
                            "score": 7,
                            "depth": 2,
                            "timestamp": "2025-02-14 10:59:24",
                            "replies": []
                        },
                        {
                            "author": "lelanthran",
                            "body": "> I would be interested in your perspective on the actions we could take to be an ally in the workspace. \n\nWell, for one, using the term \"ally\" is fundamentally antagonistic - there's a term from war!\n\nThere is no usage of \"ally\" that is inclusive; it's meaning, definition and usage is all based around in-groups and out-groups, and by using the word \"ally\" you are proposing that there is an outgroup among your colleagues, which is the opposite of inclusivity.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2025-02-14 22:28:28",
                            "replies": [
                                {
                                    "author": "lieutdan13",
                                    "body": "Yes. I am presuming that there is an outgroup among colleagues. This isn't the case with every team or every company. However, these situations of what I would consider to be toxic environments do exist. As a cist gendered white man, I can advocate for my colleagues in the marginalized groups of people and they would benefit from that.",
                                    "score": -1,
                                    "depth": 3,
                                    "timestamp": "2025-02-15 11:14:11",
                                    "replies": [
                                        {
                                            "author": "lelanthran",
                                            "body": "Well, if you're already positioned yourself into a them vs us, then logic and reason go out the window, doesn't it?\n\nIf you really want to spread the word, you should be spreading things like this: https://www.linkedin.com/feed/update/urn:li:activity:7296487099959009280/\n\nNot nebulous \"them vs us\" mentality.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2025-02-15 11:40:03",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Blue_Moon_Lake",
            "body": "In all 4 cases, they are watching without buying a ticket.",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-02-14 06:25:33",
            "replies": [
                {
                    "author": "lieutdan13",
                    "body": "That is a great observation. What do you think that is implying?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-14 08:46:41",
                    "replies": [
                        {
                            "author": "Blue_Moon_Lake",
                            "body": "Is it a guess quiz?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-14 14:32:28",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dukey",
            "body": "DEI is racist, discriminating against qualified candidates because they have the wrong skin color. If you want to fuel anger and disenfranchisement this is a fast way of doing it.",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-02-14 06:31:10",
            "replies": [
                {
                    "author": "Mammoth_Loan_984",
                    "body": "I’ve never met a good programmer who lost a job due to DEI. Nobody serious is interviewing two candidates and picking a vastly inferior one due to DEI. Every public incident reportedly caused by unqualified DEI hires has ended up being right wing pearl clutching with absolutely no relation at all.\n\nYou’ve been tricked into arguing about uno while the elites play chess.",
                    "score": 12,
                    "depth": 1,
                    "timestamp": "2025-02-14 06:38:00",
                    "replies": [
                        {
                            "author": "VMX",
                            "body": "https://medium.com/the-mission/im-an-ex-google-woman-tech-leader-and-i-m-sick-of-our-approach-to-diversity-17008c5fe999",
                            "score": 10,
                            "depth": 2,
                            "timestamp": "2025-02-14 06:41:18",
                            "replies": [
                                {
                                    "author": "Mammoth_Loan_984",
                                    "body": "Like I said, I agree it’s a flawed idea. I take issue with it being politicised by the right. Its actual impact is so unbelievably small in contrast to the noise people make about it.",
                                    "score": -5,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 06:43:45",
                                    "replies": [
                                        {
                                            "author": "dukey",
                                            "body": "DEI was definitely political. It was also tied up with ESG investing, which was a way of forcing companies to behave a certain way. Not a factor in smaller companies, but for larger companies yes it's definitely a real thing. It's why companies like Bud light were basically nudged into committing brand suicide, because they had to comply with enough of this stuff or lose investment.",
                                            "score": 11,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 07:00:17",
                                            "replies": [
                                                {
                                                    "author": "Mammoth_Loan_984",
                                                    "body": "I agree 100%, but the conversation you’re having is not the same as the one being had by others in this thread.",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-14 07:05:52",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "VMX",
                                            "body": "I was replying to this part of your comment:\n\n> I’ve never met a good programmer who lost a job due to DEI. Nobody serious is interviewing two candidates and picking a vastly inferior one due to DEI.\n\nThe article I've linked, which is just one example of what we have all seen happen across hundreds os companies during the last decade or so, says:\n> We try hard, but again find ourselves with a 98% male candidate pool. You should know that we are an early stage startup that cannot afford market salaries. Despite that, we paid premium salaries to bring a few women who did well in our interviews. But, they lacked the energy to put us into overdrive. Worse, they were starting to drain the energy from the rest of the team. Eventually, we had to do the right thing for the company and let them go. I’m now back to being the only woman on the (tech) team.\n>\n> [...]\n>\n> After diversity attempts at large companies and my own startup and the attempts to start tech early with my own children, I can tell you that our obsession with diversity and attempts to solve it are only fucking it up for the actual women in tech out there!\n> \n> What do I mean by this?\n>\n> * We get upset about the state of gender diversity in tech\n> * We make a pact to hire more women\n> * The pool has (a lot) more men than women\n> * After some rounds of low to no success, we start to compromise and hire women just because we have to\n> * These women show up at work and perform not as great as we want them to\n> * It reinforces to the male population that was already peeved by the diversity push that women aren’t that good at tech after all\n> * They generalize that observation on the entire women in tech community\n> * Sooner or later, some such opinions get out there\n> * The feminists amongst us go crazy\n> * The diversity advocates are caught in a frenzy and make a pact to hire more women (again)\n> * This loops. Infinitely.\n\nIf you've personally never seen any instances of this happening, then congrats, maybe you got lucky. I've not only had to work with new hires that were just filling a quota and were clearly not up to the task. I also personally listened to my own manager vent to me on a late Friday evening because he just got off the phone with HR and they were pretty much forcing him to pick the only female candidate that showed up, instead of his preferred (male) candidate with an impressive CV, multinational experience and fluidity in the two languages we needed.\n\nWhenever a company is applying gender/diversity quotas in their HR policy, they're discriminating someone in favour or someone else. There's simply no way around that. You may never get to see the guy that was not hired, and he may not even know why he wasn't hired. But someone had to be discriminated against if somebody else was hired to meet a quota. Otherwise there wouldn't be any need for quotas in the first place, because the \"diverse\" candidate would be hired naturally.",
                                            "score": 5,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 10:37:59",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "shoshin2727",
                            "body": "How can you possibly know the number of jobs a \"good\" programmer was not ultimately offered because the employer instead hired someone else to meet a quota?",
                            "score": 10,
                            "depth": 2,
                            "timestamp": "2025-02-14 06:43:39",
                            "replies": [
                                {
                                    "author": "Mammoth_Loan_984",
                                    "body": "Because I live in the real world, where instead of getting angry at right wing talking points designed to deflect attention from actual issues, I look at the reality of each situation and assess it based off what I find to be true.",
                                    "score": -4,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 06:46:22",
                                    "replies": [
                                        {
                                            "author": "shoshin2727",
                                            "body": "That's a word salad non-answer.",
                                            "score": 7,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 06:48:26",
                                            "replies": [
                                                {
                                                    "author": "Mammoth_Loan_984",
                                                    "body": "Yeah it was pretty vague. My responses in these online conversations lean low effort because often the people involved are clearly sealioning. \n\nI have worked hiring engineers in tech and am basing my opinion on corporate experience.",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-14 06:53:36",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "woodquest",
                            "body": "Well i’ve hear of some good ones that couldn’t get a job because of it.\n\nAnd how could you even have heard of that??\nIt’s not like companies fire Brian, middle aged white dude straight telling him sorry man, we gotta make room for more diversity. Nor that then blatantly sharing the story would serve Brian in any way…",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-02-14 06:49:21",
                            "replies": [
                                {
                                    "author": "Mammoth_Loan_984",
                                    "body": "Do you work in tech? The only people I’ve met who have complained about not getting a job due to DEI are objectively terrible at their jobs.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 06:55:03",
                                    "replies": [
                                        {
                                            "author": "woodquest",
                                            "body": "What you’ve heard or what I’ve heard is not necessarily the full picture, would probably say an engineer",
                                            "score": 4,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 06:58:53",
                                            "replies": [
                                                {
                                                    "author": "Mammoth_Loan_984",
                                                    "body": "Right, so you’re commenting on a non-issue turned political wedge issue used by the right to distract people from actual issues. But you have no actual experience or knowledge in the topic. Yet you feel confident telling someone who DOES have experience & knowledge that you know better.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-14 07:02:27",
                                                    "replies": [
                                                        {
                                                            "author": "woodquest",
                                                            "body": "A non issue you say…\nHave you heard of that submarine? Problems at boeing ? … I could go on and on with the very palpable security life endangering problems this DEI caused in every field \n\nOne could also say this was created by the left to push an electoral agenda.\n\nWho’s right? I only know there’s a beautiful weather out there today so let’s beg to differ, in a friendly manner",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-14 07:07:31",
                                                            "replies": [
                                                                {
                                                                    "author": "Mammoth_Loan_984",
                                                                    "body": "Can you provide evidence that DEI, rather than decades of budget cuts around engineering and maintenance, was at fault for the Boeing incident?",
                                                                    "score": 3,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-02-14 07:12:03",
                                                                    "replies": [
                                                                        {
                                                                            "author": "woodquest",
                                                                            "body": "Are you alright? You look like you’re in mental north Korea and googling is out of your reach",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-02-14 07:21:35",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Mammoth_Loan_984",
                                                                                    "body": "You don’t ever really get outside of your little social and political bubble, do you?",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-02-14 07:35:10",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "woodquest",
                                                                                            "body": "Do you?",
                                                                                            "score": 3,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2025-02-14 07:35:45",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Mammoth_Loan_984",
                                                                                                    "body": "I have friends on all sides of the political spectrum, yes.",
                                                                                                    "score": 2,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2025-02-14 07:40:46",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "woodquest",
                                                                                                            "body": "Doesn’t look like it",
                                                                                                            "score": 3,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2025-02-14 07:42:23",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Mammoth_Loan_984",
                                                                                                                    "body": "Pot, meet kettle",
                                                                                                                    "score": 2,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2025-02-14 07:42:46",
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "woodquest",
                                                                                                                            "body": "I would trust you on the pot part",
                                                                                                                            "score": 2,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2025-02-14 07:44:15",
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "lelanthran",
                            "body": "> I’ve never met a good programmer who lost a job due to DEI.\n\nHow on earth would you tell, though? What sort of test could you possibly construct, from the candidate PoV, that could estimate the probability of a application failure being due or not due to DEI?",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-02-14 08:41:50",
                            "replies": [
                                {
                                    "author": "Mammoth_Loan_984",
                                    "body": "Because I've worked with every skill level in tech between \"I can barely turn a rock on\", all the way up to literal celebrities in the world of software engineering.\n\nDEI is just political dressing on top of the normal hiring process. Nobody who is unqualified is getting hired. Nobody who is good at their job cares.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2025-02-14 08:44:46",
                                    "replies": [
                                        {
                                            "author": "lelanthran",
                                            "body": "> Because I've worked with every skill level in tech between \"I can barely turn a rock on\", all the way up to literal celebrities in the world of software engineering.\n\nI disagree that this answers the question asked. If you *can't even tell* whether or not you're leaving casualties in your wake, it's a bit disingenuous to claim that there are no casualties and that, even if there were, you aren't going to look for any!\n\n> Nobody who is unqualified is getting hired. Nobody who is good at their job cares.\n\nI've been in this business now for 25+ years. IMHO, both those statements above are wrong.\n\n*Sometimes* an underqualified candidate slipped through on the DEI card at the expense of a *very slightly* more qualified candidate.\n\nMaking the claim that the DEI initiatives never made a mistake is, in itself, an extraordinary claim and thus requires extraordinary evidence. Top-down edicts are not famous for being correct.\n\nThis \"trust me, bro\" approach to what was in fact and in effect a top-down edict did not engender confidence amongst the mere mortals.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-02-14 08:56:31",
                                            "replies": [
                                                {
                                                    "author": "Mammoth_Loan_984",
                                                    "body": "You're saying I'm taking a \"trust me bro\" approach but I really haven't seen much from you to indicate DEI actually caused any harm in any meaningful way.\n\nThis is a non-issue, designed to be inflammatory and stop people talking about what actually matters.",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-14 09:02:05",
                                                    "replies": [
                                                        {
                                                            "author": "lelanthran",
                                                            "body": "> You're saying I'm taking a \"trust me bro\" approach but I really haven't seen much from you to indicate DEI actually caused any harm in any meaningful way.\n\nWell ... yeah?\n\nI've not advocated for a top-down edict that has been enforced. You currently are. You're the advocate, you provide the data.\n\nWhat **I did** was to ask \"how would one construct a test to test your claim\". In that post I didn't even ask for results of that test, I was wondering how one would test your claim.\n\nThat's the whole point - if you're shying away from any falsifiability then that's fine, too, at least then we both know that (as of writing) we cannot devise a test.\n\n> This is a non-issue, designed to be inflammatory and stop people talking about what actually matters.\n\nI agree with this. But I also agree with the assertion that the original DEI enforcements and edicts were *also* designed to stop the masses thinking about what actually matters.\n\nThey appeared to have achieved very little, but still appeared to have played a small but significant factor in getting Trump elected, and these DEI policies being dismantled is no doubt still playing a part in his continued support.\n\nI feel that if there was less outrage and oppression olympics in the previous 4-10 years, the US would not have seen a Trump presidency in 2025.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-14 09:11:21",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dreamplay",
                    "body": "It's genuinely so sad how well conservative propaganda has worked on many people, including coloring the term \"DEI\" as racist or discriminatory. The point is that the \"racism\" you complain about exist, just that you refuse to recognize it cause you don't think people's biases affect society and especially hiring in historically discriminated industries including engineering.\n\nFor a method that noone should have a problem with, I'd recommend reading up on equality in shortlisting and please let me know your opinion of it. In summary, it's ensuring recruitment shortlists have increased equality (in as many factors as possible), while ensuring that truly the best person is hired (which some people argue targeted recruitment doesn't).",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2025-02-14 06:39:20",
                    "replies": [
                        {
                            "author": "Mammoth_Loan_984",
                            "body": "It’s pretty depressing. They really have these people arguing over grains of rice.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-02-14 06:48:13",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "scratchisthebest",
            "body": "See also [Codeberg's statement wrt. related issues in free software and hacker culture](https://blog.codeberg.org/we-stay-strong-against-hate-and-hatred.html):\n\n> Extreme right forces actively target members of our communities and discriminate based on ethnicity and gender, political background, sexual orientation, disabilities, nationality and faith. However **diversity is an important asset** in free/libre software communities and it is what makes our software great and development productive.\n> \n> By targetting some of our most active translators, nicest designers, best developers and all other motivated contributors, they are hurting the free/libre software ecosystem as a whole.\n> \n> Don't be fooled if right-wing forces promise to \"promote open source\" in their political agenda. This has nothing to do with the values of our movement! This is about national patriotism and protectionism, and they will happily accept splitting our community on their way.",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-02-14 11:43:24",
            "replies": []
        }
    ]
}