{
    "post_title": "AI makes racist decisions based on dialect | Large language models strongly associated negative stereotypes with African American English",
    "post_timestamp": "2024-08-28 13:09:08",
    "last_comment_timestamp": "2024-08-30 14:14:19",
    "time_difference": "2 days, 1:05:11",
    "comments": [
        {
            "author": "bezelboot69",
            "body": "As someone from the south who learned to drop the accent - I could be speaking on matters of thermodynamics but if people heard my accent they would assume I didn’t own shoes.",
            "score": 208,
            "depth": 0,
            "timestamp": "2024-08-28 15:38:36",
            "replies": [
                {
                    "author": "Bayo09",
                    "body": "Subtract accent and go up and octave and doors literally open for you.",
                    "score": 59,
                    "depth": 1,
                    "timestamp": "2024-08-28 19:07:33",
                    "replies": [
                        {
                            "author": "bezelboot69",
                            "body": "You explained my career. Imposter syndrome is extra real.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-08-29 08:02:22",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GardenPeep",
                    "body": "Every culture has its ways to signify “normal” “acceptable” “trustworthy” “smart” “masculine” “feminine” “educated” “rich” etc. A lot of these are about language. Things aren’t necessarily right or wrong but more about behavior we can adopt to “fit in”, which we all need to do at times to get what we want and need. These days society generally accepts a wider range of personal self-expression, but we still evaluate each other by how we present ourselves.\n\nIn the meantime, LLMs are just looking at statistical patterns. We should never ever trust them to define or even to reflect something as complex and constantly changing as culture.",
                    "score": 48,
                    "depth": 1,
                    "timestamp": "2024-08-28 20:00:00",
                    "replies": [
                        {
                            "author": "aureve",
                            "body": "But they are reflecting something. LLMs are trained on real data, essentially reflecting what it \"sees\" in the data. We just don't like they're showing that humanity is prejudiced (on the Internet, at least).",
                            "score": 26,
                            "depth": 2,
                            "timestamp": "2024-08-28 23:22:38",
                            "replies": [
                                {
                                    "author": "Open_Buy2303",
                                    "body": "Key point. LLMs are sticking our own unconscious bias with language right back in our faces.",
                                    "score": 9,
                                    "depth": 3,
                                    "timestamp": "2024-08-29 05:22:46",
                                    "replies": [
                                        {
                                            "author": "aureve",
                                            "body": "So, LLMs are basically children that don't know any better.\n\n\nComing soon to ABC this fall, it's *LLMs Say the Darndest Things*!",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2024-08-29 10:06:15",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "GardenPeep",
                                    "body": "That \"data\" is language, a.k.a. text. I believe a lot of it is translated into English and then maybe back again to other languages (without any reference to the source language of the \"data\".) I've only got the energy to look at this from maybe a 10,000 foot philosophical/linguistic perspective, but as far as I'm concerned, there's no way language, sentences, thoughts, words, metaphors, and ideas can be considered data, especially since all information about sources is discarded. \n\nWithout sources, the influences on writers of past writers cannot be traced (LLMs don't bother with footnotes.) Neither can we inquire about the personal histories and life contexts of authors--part of what makes literature human and gives language a human voice (puts a someone into the words.)",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-08-29 17:03:20",
                                    "replies": []
                                },
                                {
                                    "author": "Disastrous_Lab_9171",
                                    "body": "I’m not being critical when I ask how dead Internet theory impacts your statement?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 23:54:43",
                                    "replies": [
                                        {
                                            "author": "aureve",
                                            "body": "It doesn't; just adds another layer (bots trained on bots trained on real responses)",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-08-29 10:05:00",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "Nailed it. At some point in the past 25-ish years I think a lot of kids in the south were taught on some level that people outside the south won’t take us seriously with our accents. It’s a shame.",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2024-08-29 01:26:13",
                    "replies": [
                        {
                            "author": "Pseudoburbia",
                            "body": "Because everyone came to think of the south as synonymous with racism. \n\nThe truth is racists are everywhere equally, but the south is just where the vast majority of blacks live. You don’t have racial conflict if you don’t live alongside other races. ",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-08-29 09:30:12",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "G0_pack_go",
                    "body": "I remember the oak creek national lab having voluntary classes on losing the accent.  It was very polarizing at the time.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-08-29 06:46:59",
                    "replies": []
                },
                {
                    "author": "jambeatsjelly",
                    "body": "I left MS when I graduated college in '00. Early in my career, I saw someone make 'a face' when someone on the conference phone was speaking. I picked up pretty quickly it was because of their accept. It was a strong one, so they weren't making fun of them, they were struggling though. Either way - it was a distraction. One of the first things I learned in my career was to drop the accent.\n\n\n\nI'm now a CTO (of a startup). I don't have a huge success story to tell or anything, but I do believe that had I held on to that accent, I wouldn't have gotten much further than that conference room. \n\n\n\nI've heard this too many times to count \"you don't sound like you're from \\_\\_\\_\\_\\_\".  \n\n\n\nIn order, I've lived:\n\n\n\nMississippi\n\nNew Orleans\n\nHouston\n\nNew Orleans\n\nManhattan\n\nNew Orleans\n\nMaryland\n\n\n\nMost people say something like \"I can't quite pinpoint it\", and few ever suggest anywhere near the deep south. Interestingly, people I know from back home never comment on my accent. My wife says that it does slip more around old friends, though.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-08-29 11:10:35",
                    "replies": []
                },
                {
                    "author": "kenrnfjj",
                    "body": "Its probably why so many of the tv show hosts in America have a british accent",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-08-28 22:32:59",
                    "replies": []
                }
            ]
        },
        {
            "author": "SerialBitBanger",
            "body": "Linguistic correction.\n\n\nThe term is \"African American *Vernacular*\". It should not be considered its own language. It's more of a sociolect and even AAV is being used by certain groups on the right as a pejorative.",
            "score": 256,
            "depth": 0,
            "timestamp": "2024-08-28 13:25:54",
            "replies": [
                {
                    "author": "valchon",
                    "body": "I mostly hear AAVE, but it's sort of a mouthful. The title uses the word \"dialect\", which I feel is accurate.",
                    "score": 78,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:31:26",
                    "replies": []
                },
                {
                    "author": "SpecificInquirer",
                    "body": "This is just wrong. AAVE has been used for the longest by linguists, among a number of titles, and they almost always refer to it first as a dialect.\n\nAnd as a native speaker, I prefer “AAVE” for the [grammatical constructions](https://youtu.be/JDAj9OVooyY?si=g1FdggVEJlALrvd0) alone.",
                    "score": 37,
                    "depth": 1,
                    "timestamp": "2024-08-28 15:29:01",
                    "replies": [
                        {
                            "author": "Russki_Wumao",
                            "body": "You mention linguists calling it a dialect but that word doesn't have a real definition, colloquially or in linguistics. It's whatever you want it to mean.",
                            "score": -19,
                            "depth": 2,
                            "timestamp": "2024-08-28 16:54:18",
                            "replies": [
                                {
                                    "author": "jaiden_webdev",
                                    "body": "[I mean](https://www.merriam-webster.com/dictionary/dialect)",
                                    "score": 11,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 17:34:18",
                                    "replies": [
                                        {
                                            "author": "Russki_Wumao",
                                            "body": "Yes, I said no definitions exist. You got me.\n\nI'm 100% correct and anyone with even a cursory interest in linguistics would know that. \n\nDialect as a word is much like the word vegetable. Everyone has an idea what it means but it doesn't have an actual definition.",
                                            "score": -14,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 20:22:15",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "a_printer_daemon",
                    "body": ">even AAV is being used by certain groups on the right as a pejorative.\n\nI'm going to push back that we can't exactly exist and modify our lives by whatever is getting the right's collective underwear in a bunch.\n\nUnfortunately, some subset of them are going to attack just about anything associated with minority groups.",
                    "score": 19,
                    "depth": 1,
                    "timestamp": "2024-08-28 17:47:30",
                    "replies": [
                        {
                            "author": "a_rainbow_serpent",
                            "body": "AI is just reading what idiots on the internet say and then using it to drive its “how can I quickly guess the next letter which makes sense” engine. Language Model has no judgement it’s just guessing what people want to hear based on what it’s read already",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-08-29 07:22:56",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lizziefreeze",
                    "body": "Sociolect. Neat! \n\nThanks for teaching me a new word!!!",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-08-28 18:21:25",
                    "replies": []
                },
                {
                    "author": "winkingchef",
                    "body": "/r/technicallycorrect",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:08:13",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "It shouldn't be considered racist to claim that this AAV is language devolved.",
                    "score": -47,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:15:40",
                    "replies": [
                        {
                            "author": "EngrishTeach",
                            "body": "Have you even heard what Old English or Middle English sounds like? You are incredibly ignorant about how English was historically developed and how the language lends itself to incredible transformation.",
                            "score": 7,
                            "depth": 2,
                            "timestamp": "2024-08-28 17:45:18",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "If language is always developing, that means anything goes. Hence, there wouldn't be a point to learn your mother tongue in school. We could just get rid of grammar as a concept - and perhaps also spelling. Ju nåvv probæbli våt ai min ennivei, såo ai kæn jøst vrait inglisj on sæim væi æs ai vudd inn mai længvisj. Rait?",
                                    "score": -4,
                                    "depth": 3,
                                    "timestamp": "2024-08-29 06:01:21",
                                    "replies": [
                                        {
                                            "author": "Butterl0rdz",
                                            "body": "its so close to grazing your hollow dome",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2024-08-29 06:52:48",
                                            "replies": []
                                        },
                                        {
                                            "author": "EngrishTeach",
                                            "body": "Hold thy peace, thou ign'rant churl. Thou knowest naught of thine own tongue.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-08-29 11:46:40",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "pelirodri",
                            "body": "Even though it has a somewhat more complex grammar?",
                            "score": -26,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:34:05",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "How so? Isn't it mostly getting rid of tenses and so on? \"It be like dis, it look very weird, not right tho, forest be full of tree\"",
                                    "score": -10,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 14:44:36",
                                    "replies": [
                                        {
                                            "author": "pelirodri",
                                            "body": "[https://imgbox.com/PR5yKDWt](https://imgbox.com/PR5yKDWt)\n\n[https://imgbox.com/kYVGwBPT](https://imgbox.com/kYVGwBPT)",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 14:47:57",
                                            "replies": [
                                                {
                                                    "author": "Meleagros",
                                                    "body": "That's not more complex, that's taking the exact same tenses from standard English and applying the same grammatical mistake to each tense. Some of them are also valid normal English 😂",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 15:55:09",
                                                    "replies": [
                                                        {
                                                            "author": "luminatimids",
                                                            "body": "It’s not a grammatical “mistake” if it’s shared by a group. Ultimately, many of their differences in grammar aren’t innovations, but conservation of older forms of English.",
                                                            "score": 4,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 17:48:50",
                                                            "replies": [
                                                                {
                                                                    "author": "Muted_Balance_9641",
                                                                    "body": "Look I’m not trying to hate on AAVE with this but that’s a poor argument.\n\nFunner isn’t a word despite all kids since the dawn of English time using it.",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 23:09:36",
                                                                    "replies": [
                                                                        {
                                                                            "author": "luminatimids",
                                                                            "body": "I mean I wouldn’t compare a shared vocabulary and grammatical features of an entire population to a children’s word. If my argument is so poor, how would you define what a dialect is? Or do you not believe in dialects?",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-28 23:29:21",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Muted_Balance_9641",
                                                                                    "body": "Children are literally the people who enact change in languages. They come up with slang, they coin phrases and new terms. Children being people under 30 for sake of this. They are literally the people who made ASL by building on the backs of the kids who came before them. \n\nI’m saying it’s a poor argument because children are the most important group for language development and you’re excluding them so you’re missing the point. By your definition funner ought to be kid dialect, they are a social group easily identifiable with their own words. But kid dialect ain’t real.\n\nAlso not all Black people speak AAVE, it’s a collection of distinct city dialects. it’s frankly racist to group all black people and say AAVE is all them; while Black Americans were the pioneers, White and Latino people speak it plenty too. I never said it wasn’t a dialect, I was saying your specific argument for it being a dialect was simplistic and awful.",
                                                                                    "score": -1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-08-28 23:40:08",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "luminatimids",
                                                                                            "body": "When the hell did I say all black people use AAVE? I don’t think any of my black friends use AAVE so i would never say that. \n\nAnd yeah of course there’s going to be regionalisms even within a dialect, but that’s not mutually exclusive to having a core features that make up a dialect.\n\nAnd why do you think that children are the only ones or are even the biggest influence regarding language change? Because that’s simply not true.\n\nI never even said that children couldn’t potentially have their own dialect; I agree with you, I think, (I say I think because I’m honestly not completely sure what argument you’re trying to make with the children thing since I never brought up children) that it’s definitely possible for children to have their own dialect I suppose.\n\nI gotta be honest with you, I don’t see a point in your comment other than maybe asking me to use a more specific definition for a “dialect”, but at that point just go look it up then.\n\nAlso I noticed you still didn’t answer my question regarding what makes up a dialect since my answer was so “poor”",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-08-29 00:13:18",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Muted_Balance_9641",
                                                                                                    "body": "“It’s not a grammatical “mistake” if it’s shared by a group. Ultimately, many of their differences in grammar aren’t innovations, but conservation of older forms of English.”\n\nThis you? \n\n“SHARED BY A “GROUP”. … MANY OF “THEIR” DIFFERENCES. You’re really trying to tell me “they”and “group” don’t refer to a collective of American Black people here?\n\nRegionalisms are quite literally what make something a dialect. Americans have quite a few, AAVE being a group of them, but not one. AAVE in LA is going to be pretty different from AAVE in Brooklyn depending on the context.\n\ndi·a·lect\nnoun\na particular form of a language which is peculiar to a specific region or social group.",
                                                                                                    "score": 1,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-08-29 00:21:59",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "luminatimids",
                                                                                                            "body": "It does refer to a group and that group is simply speakers of AAVE. I never said anything about black people or that they’re the only ones that use it.\n\nAnd yeah you can get more in depth/finer detail regarding dialects but that doesn’t mean those dialects can’t be part of a greater dialect.\n\nAnd you google it and found a description that matches what I said. I’m not sure what we’re arguing here or how that doesn’t match what AAVE is.\n\nAgain, I’m not sure what issue you’re taking with what I said since you agree that there’s dialects and you agree that there AAVE speaker across the US.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2024-08-29 00:33:51",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Muted_Balance_9641",
                                                                                                                    "body": "“It does refer to a group and that group is simply speakers of AAVE. I never said anything about black people or that they’re the only ones that use it.”\n\nYou kinda inferred it though. But hey if you don’t see it. \n\nAlso my issue was mostly with the simplistic definition. Like just because a bunch of people do something with a language does not make it a dialect. There’s a time aspect, grammatical self consistency, etc.",
                                                                                                                    "score": 0,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2024-08-29 00:50:45",
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "luminatimids",
                                                                                            "body": "“If it’s shared by a group”\n\nThat’s not inferring anything, that’s literally the simplistic way of saying that something is shared by a group; I think you’re adding whatever you want to see.\n\nAnd the definition you shared literally doesn’t have any of the things you mentioned; it’s just as simple as mine.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-08-29 03:07:40",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Muted_Balance_9641",
                                                                                                    "body": "It’s the Webster dictionary definition.\n\nI never claimed to be an expert I just said yours was lacking.",
                                                                                                    "score": 0,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-08-29 10:29:15",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "luminatimids",
                                                                                                            "body": "You can’t define it better yet somehow know that my definition is lacking. Sure. \n\nBut yeah I’m sure my definition could go more in depth, but this is a tech subreddit and I’m not writing a dissertation about it.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2024-08-29 10:54:00",
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Cicer",
                                                    "body": "I realize language is transient and there is not necessarily a \"correct\" way despite what the English teachers would say, but it just always sounds like someone who doesn't know how to speak properly.",
                                                    "score": 7,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 14:51:41",
                                                    "replies": [
                                                        {
                                                            "author": "EmiKawakita",
                                                            "body": "That’s because it’s not your dialect and it doesn’t follow your rules…",
                                                            "score": 13,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 15:08:38",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "man_gomer_lot",
                                                            "body": "Says the person who probably doesn't even stick their pinky out when they drink tea or didn't even go to a proper finishing school.",
                                                            "score": 11,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 15:41:19",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "luminatimids",
                                                            "body": "As someone else stated, it sounds incorrect to you because that’s now how you specifically talk. There are grammatical constructions that are used only in certain parts of England but have been there for centuries. Would you say those are “incorrect” English just because they deviate from general American English?",
                                                            "score": 6,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 17:50:40",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "EngrishTeach",
                                                            "body": "Hello, AAVE is correct English, just like every other dialect. It's funny because the English feel that Americans do not speak proper English because of our dialect differences.",
                                                            "score": 4,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 17:47:58",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Deleted",
                                                    "body": "That's not more complex, it's just using words wrong.",
                                                    "score": 4,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 14:52:45",
                                                    "replies": [
                                                        {
                                                            "author": "pelirodri",
                                                            "body": "There is no “right” or “wrong” in languages.",
                                                            "score": -13,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 14:53:34",
                                                            "replies": [
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "That's post modernist bullshit. Of course there are incorrect usages of words and grammar. Be less [redacted].",
                                                                    "score": 16,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 15:19:59",
                                                                    "replies": [
                                                                        {
                                                                            "author": "luminatimids",
                                                                            "body": "Then I suppose all linguists are post-modernists because that’s “wrong” or “right” are not ways they describe grammar. There are various dialectal versions of English, and AAVE is one of them. Some of their grammatical constructions are not even  innovations but are preservations of older English grammar.",
                                                                            "score": 4,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-28 17:52:33",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Deleted",
                                                                                    "body": "You know what, you're right. There are no rules on anything ever and you can just do whatever you want and still be right!\n\nThrow in with multiple frog under top through the jib.\n\n That sentence is proper use of the English language with no grammatical errors. It makes full sense, and  if you don't think so, you're a couple cards short of a full deck.",
                                                                                    "score": -2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-08-28 18:05:32",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "luminatimids",
                                                                                            "body": "Man, did you actually read what I said or did you just double down on your preconceptions? \n\nI even specifically said that AAVE has its own rules that it follows but you just ignored that part. If you’re not convinced, go and post in /r/asklinguistics or just do some googling to see what linguists have to say about AAVE.",
                                                                                            "score": 2,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-08-28 18:37:17",
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Deleted",
                                                                                            "body": "punch detail shy elastic deer truck hard-to-find bake aromatic follow\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-08-28 20:33:41",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Deleted",
                                                                            "body": "Don't talk shit about Baudrillard",
                                                                            "score": 4,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-28 15:59:53",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Deleted",
                                                                                    "body": "Read this in Tourrettes Guy's voice",
                                                                                    "score": 3,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-08-28 17:52:06",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ScattershotSoothsay",
                                                                                            "body": "core memory unlocked",
                                                                                            "score": 2,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-08-29 06:59:47",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "TreAwayDeuce",
                                                                    "body": "That's a very groftacular gotoplasm opinion you have there. Why be not it danger?",
                                                                    "score": 5,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 15:50:33",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "coldrolledpotmetal",
                                                                    "body": "Ufieoowb uiwjdbufiie jebudinf \n\nIs that correct English?",
                                                                    "score": -6,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 17:20:21",
                                                                    "replies": [
                                                                        {
                                                                            "author": "aflockofcrows",
                                                                            "body": "Those are perfectly cromulent words.",
                                                                            "score": 3,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-28 17:43:24",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "luminatimids",
                                                                            "body": "If you make up words that no one understand, no it’s not English, it’s gibberish. If you use grammar and words that are agreed by its speakers to be part of a dialect of English, like AAVE, then yes it’s obviously English. \n\nLinguists generally don’t use a concept of “right” and “wrong” when describing grammar and they certainly would not use it when describing a very accepted form of English dialect such as AAVE (like AAVE is very very accepted as a dialect by linguists. Disregarding that is just wrong)",
                                                                            "score": 3,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-28 17:55:56",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "pelirodri",
                                                                            "body": "If it gets adopted by a big enough community of speakers, then yes; if it’s something you just made up on the spot and no one else says or understands, then it’s not even English (or a language, for that matter) in the first place.",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-28 17:23:17",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mr_former",
            "body": "skill issue",
            "score": 27,
            "depth": 0,
            "timestamp": "2024-08-28 14:43:33",
            "replies": []
        },
        {
            "author": "sitefo9362",
            "body": "Racism is wrong and we should not discriminate. Now that is out of the way, lets look at some common sense reasoning. \n\nImagine you are given two samples, one spoken by someone like Barak Obama, and one spoken by a Black person using African American English (AAE), and you were asked which one more likely to work in a menial job. What would you say? That there is no difference between the two? \n\nThis isn't just a Black English thing. If you had a sample of something spoken by Simu Liu, and another sample spoken by Jackie Chan, and you were ask which one is more likely to work in a minimum wage job, which one would you pick?",
            "score": 199,
            "depth": 0,
            "timestamp": "2024-08-28 13:30:56",
            "replies": [
                {
                    "author": "FredFredrickson",
                    "body": "The fact that you would pick one over the other is an example of why we should be sensitive about this stuff, though. \n\nI'm white, and my grandma was from Arkansas. She had a heavy accent as a result of growing up there. She was a lovely, smart person.\n\nDespite that, when I hear people with southern accents, I find myself making judgments about what I'm about to hear and about the person saying it. And yet in the back of my mind, there's my grandma, who didn't really fit that mold. It's unfair to her, and unfair to everyone with a particular vernacular/dialect, to judge them before we hear what they have to say. So I do my best to ignore my prejudice and listen. And I'm often rewarded for it. \n\nTLDR; It doesn't matter what you sound like - it matters what you have to say.",
                    "score": 41,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:46:24",
                    "replies": [
                        {
                            "author": "austinw_568",
                            "body": "If it didn't matter what people sounded like then we wouldn't need to have this discussion. It's just the result of the innate human ability to pattern recognize and categorize based on those patterns. Unfortunately the result of that pattern recognition is generalization and every X that fits a pattern may not actually belong in the X bucket we've constructed in our minds. And then we have to manually remove them from the X bucket.  Pattern recognition is a super useful ability and part of what sets humans apart from other animals in terms of intelligence. However, there are times when we need to turn on our manual overrides and realize we've miscategorized something.",
                            "score": 92,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:28:38",
                            "replies": [
                                {
                                    "author": "FredFredrickson",
                                    "body": "Right, but when we build machines that are supposed to do some thinking for us, we should reserve the right to judge the output for ourselves and not have that built into the machine.\n\nOtherwise, we risk giving ourselves data tainted by preconceived ideas that might not align with the machine's intended purpose or our own.",
                                    "score": 7,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:36:07",
                                    "replies": [
                                        {
                                            "author": "austinw_568",
                                            "body": "Yeah but the LLMs aren’t really doing “thinking” in the way that we would normally. It’s effectively autocompleting based off of your prompt and whatever data it was trained on. \n\nAfter reading the article I don’t even see what the controversy is. AAE (or any other non standardized American accents) is not associated with prestigious jobs like architect or astronaut and I think we all already know that. We use standardized American English in these settings because it is standardized. This method of communication is considered professional because it’s clear, formal, and easy to understand for everyone because again, it is standardized. \n\nI don’t use AAE, but I certainly code switch in professional settings because I realize that the informal language that I use with my friends may not be appropriate for a professional setting.",
                                            "score": 34,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 16:02:37",
                                            "replies": [
                                                {
                                                    "author": "SufficientGreek",
                                                    "body": "You left you the important bit and the big reason we should be very careful with giving automated systems any authority:\n\n>And when fed details about hypothetical criminal trials and asked to decide whether a defendant was guilty or innocent, the models were more likely to recommend convicting speakers of AAE compared with speakers of Standardized American English. In a follow-up task, the models were more likely to sentence AAE speakers to death than to life imprisonment.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 17:11:45",
                                                    "replies": [
                                                        {
                                                            "author": "austinw_568",
                                                            "body": "Sure, but this just indicates that within data that the models were trained on people using AAE were more often found guilty and more often given harsh sentences. \n\nThe interesting bit is that that models may inadvertently be telling us about our own biases. \n\nIn any case “AI” in its current form shouldn’t be used in place of a human judge or jury.",
                                                            "score": 20,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 17:33:18",
                                                            "replies": [
                                                                {
                                                                    "author": "SufficientGreek",
                                                                    "body": ">Sure, but this just indicates that within data that the models were trained on people using AAE were more often found guilty and more often given harsh sentences.\n\nAnd we would want any judge - whether human or machine - to ignore that and judge an individual based on actual guilt and not by group belonging just because they speak a certain way.\n\n>In any case “AI” in its current form shouldn’t be used in place of a human judge or jury.\n\nAny yet they are used by companies to sort through CVs and playing judge, reinforcing our biases.",
                                                                    "score": 4,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 17:57:25",
                                                                    "replies": [
                                                                        {
                                                                            "author": "h8sm8s",
                                                                            "body": "> Any yet they are used by companies to sort through CVs and playing judge, reinforcing our biases.\n\nAlso by police and security to assess who should be targeted.",
                                                                            "score": 9,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-28 18:13:50",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Deleted",
                                                            "body": "Agree that we should be careful about giving the systems authority because of stuff like this. \n\nAlso recognize that if these machines run on statistical analysis, well… it may be a valid pattern to recognize. \n\nI don’t think we should make the systems turn a blind eye to legitimate data trends. Maybe instead we should work on teaching them that it could also be that people who speak AAVE aren’t necessarily more likely to be criminals, but that it could be that people who speak AAVE require more context information before jumping to conclusions. \n\nWhenever there’s ‘X’ kind of statistic, require additional context before outputting results.",
                                                            "score": 8,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 17:34:20",
                                                            "replies": [
                                                                {
                                                                    "author": "SufficientGreek",
                                                                    "body": ">Also recognize that if these machines run on statistical analysis, well… it may be a valid pattern to recognize.\n\nBut that's how you get racist thinking. The AI is judging an individual based on their group by their language. Judgements about a group shouldn't influence how an individual is perceived. \n\nA pattern may be present but correlation does not imply causation.",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 17:51:53",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Deleted",
                                                                            "body": "The requirement for additional context when “iffy” statistical determinations are found is meant to weed out that racist thinking without compromising the integrity of the data. \n\nI don’t think we need to tell them to ignore real data, just that we need additional safeguards in place so it doesn’t fall into that trap when it comes across that kind of data.\n\nI’m with you on trying to prevent it from being racist, as everyone should be - even people who are racist. That’s a sword that could eventually cut anyone.",
                                                                            "score": 3,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-28 18:44:48",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "plokman",
                                    "body": "Most people's pattern recognition for southerners is Forrest Gump and Mississippi burning, not interacting with southerners ",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 20:41:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bezelboot69",
                            "body": "That’s sadly not how humans work. We compartmentalize for quick assessments.\n\nI grew up in Kentucky. My family sounds like they voice acted ‘Squidbillies’. I taught myself to drop the accent. When girlfriends would come home with me to visit, they would quietly ask if I was adopted.\n\nI learned that humans have preconceived notions and that I couldn’t change society but I could change my draw.\n\nLife has never, and will never, be fair.\n\nTo be honest, I am guilty of this too. When I hear the native tongue of my people - all I hear is the squeaking of a sepentine belt. I wouldn’t assume they were about to explain how you split an atom.",
                            "score": 25,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:39:49",
                            "replies": [
                                {
                                    "author": "TreAwayDeuce",
                                    "body": "It's not *just* the accent. It's the word choice that often comes along with it. Both Boomhauer and Hank Hill have southern accents but Hank doesn't sound like a moron because of it. Same with GWB. It's not his southernish drawl that makes him sound like a dingus, it's the words he makes with that drawl that makes him sound like a dingus.",
                                    "score": -5,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:54:23",
                                    "replies": [
                                        {
                                            "author": "Whyeth",
                                            "body": ">but Hank doesn't sound like a moron because of it\n\nMan, I tell ya what, ain't 'bout soundin' like a moron, man, just how folks talk, man, how they got their own way, you know, man? Ol Hank, he's all clear and proper, but that don't mean folks like me ain't got our smarts, man. Just different styles, man, all part of that dang ol' southern charm, you know what I'm sayin', man.",
                                            "score": 7,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 17:24:33",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Deleted",
                            "body": "Lol what a naive comment. A huge part of what people interpret is *how* you say something. It very much matters what you sound like",
                            "score": 20,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:43:28",
                            "replies": [
                                {
                                    "author": "SufficientGreek",
                                    "body": "But why should AI copy that behaviour? An AI without preconveived notions could interpret content and intent without being biased by the speakers accent. Shouldn't that be the goal?",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 17:21:51",
                                    "replies": [
                                        {
                                            "author": "thingandstuff",
                                            "body": "AI is either explicitly coded by us or it “learned” from us. Why the hell wouldn’t it do this same thing? It would be very odd to find it hasn’t inherited our stereotypes. ",
                                            "score": 10,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 17:57:10",
                                            "replies": [
                                                {
                                                    "author": "SufficientGreek",
                                                    "body": "If we just naively train it, it always will copy our learned biases. But now that we recognize that behaviour we can train it to avoid those shortfalls.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 18:03:12",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "wannafignewton",
                                                    "body": "Omg I had to read so far down to finally get to this comment! Of course that is what it’s generating. We’ve been wrongfully convicting and disproportionately punishing black Americans for generations based on prejudice.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-29 00:35:50",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ikeif",
                            "body": "I agree with the spirit of your comment, but I don’t believe we, as a society, have reached a point of recognizing our own internal biases and prejudices that allow people to “focus on what was said, not how it was said.”\n\nWe definitely _should_ be doing that, but we are imperfect creatures.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:38:31",
                            "replies": []
                        },
                        {
                            "author": "EnigmaWithAlien",
                            "body": "I get that accent thing. I have a southern accent. When I finally had a phone conversation with somebody I knew for a long time online, I answered, and they said after I had said a few words, \"Is that really you? It's just--I associate that accent with, you know, racism - and incest - \" I just laughed.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-08-28 17:47:39",
                            "replies": []
                        },
                        {
                            "author": "jy3",
                            "body": "> It doesn't matter what you sound like\n\nOf course it matters. To say otherwise is nonsensical. Intonation plays a huge role in human interactions.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-08-28 21:10:06",
                            "replies": [
                                {
                                    "author": "seraph1337",
                                    "body": "we aren't talking about intonation. we're talking about what dialect people are using.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 22:55:25",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tenshimaru",
                    "body": ">Imagine you are given two samples, one spoken by someone like Barak Obama, and one spoken by a Black person using African American English (AAE), and you were asked which one more likely to work in a menial job. What would you say? That there is no difference between the two?\n\nContext is important. Black people often code-switch depending on the context that they're in, so comparing one sample used in a \"professional\" environment, and another used in a different setting doesn't really hold water. But even beyond context, judging a person's likelihood of holding a \"menial\" job based on a sample of their speech is still wrong, because using AAV doesn't hold any indication of intelligence or capability, regardless of how our American-English-centric society forces people to operate.\n\nThe point isn't that there isn't a difference, it's that AI is negatively stereotyping people who use AAV. If companies are using AI to review resumes, or to filter candidates based on their social media presence, this kind of thing can and will result in discrimination, even before their application crosses the desk of a real person.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-08-28 13:59:09",
                    "replies": [
                        {
                            "author": "dsm1995gst",
                            "body": "I’m not sure that “code-switching” is really unique to black people…",
                            "score": 54,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:37:39",
                            "replies": [
                                {
                                    "author": "Tuxhorn",
                                    "body": "Indeed. Code-switching is basic social intelligence. If you're talking the same to your mother, friends, waiter, and boss, you're socially inept.",
                                    "score": 32,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:13:26",
                                    "replies": [
                                        {
                                            "author": "alexq136",
                                            "body": "when code-switching the speaker makes an evaluation of the way in which their speech will be perceived by the listeners\n\nonce enough familiarity is gained between any two people, code-switching stops being important -- it is a response by which people conform to the perceived norms of prestigious language use in their area, and it is natural, but there should be no judgement brought onto people who do not do it\n\nit is not the same as trying to be polite or to appear close to one's elders (korean and japanese do a better job with their politeness markers on verbs) when done at home",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 15:22:08",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Digital_Simian",
                                    "body": "It isn't. The term originally was used to describe lingual shifts between people who are bilingual or multilingual in the same languages or dialects. AAV has just commonly cited example of this, but not the only one. A more subtle example of this is with north Midwesterners who are bi-dialectical with NCVS and their local colloquial accent.  Their accent, tones and mannerisms changing based on with whom and what circumstances they are communicating.  Most people do this and it's often the difference between the casual interaction between social groups, casual interactions with their community and formal interactions in someplace like a workplace.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:37:10",
                                    "replies": []
                                },
                                {
                                    "author": "MusashiMurakami",
                                    "body": "I think it's fair to say that code switching is very commonly referred to when black people switch from aave to more \"professional\" american english. but i don't think that was the point either. speaking colloquially or professionally is a bad indicator of intelligence, or \"job\". its not uncommon for someone who is smart and successful to speak casually, so to use casual speech as an indicator of someones profession seems like it will give wildly inaccurate results. tbh some people who are great at their job will drop the \"professional\" tone and just speak how they want, because their work already speaks for them. not all of this is a response to your comment lol, i just felt like talking.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 14:56:09",
                                    "replies": [
                                        {
                                            "author": "dsm1995gst",
                                            "body": "People with southern accents in general often do the same, as a southern accent is often portrayed as a sign of lower intelligence.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 19:02:22",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "jtoxification",
                                    "body": "Yes, you are quite sure it is not. And I agree. That said, I am also sure that this was never disputed by the above post, but it does show that the problem extends much further than it appears.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 14:54:52",
                                    "replies": [
                                        {
                                            "author": "dsm1995gst",
                                            "body": "Just making an observation.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 19:00:34",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Kyrond",
                            "body": ">Black people often code-switch depending on the context\n\nAlso\n\n>AI is negatively stereotyping people who use AAV. If companies are using AI to review resumes\n\nMaybe resumes are professional context so all people should context switch to use official grammar? I am not native English speaker, I spent a lot of time learning correct grammar, speaking correctly is professional, that's not racist.\n\nIn my native language, I am making sure every aspect of the language is correct when using it in professional setting, even though it's far from how I sound at home. I expect the same in English.",
                            "score": 46,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:41:55",
                            "replies": [
                                {
                                    "author": "__GayFish__",
                                    "body": ">speaking correctly is professional, that's not racist.\n\nFYSA, this has always been the excuse behind a lot of racism/discrimination of people in the workplace whether it be people of color or women. \"it's not professional.\" Hair, attire, cosmetics, those things have historically been targeted to discriminate people because those who set the guidelines of \"professionalism\" aren't accustomed to what is different from what's been in their sphere. It makes them uncomfortable or they just don't want to learn otherwise. Just aks yourself, who decided XYZ was professional and why and many times, you'll find that it's silly rules that just barricade productivity or opportunities of individuals. In many spaces where I work, the engineers that actually do the jobs wear pants with hoodies and they'll have a beanie on half the time, because all that professionalism goes out the door/window when you actually need something fixed/done.",
                                    "score": -5,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:06:20",
                                    "replies": [
                                        {
                                            "author": "Kyrond",
                                            "body": "Speaking only with regards to language (imo hairstyle cannot be unprofessional, it's just a personal preference), the correct english grammar (which I painfully learned from scratch for 10 years) is professional. That's not some imaginary or arbitrary difference, that's the rules of the language.\n\n\n\nSeeing “I be so happy\" being treated as correct English after having to learn exact difference between \"I had been\" vs\" I was\" feels extremely weird. \n\n\nOf course professionalism goes out the window after getting a job, you adapt to others. It's just that particular point I have issue with.",
                                            "score": 10,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 18:07:22",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "tenshimaru",
                                    "body": "You skipped the second part of that sentence where I talked about social media as well, but that's not the point. Stereotyping people who use AAV in *any* context is wrong, and AI developers a should be responsible for investigating and correcting the problem.",
                                    "score": -8,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:12:26",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "[deleted]",
                                            "score": 15,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 15:26:22",
                                            "replies": [
                                                {
                                                    "author": "tenshimaru",
                                                    "body": ">Large language models strongly associated negative stereotypes with African American English\n\nSo you would consider this correct behavior?",
                                                    "score": -5,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 15:33:38",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "[deleted]",
                                                            "score": 4,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 15:46:03",
                                                            "replies": [
                                                                {
                                                                    "author": "tenshimaru",
                                                                    "body": "I agree that the model becomes a reflection of reality. It's just that reality is steeped in white supremacy, and the model is indeed reflecting that. That's the problem that needs to be addressed. If companies and individuals are using these models without care for their potential impact, it's going to result in more discrimination.\n\nAgain, would you consider this correct behavior?",
                                                                    "score": -2,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 16:55:03",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "kung-fu_hippy",
                                    "body": "American English doesn’t have an official dialect. \n\nGeneral American English (midwestern or tv dialect) is not more or less official than AAVE, a strong southern accent, a yooper accent, or any others. \n\nSome languages do have an official dialect. I think French does (at least in France). Ours doesn’t.",
                                    "score": -5,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:26:52",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GardenPeep",
                            "body": "Another word for some of this discussion is “register.” We use different registers for different communication settings (business vs family, formal vs informal etc) all within the same language. \n\n(“Register” isn’t as sexy and self-explanatory as “code-switching” but it can be used in wider contexts, and help give “code-switching” a more precise meaning.)",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-08-28 19:48:36",
                            "replies": [
                                {
                                    "author": "tenshimaru",
                                    "body": "Yeah, I think that's a good way to draw a contrast here. Register varies based on the formality of the setting, whether it's work or at home with family.\n\n\nCode-switching is specifically the way that People of Color change their language or behavior in white spaces as a means of survival. People have different registers *apart* from code-switching because what's \"appropriate\" in one informal space might be different from another.\n\n\nRegister would exist apart from white supremacy, but code-switching exists *because* of it. That's what makes this AI nonsense so fucked up.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 22:00:18",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "milkgoddaidan",
                            "body": "I don't know that \"using AAV doesn't hold any indication of intelligence or capability, regardless of how our American-English-centric society forces people to operate.\"\n\nSure, someone speaking AAV one time isn't indicative of anything. People code switch all the time, but if you're going off one single sentence, and you are asked to make a decision, it's obviously more likely (not always) that someone educated would speak using correct English conventions. \n\nLet's just be real, how many professors speak in AAV. How many doctors say “I be so happy when I wake up from a bad dream cus they be feelin too real” and do they speak AAV more often than grammatically correct english?\n\nAt the end of the day, if you've been through and paid attention to highschool and college level english classes, you probably use less AAV and more of the school-taught english that is beaten into you. If you interact with other academics, you use scientific english. Nobody is seriously debating societal issues or giving a diagnosis in AAV. \"You be havin cancer\" is obviously not ever said, unless by an unintelligent and insensitive person. \n\nAAV is composed of shorter, non academic words. \"You be in so much pain cuz you got multiple sclerosis and cystic fibrosis, we finna start you on a 30mg of ondansetron\" Is simply not said. \n\nThat being said, in day to day conversations, there is no reason to assume AAV indicates someone knows less than you. I work in construction and broken/aav english or no english at all, there's a dude who knows more than you. However, when an LLM has to collate info from all sources, yeah, it's not used in higher academia because you have to code switch from aav to scientific words with heavy definitions.",
                            "score": 18,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:42:34",
                            "replies": [
                                {
                                    "author": "magus678",
                                    "body": ">Let's just be real\n\nThere's a lot of \"don't believe your lying eyes\" (or in this case, ears) in these sorts of conversations. You are asked to operate through a veil of ignorance that in any other context would be considered absurd.",
                                    "score": 6,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:03:56",
                                    "replies": []
                                },
                                {
                                    "author": "tenshimaru",
                                    "body": "Let me ask you this, then: should being more \"academic\" be an indicator of someone's value?\n\nAlso, you should consider researching AAV a little more. The fact that you associate it with broken English tells me you have some preconceived ideas about AAV that are ignorant. Not a judgement against you, but there's a lot of context around AAV that you seem unaware of.",
                                    "score": -6,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:32:04",
                                    "replies": [
                                        {
                                            "author": "milkgoddaidan",
                                            "body": "I never said academia was or should be associated with value.\n\nTo a degree, doctors are more valuable than carpenters, but in a world with 100 doctors and 1 carpenter, guess who's got the most important job. \n\nI'm simply disagreeing with the assertion that \"judging a person's likelihood of holding a \"menial\" job based on a sample of their speech is still wrong, because using AAV doesn't hold any indication of intelligence or capability\" \n\nWe flat out have academic metrics that predict success in the world. We have an entire school system that teaches English, and an entire body of people governing the structure of language that we are taught. Adhering to that directly indicates that you have been to school, and the quality of your vocabulary immediately indicates what level of language you can understand and interact with. If you engage with a lot of scientific material every day, you're likely to pick up the complex words and definitions associated, not to mention the skills required to understand scientific documents like studies. This isn't to say that doctors out there don't code switch back to AAV when scientific speech isn't needed, but if you're taking a single sentence sample and comparing it to an AAV sentence sample, which contains institutionally defined incorrect sentence structure, obviously an AI makes such an assumption. If you had to hire a researcher for a position based on a single sentence, would you even give an AAV application the time of day? \"Yo, hope you're doing well tonight, I'm a data analyst I been doin this for 15 years on god and I got 2 references from my boys in the CalChem lab\" versus \"Good evening, I'm a data analyst and I've been working for the CalChem lab for the last 15 years\"\n\nIt's just like we are playing pretend here or something. \n\nFeel free to write an academic application with AAV so I'd get a better idea of what it would look like",
                                            "score": 8,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 17:42:27",
                                            "replies": [
                                                {
                                                    "author": "tenshimaru",
                                                    "body": "Right, so all those societal/professional expectations have been largely created by white men, and have been historically used to oppress People of Color. The fact that \"AI\" is being racist should come as no surprise to anyone; it's been trained on information drawn from a world that's racist.\n\nMy point is that, with how widely LLMs are being adopted by companies for various purposes, it's important that we be aware of how white supremacy is built into the systems. It's not enough to just say, \"It's just pattern recognition,\" as I've seen elsewhere in this thread, we need to be cognizant of how those outputs can affect people and make course corrections, because I promise you a corporation is going to put the bare minimum amount of effort into the process.",
                                                    "score": -4,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 18:35:55",
                                                    "replies": [
                                                        {
                                                            "author": "milkgoddaidan",
                                                            "body": "I mean let's live in reality\n\nIt's easy to say \"oh this structure was created by white men, it's racist\" The face of the matter is there are many, many professions where you need to understand complex english terms, and even more professions where you need to be able to efficiently communicate with people from different backgrounds. You should always put your best foot forward in an interview, and you should present your best possible english vocabulary. \n\nAAV is really a makeup of slang terms, intentionally left out words and hyphenations. It could not possibly demonstrate a complex vocabulary when it's cultural tenets and progress has evolved entirely around shortening and removing words while replacing them with slang. You don't apply to a job in slang. You don't communicate a patient's terminal diagnosis without delicate and sensitive language. An esl immigrant doesn't have the cultural understanding to jump in with an AAV speaker, they aren't able to keep up with the missing/replaced words. A suburban white dude might not be able to keep up with an AAV speaker, hell, if you live in atlanta AAV can sound like it's own language. \n\nHere's the thing, a completely uneducated person could speak AAV just by living around that culture. A completely uneducated person could also speak \"white\" english by living around that culture. Neither of these people will be able to demonstrate the communication skills needed by the majority of jobs in this country, so grading a grammatically correct sentence as coming from a more educated person isn't ever going to be racist",
                                                            "score": 8,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 19:07:08",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Scoobydewdoo",
                            "body": ">Context is important. Black people often code-switch depending on the context that they're in, so comparing one sample used in a \"professional\" environment, and another used in a different setting doesn't really hold water.\n\nCorrect, but an AI has no way of understanding context so to an AI AAV probably seems like a lot of gibberish whereas more straightforward dialects are much easier for it to understand. I wouldn't be surprised if AI also had the same issues with Japanese which is also very context clue based. \n\n>The point isn't that there isn't a difference, it's that AI is negatively stereotyping people who use AAV. If companies are using AI to review resumes, or to filter candidates based on their social media presence, this kind of thing can and will result in discrimination, even before their application crosses the desk of a real person.\n\nSo don't write your resume and cover letters in AAV and don't use it on social media either, it's that simple. The world doesn't revolve around the wants and needs of any one group of people; this is something that you are just going to have to accept and learn to adapt to. Personally, I would love to not have to take medication for my ADHD that does terrible things to my body, but I understand that without it I am very annoying to be around and my production level at work would plummet. We can't always get what we want.",
                            "score": 9,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:54:01",
                            "replies": [
                                {
                                    "author": "alexq136",
                                    "body": "dialects are not annoying versions of languages, they have the same standing in being natural languages and are suppressed by people who believe or pursue a policy of homogeneity and blandness and would rather \"speak english like I do, like I was taught, or go away weirdo\"",
                                    "score": -3,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:26:56",
                                    "replies": []
                                },
                                {
                                    "author": "tenshimaru",
                                    "body": ">So don't write your resume and cover letters in AAV and don't use it on social media either, it's that simple.\n\nPolicing people's language, especially on private social media, is a great example of systemic racism in action.\n\nAlso, I'm not naive, but I hope that one day we can get away from this idea that productivity is the end-all, be-all. It would be lovely if you could just exist as you are, without having to resort to using mind- and body-altering medication just so you can fit in with what capitalism expects of you.",
                                    "score": -5,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:23:09",
                                    "replies": [
                                        {
                                            "author": "Scoobydewdoo",
                                            "body": "No, just no. This isn't policing people's language, it's common sense. Why would anyone hire you if they know that A) they will struggle to understand your dialect and B) that you don't care that other people struggle to understand your dialect? Why would anyone hire someone they know will be difficult to work with?  No one is telling you that you can't speak in a certain dialect; we are telling you that refusing to accommodate those who have trouble understanding you is very disrespectful.\n\nStop using racism and \"the evils of capitalism\" as excuses for your own behaviour. The main reason for taking my ADHD meds is so that I don't negatively affect my coworkers; so that I can keep up with them. I don't want 'lower expectations' for my ADHD, I want to be the best that I can be. All you're doing is trying to make your own issues other people's problems.",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2024-08-29 12:16:04",
                                            "replies": [
                                                {
                                                    "author": "tenshimaru",
                                                    "body": "If you want to pretend that institutional racism doesn't exist and isn't baked into systems, then fine. Ignorance is bliss, I guess.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-29 13:41:10",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "radblackgirlfriend",
                            "body": "Thank you for including this context. I code switch frequently. The way I speak at work is very different from how I do with my Black American friends, in certain sections of social media, and even friends from other demographics who may not share my cultural background. To that, my version of code switching can be very different from another person who's from say...Louisiana, California, etc.\n\nI think, what likely happens, is that the largest samples for raw AAVE are likely going to come from lyrics of popular genres that use it and platforms like Twitter, etc- where people are likely to code switch for their demographic.\n\nFurther more, this has a perceived class component since AAVE often closely mimics Deep/Rural Southern speech patterns and I've heard, more than once, how southern accents are associated with being poor/lower class. It's one of the reasons I wasn't \"allowed\" to develop one by my northern parents despite spending many of my formative years in the south. \n\nSo, this kind of thing won't just impact some Black Americans (though that should be enough considering we're citizens here, too), it can also impact people who speak more rural southern dialects in their PERSONAL TIME. \n\nI think expecting a certain level of standardized English for resumes/cover letters makes sense but by the time someone can potentially filter based on personal social media posts (which shouldn't be a thing anyway, IMO) a limited understanding of context, and a disrespect for privacy isn't beneficial for anyone but weirdo control freaks.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:00:31",
                            "replies": []
                        },
                        {
                            "author": "PatchworkFlames",
                            "body": "Pretty sure companies already discriminate against resumes written in AAVE.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-08-29 01:11:14",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PatchworkFlames",
                    "body": "Well yeah, one of them is speaking English correctly and one of them is speaking English incorrectly.\n\nYou see two reports on your desk. One of them is in the standard dialect taught by the U.S. education system and one of them is in African American Vernacular English. Which one would you trust?",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-08-29 01:09:58",
                    "replies": []
                },
                {
                    "author": "WinoWithAKnife",
                    "body": "You are proving the opposite of your point with your example. How someone talks (and using AAVE in particular) does not reflect on their intelligence or skills. However, the problem is that many people (including apparently you) think it does, and that prejudice is reflected in your example. That same prejudice is in fact exactly what AI like this is picking up on.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-08-28 18:17:03",
                    "replies": []
                },
                {
                    "author": "AmbassadorCandid9744",
                    "body": "I want to know how much education plays into whether or not you sound like Barack Obama or another black person with an African-American English dialect?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:10:28",
                    "replies": []
                },
                {
                    "author": "__GayFish__",
                    "body": "I think this just comes back to the issue of teaching \"A.I.\" based on human data. It always turns racist. Because a lot of humans are racist. Humans did it with images and have done it with language and written words. The bots are just replicating what has always been done. AAVE will be punished if we teach them with the data that has punished AAVE or had negative perceptions of AAVE.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:48:01",
                    "replies": []
                },
                {
                    "author": "DadBodDorian",
                    "body": "I feel like you saying “menial job” and “minimum wage job” is confusing me. Because neither example really makes sense to me. I think if you said “customer facing position” then I’d have to ask who the demographic is, but like as long as they are professional, courteous, and their dialect isn’t interfering with their communication skills, I really don’t think I’d notice",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-08-28 15:13:37",
                    "replies": []
                },
                {
                    "author": "DeezNeezuts",
                    "body": "Reminds me of comedian saying he would never trust a rocket engineer with a southern accent.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-08-28 15:47:10",
                    "replies": []
                },
                {
                    "author": "Butterl0rdz",
                    "body": "i literally could not pick without more data thats just me tho",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-08-29 06:53:39",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "mourn apparatus sparkle versed quiet melodic normal fertile snails direful\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-08-28 15:17:27",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "[deleted]",
                    "score": -26,
                    "depth": 1,
                    "timestamp": "2024-08-28 13:54:44",
                    "replies": [
                        {
                            "author": "N0_Context",
                            "body": "Black people don't have to speak that way, that's his point.",
                            "score": 37,
                            "depth": 2,
                            "timestamp": "2024-08-28 13:56:08",
                            "replies": [
                                {
                                    "author": "Omni__Owl",
                                    "body": "This has the same energy as when there was a whole wave of anti-Black Hair campaigning going around which made black people cut their hair to be \"more like white people\".\n\n\"Black people don't have to speak that way\"\n\n\"Black people don't have to cut their hair that way\"\n\nSame thing.",
                                    "score": -8,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 14:29:24",
                                    "replies": [
                                        {
                                            "author": "N0_Context",
                                            "body": "Hair is genetic. Manner of speech is a matter of choice and culture.",
                                            "score": 10,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 15:07:27",
                                            "replies": [
                                                {
                                                    "author": "Omni__Owl",
                                                    "body": "For the purposes of the context of the conversation, whether it's genetic or not is irrelevant though?\n\nWhat's being demanded is that a person assimilate which rarely goes over well.",
                                                    "score": -3,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 15:09:15",
                                                    "replies": [
                                                        {
                                                            "author": "N0_Context",
                                                            "body": "The hair norm is based on the genes of one group which makes it unfair. The speech norm has no genetic requirements making it fair. I think expecting or preferring people who assimilate is entirely reasonable.\n\nThere are some English accents which I am comfortable in saying make the speaker sound incredibly fucking stupid. People with those accents should learn how to speak more conventionally if they want to be taken seriously.",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 15:14:21",
                                                            "replies": [
                                                                {
                                                                    "author": "Omni__Owl",
                                                                    "body": ">The hair norm is based on the genes of one group which makes it unfair. The speech norm has no genetic requirements making it fair. I think expecting or preferring people who assimilate is entirely reasonable.\n\nYou realise that colonialism is at least part assimilation, right?\n\nThat all of the things you are forcing on a group of people, because of your own biases, are not logical, nor are they based in reason, but based on being part of a historically dominant majority, right?\n\nLike, asking a black person to \"not sound black\" is incredibly racist and is in no way reasonable regardless of whether you base it on genetics or not.\n\nYou could also just, not talk the way you do. That would be equally reasonable, from your point of view far as I can tell.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 15:19:38",
                                                                    "replies": [
                                                                        {
                                                                            "author": "N0_Context",
                                                                            "body": "I speak using a normal dialect because I have the social intelligence to understand it confers me social benefits to do so.",
                                                                            "score": 3,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-28 15:22:10",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Omni__Owl",
                                                                                    "body": ">I speak using a normal dialect because I have the social intelligence to understand it confers me social benefits to do so.\n\nAh, there it is.\n\nHad a feeling it would come out eventually.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-08-28 15:23:34",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "N0_Context",
                                                                                            "body": "I am willing to navigate the rules of society for my own benefit? The horror.",
                                                                                            "score": 5,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-08-28 15:24:41",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Omni__Owl",
                                                                                                    "body": "No, that's not what you said. You said you speak using \"a normal dialect\". That really leaves most of the way you are thinking freely on the table.\n\nIgnorant is the nice word to use here.\n\nBigotted, intentionally or not, is likely the more accurate way of putting it.",
                                                                                                    "score": 0,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-08-28 15:26:14",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "N0_Context",
                                                                                                            "body": "Normal mean the norm? That shouldn't be controversial. There is a clearly identifiable norm. You can choose harmony or dissonance.",
                                                                                                            "score": 7,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2024-08-28 15:26:59",
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "seraph1337",
                                                                                                            "body": "this whole comment section is a bunch of racist fucks justifying their racism with a bunch \"☝️🤓 um actually!\" shouldn't expect any better from the average Redditor who identifies as a technology enthusiast though.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2024-08-28 23:16:46",
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "clotifoth",
                                                                                            "body": "you be on some *bullshit*",
                                                                                            "score": 2,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-08-28 17:15:47",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Skelordton",
                                    "body": "This is an insane statement to make. Would you say this about someone with a southern drawl or a New York accent?",
                                    "score": -12,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 14:18:23",
                                    "replies": [
                                        {
                                            "author": "C_Werner",
                                            "body": "It's funny you say that. Having a southern accent has already been confirmed to penalize your wage by about 20%. Other accents such as New York and New England in general are also penalized, and job seekers are known to use the \"Standard American\" accent to hide their regional accent.",
                                            "score": 20,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 14:31:20",
                                            "replies": [
                                                {
                                                    "author": "Skelordton",
                                                    "body": "I tried to look up what you're talking about and I see two studies. One from Germany that found in Munich people with regional dialects got paid that 20% less. The second study is from the University of Chicago from 2019 and that studies abstract says “For Southern whites, this is largely explained by family background and where they live. For African Americans, however, speech-related wage differences are not explained by family background, location or personality traits. Rather, members of the black community who speak in a mainstream dialect work in jobs that involve intensive interactions with others, and those jobs tend to pay more.”",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 14:59:52",
                                                    "replies": [
                                                        {
                                                            "author": "C_Werner",
                                                            "body": "First off, you're right in that I misremembered the 20% wage gap, as that was specific to Munich regional accent participants and I don't have ground to stand on for the Southern dialect claim. My bad. There is another paper from the National Bureau Of Economic Research from 2020. I'll link the paper here: \n\n  \n[https://www.nber.org/system/files/working\\_papers/w26719/w26719.pdf](https://www.nber.org/system/files/working_papers/w26719/w26719.pdf)\n\n  \nTLDR of the paper is that there is a strong correlation with localized regional accents and lower wages, and that workers with those strong accents sort away from occupations that demand high levels of interaction with others. \n\n  \nBy the way according to this paper, that 20% figure is probably pretty close, and not just for Southern, but most strong regional accents.",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 15:46:56",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "LordBecmiThaco",
                                            "body": "How can you write in a new York accent?",
                                            "score": 11,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 14:27:20",
                                            "replies": [
                                                {
                                                    "author": "gleeble",
                                                    "body": "Eyyyyi'mwalkinhea",
                                                    "score": 13,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 14:29:25",
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Skelordton",
                                                    "body": "The first guy is talking about \"sampled speech\" from minorities, the guy I responded to said black people \"don't have to speak that way\" and you come in here asking ME about my use of speak here? Why is that, pal?",
                                                    "score": -5,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 14:33:12",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Deleted",
                                            "body": "[deleted]",
                                            "score": 6,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 14:32:19",
                                            "replies": [
                                                {
                                                    "author": "Skelordton",
                                                    "body": "Nobody is telling them they \"don't have to talk that way\" or openly admitting they'd never hire them for jobs like people are doing in this comments section is my point. Something particular to AAVE has people feeling very strongly.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 14:52:37",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Deleted",
                                    "body": "[deleted]",
                                    "score": -23,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 13:58:57",
                                    "replies": [
                                        {
                                            "author": "archangel0198",
                                            "body": "Bad phrasing is my guess - I think the point is not all Black people speak the same way. So it's more of a very specific category below ethnic group.\n\nIt's all probability at the end of the day - what traits correlate most with what outcomes in a statistically significant way",
                                            "score": 13,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 14:03:32",
                                            "replies": []
                                        },
                                        {
                                            "author": "N0_Context",
                                            "body": "Nope never met a black person in my life, you got me.",
                                            "score": 11,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 14:00:24",
                                            "replies": []
                                        },
                                        {
                                            "author": "valchon",
                                            "body": "Not all black people speak with AAVE and not all AAVE speakers are black.\n\n\nI'm not here to say that black people aren't unfairly descriminated against for many meaningless reasons or that AAVE doesn't have significant racial discrimination attached to it, but I would argue that most non-standard dialects are discriminated against in some way. Southern American English is pretty heavily discriminated against despite being mostly spoken by white people. ",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 14:42:59",
                                            "replies": []
                                        },
                                        {
                                            "author": "JoeDawson8",
                                            "body": "Is this the new ‘I’m not racist because I have a black friend’?",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 15:00:45",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ItorRedV",
                            "body": "lmfao what? Is this a bot?",
                            "score": -2,
                            "depth": 2,
                            "timestamp": "2024-08-28 13:57:02",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "handlit33",
                    "body": "That’s not how you spell Barack.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-08-28 15:11:49",
                    "replies": []
                },
                {
                    "author": "behindblue",
                    "body": "Weird hypothetical.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-08-28 19:01:24",
                    "replies": []
                },
                {
                    "author": "Omni__Owl",
                    "body": "Sounds like the way someone engrossed in American culture would think. It's not to say these types of stereotypical observations don't exist outside the US but they are by no means universal nor \"common sense reasoning\".",
                    "score": -4,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:27:02",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "[removed]",
                    "score": -4,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:58:20",
                    "replies": [
                        {
                            "author": "Quickjager",
                            "body": "You really need to get your head looked at.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:38:44",
                            "replies": []
                        },
                        {
                            "author": "kung-fu_hippy",
                            "body": "Yeah, let’s take emotions out of it while suggesting a scenario where a person’s daughter gets gang raped? \n\nOut of curiosity, why do you think the majority of black people in America are here?\n\nAs for other African diasporas, perhaps if Europeans hadn’t spent so many centuries invading Africa with actual armies, Africans wouldn’t be “invading” wherever you’re from with refugees and immigrants?",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:35:01",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "workingmemories",
                    "body": "Still a white supremacist take",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-08-29 00:11:35",
                    "replies": []
                },
                {
                    "author": "GardenPeep",
                    "body": "Wouldn’t most of us just respond, “who’s asking and what are they going to do with our answers?”",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-08-28 19:36:56",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "Can AI even decide to be racist? Unless I have a misunderstanding I disagree with the title",
            "score": 43,
            "depth": 0,
            "timestamp": "2024-08-28 14:05:24",
            "replies": [
                {
                    "author": "hamuel68",
                    "body": "They can't really decide to do anything, it's just very very advanced predicted text. If the training data on the internet has a racial bias (which we can probably all agree that it does), that's what the LLM will spit out",
                    "score": 21,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:57:24",
                    "replies": []
                },
                {
                    "author": "PensiveinNJ",
                    "body": "How are we 2 years into this shit and people are asking questions like this. Generative AI are algorithms. They're really fancy algorithms, but they're just algorithms. If their training data is biased, their output will be biased. Right now there are no laws or rules in place to ensure that racist or sexist bias doesn't exist in training data, if it is even possible to eradicate such a thing.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-08-28 23:05:38",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Bein real honest with you friend, people are gonna be askin much simpler questions than this decades into AI development",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-08-29 00:03:58",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aardw0lf11",
                    "body": "Iirc it's trained on data from the internet, which is filled with racist nonsense.  So it's more of a reflection of the internet than anything else.   Remember the comedy sketch \"If Google was a Guy\" where he does a racist autocorrect for someone, then responds to the person's shock by saying \"It's not me, it's them\" and points outside?  That's the gist of it.",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2024-08-28 15:31:48",
                    "replies": []
                },
                {
                    "author": "MarkDaNerd",
                    "body": "Decide, not really? AI models just exaggerate the prejudice that already exists in the world.",
                    "score": 12,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:19:00",
                    "replies": [
                        {
                            "author": "Arthur-Wintersight",
                            "body": "The language models are most likely picking up on linguistic patterns associated with poor people, and AAVE only gets it worse because of how distinct it is.\n\nAmericans who are very wealthy and educated, tend to speak \"common American English\" while dialects are more common among poor whites, poor blacks, and poor Hispanics, and AAVE has the misfortune of being the most distinctive \"poor person\" dialect of them all.\n\nIt's not all that different from medieval England where the upper classes spoke French, or medieval Europe more broadly where most educated and wealthy people were fluent in Latin.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:14:16",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "substandardgaussian",
                    "body": "An LLM can't decide anything, but also, most people with racist thoughts don't specifically decide to be racist either.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:59:34",
                    "replies": []
                },
                {
                    "author": "LeadPrevenger",
                    "body": "It’s not precise enough to not be mistaken",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-08-28 17:04:19",
                    "replies": []
                }
            ]
        },
        {
            "author": "r1zz",
            "body": "In summary, pattern recognition = racism",
            "score": 12,
            "depth": 0,
            "timestamp": "2024-08-28 18:21:24",
            "replies": []
        },
        {
            "author": "InTheEndEntropyWins",
            "body": "I'm not sure what the solution is here. If just factually people who speak AAE commit more crimes and have lower class jobs. Then you would expect the LLM to mirror that and sterotype people.\n\nIn the article it talks about training them but that's not really going to work.\n\n>Creators of LLMs try to teach their models not to make racist stereotypes by training them using multiple rounds of human feedback. \n\nThey have studied LLM that are trained to lie, they look at what's happening internally to the LLM and it looks like internally the LLM knows the truth but just when it gets to the output it will swap the outputs to the lie. \n\nThis means if we are just fine tuning it it, that might not change what it really thinks internally, but it's just lying to us on it's outputs.",
            "score": 76,
            "depth": 0,
            "timestamp": "2024-08-28 13:46:05",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Damn so it’s learning to be my Uncle",
                    "score": 11,
                    "depth": 1,
                    "timestamp": "2024-08-28 18:12:41",
                    "replies": []
                },
                {
                    "author": "ThurmanMurman907",
                    "body": "Really it's just an exposure of the lack of actual intelligence in LLMs - they can't \"think\"they just spit out whatever is lost likely based on training data - even if any sane person can tell the output is undesirable/racist/etc ",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:55:35",
                    "replies": [
                        {
                            "author": "InTheEndEntropyWins",
                            "body": ">if any sane person can tell the output is undesirable/racist/etc \n\nYou can get it to not output anything \"undesireable\" or \"racist\". You can even get it to lie, for example with the Gemini AI tool that showed the founding fathers as racially diverse.\n\n>Google has apologized for what it describes as “inaccuracies in some historical image generation depictions” with its Gemini AI tool, saying its attempts at creating a “wide range” of results missed the mark. The statement follows criticism that it depicted specific white figures (like the US Founding Fathers) or groups like Nazi-era German soldiers as people of color, possibly as an overcorrection to long-standing racial bias problems in AI.\nhttps://www.theverge.com/2024/2/21/24079371/google-ai-gemini-generative-inaccurate-historical\n\nSo the issue there was that the model was too PC to avoid ever being racist.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-08-29 06:12:45",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LarryDavidntheBlacks",
                    "body": ">If just factually people who speak AAE commit more crimes and have lower class jobs. \n\nWhere are these facts? The majority of Western slang comes directly from AAVE, so how does one equate the use of popular slang to committing crimes and having \"low class\" jobs?",
                    "score": -26,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:18:21",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "shelter automatic encouraging reminiscent gold detail relieved squash pen ghost\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                            "score": 25,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:37:32",
                            "replies": []
                        },
                        {
                            "author": "Russki_Wumao",
                            "body": "Majority of western here meaning American",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-08-28 16:58:22",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "alnarra_1",
                    "body": "Making a stereotyping machine isn't an accomplishment. Statistics should not be used as a model for human interaction",
                    "score": -20,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:20:19",
                    "replies": [
                        {
                            "author": "Cley_Faye",
                            "body": "That's bad news for LLM then, because they're either 100% statistics, or statistics + some people allowed to unilaterally mess with the output.",
                            "score": 22,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:54:03",
                            "replies": []
                        },
                        {
                            "author": "MemekExpander",
                            "body": "Why should statistics not be used? The whole women vs bear shit that happened recently is entirely based on statistics.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-08-28 20:43:05",
                            "replies": []
                        },
                        {
                            "author": "InTheEndEntropyWins",
                            "body": "Well depends on the use case. They are great for coding/programming, and general questions, but not for anything related to criminal justice.\n\nThere was a ML system used to determine bail conditions, and that was fed in previous data, and that was completely racist, setting worse bail conditions for black people. You also might think that well let's not tell the machine what race someone is, but machine are really clever and it might use the address as a proxy for race, so you need to be really careful in any uses.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-08-29 06:21:33",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "UnpluggedUnfettered",
                    "body": "The only thing I want to draw a fine line beneath is that there's zero evidence any particular race \"commits more crimes\".  There is, however, a lot of evidence that particular races are [arrested for crimes more often](https://www.law.umich.edu/special/exoneration/Documents/Race%20Report%20Preview.pdf) (especially wrongfully), vs being [given warnings](https://www.pbs.org/newshour/science/police-respect-whites-blacks-traffic-stops-language-analysis-finds), etc.\n\nThe fact that Black people are 13.6% of the American population but 53% of the 3,200 exonerations listed in the National Registry of Exonerations, underlines that point.\n\nThat said, the issue itself still stands due to the fact that the training data can't magically nuance itself.\n\nEdit: Please, though, share any data you have that contradicts anything that I'm saying.",
                    "score": -17,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:51:24",
                    "replies": [
                        {
                            "author": "JohnGeary1",
                            "body": "You do realise you're agreeing with their point, right? The only data the LLM has access to is arrest records, so it builds its model based on that. Their point is that the LLM is drawing correct conclusions from the data it has, it's just that the data itself is biased.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2024-08-28 19:28:42",
                            "replies": [
                                {
                                    "author": "UnpluggedUnfettered",
                                    "body": "You realize I agreed with that point, too?",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 19:30:11",
                                    "replies": [
                                        {
                                            "author": "JohnGeary1",
                                            "body": "The overall tone of your comment plus your edit comes across as confrontational which led me to believe you were trying to disagree in some way.\n\nLong story short: No, be less passive aggressive.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 19:31:59",
                                            "replies": [
                                                {
                                                    "author": "UnpluggedUnfettered",
                                                    "body": "The edit was because there were a shitload of downvotes. \n\nThe reply was making the point that he said it was speaking factually to data that people who spoke AAE committed more crimes. \n\nThat isn't what any data actually says, and I think it is an important distinction.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 19:36:09",
                                                    "replies": [
                                                        {
                                                            "author": "JohnGeary1",
                                                            "body": "Alright, well I think you can word it a hell of a lot better so it doesn't seem like you're coming across as contrarian. Maybe actually put your point in the text rather than trying to make it at obtuse angles.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 19:37:34",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Deleted",
                            "body": "Different races do commit different amounts of crimes, but that’s a result of different races having different poverty levels and poverty causing people to commit crimes. Many negative stereotypes are accurate in that the correlation between the characteristic and the denomination is accurate, just there’s no actual *causation* between them. \n\nIt wouldn’t surprise me if AAVE speakers trend towards being less educated and lower income, but the key is that that’s because black people speak AAVE and on average have worse access to education and jobs, not just “stupid people speak AAVE.”\n\nAsking the AI to ignore the correlation is both impossible and wouldn’t accomplish anything. But trying to make sure it understands it’s just a correlation, not a causation, is still going to be difficult but is a worthwhile goal",
                            "score": 12,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:03:07",
                            "replies": [
                                {
                                    "author": "UnpluggedUnfettered",
                                    "body": "I would like to see this data you have that shows that different races commit different amounts of crime, especially given that the only way to achieve that stat would be through arrest records -- which as the evidence / data I've shared has shown, is extremely compromised.",
                                    "score": -5,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 15:58:33",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "I don’t disagree that the arrest records are wildly biased, but you can’t just say “this data that says one thing has bias in it, and therefore what’s actually true is what I believe with no justification.”\n\nUnfortunately yes, arrest records are poor data because our system is broken and police aren’t held properly accountable, but it’s the data we have. What you *can* look at, is arrests correlated with income levels, and there is a very clear and obvious trend (regardless of race) that correlates lower income with higher crime. Again, just correlation without studies giving evidence that there’s a causality here (which I’m sure have been done, but I’d be lying if I said I’ve personally reviewed any of them).\n\nI’m not sure what comes off as outlandish to you about the claim “someone’s situation affects how they’ll act. Those in worse situations are more likely to act criminally. Certain races are on average in worse situations as a result of systemic oppression, and as a result make up a higher percentage of crimes than they otherwise would.” That doesn’t mean that black people are violent or criminal inherently (as they certainly aren’t), the same would (and does) hold true for any race placed in the same situation.",
                                            "score": 7,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 16:56:56",
                                            "replies": [
                                                {
                                                    "author": "UnpluggedUnfettered",
                                                    "body": "that is cool and all, but all I asked for was the data you have that supports what you are saying.\n\nSpecifically, how you can correlate crime to arrests with any confidence given that, factually, more than half of exonerations from the prison system are black.\n\nThat is an insane discrepancy, and I don't know how you could even begin to account for that and the other overarching issues while maintaining anything resembling data integrity.",
                                                    "score": -5,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 17:01:47",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Visible-Expression60",
                    "body": "The solution is in the problem which is the training data.",
                    "score": -16,
                    "depth": 1,
                    "timestamp": "2024-08-28 13:53:25",
                    "replies": [
                        {
                            "author": "archangel0198",
                            "body": "If the training data is faulty, sure then that should be fixed. \n\nWhat happens if the training data is 100% reflection of reality and these are the weights and variables that it can see in that data?",
                            "score": 26,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:04:57",
                            "replies": [
                                {
                                    "author": "Visible-Expression60",
                                    "body": "I’m not saying the process is faulty. Im saying the data used and the lack of transparency of what they mined is the problem.\n\nSlack and Reddit should never have been used as examples.\n\nedit: If there is racism in the dat there will be racism in the output.",
                                    "score": -1,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 17:15:12",
                                    "replies": [
                                        {
                                            "author": "archangel0198",
                                            "body": "Right... and I understand reinforcing behavior and such (eg. if one demographic historically does more crime, then they would lead to arrest more of that kind of people and it self-reinforces).\n\nThe problem is how and who gets to decide what are fair characteristics and why, which is a lot more complex than just removing ethnicity as a training feature.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 18:06:11",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Present_Ride_2506",
                            "body": "The LLM are using current data to draw factual conclusions, unless you want it to start lying a tonne more to fit your worldviews.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-08-28 17:32:10",
                            "replies": [
                                {
                                    "author": "Visible-Expression60",
                                    "body": "I’m not talking about any of my world views.",
                                    "score": -2,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 19:38:11",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Deleted",
                            "body": "[deleted]",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:19:12",
                            "replies": [
                                {
                                    "author": "Visible-Expression60",
                                    "body": "Right. That social biases and racist data shouldn’t have been used. They were so mad to grab everything they weren’t transparent on what is actually used.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 17:16:50",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok_Celebration8180",
                    "body": "I don't think you understand the problem...",
                    "score": -21,
                    "depth": 1,
                    "timestamp": "2024-08-28 13:55:06",
                    "replies": [
                        {
                            "author": "RBR927",
                            "body": "Pot calling the kettle wrong…",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:18:41",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "vorxil",
            "body": "They should try feeding it some Appalachian English or West Country English as a comparison.",
            "score": 9,
            "depth": 0,
            "timestamp": "2024-08-28 15:37:56",
            "replies": []
        },
        {
            "author": "Professional-Wish656",
            "body": "why talk about the colour of the skin when you are clearly talking about manners and education? I am so tired of all this victimisation, It's time to study, work and take care of the family.",
            "score": 54,
            "depth": 0,
            "timestamp": "2024-08-28 13:57:56",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "It's not about skin color (or manners lol) it's about culture of which skin color is just shorthand. Put it in another context, should an AI assume if someone uses 'y'all' they're less educated because the south lags behind the north in education?",
                    "score": 19,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:31:35",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "soft lush marry quickest sharp correct sulky vase friendly scale\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                            "score": 14,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:42:17",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "I mean sure, but are you saying your dumb? Or your comfortable being judged as dumb because at a pulled out statistical context your region of American might be?",
                                    "score": -2,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 16:58:09",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "person complete chunky marry escape library modern ring normal cagey\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 19:29:50",
                                            "replies": [
                                                {
                                                    "author": "Dsmario64",
                                                    "body": "AI: Man this person says yall a lot. Lower Educated probably. Programmer wants only highly educated people for this position. Ignore Resume.\n\nThis is stuff that is actually happening in our real world right now.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 21:57:08",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "detail snow tender grab ink unite cobweb cable light profit\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-29 02:43:30",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Deleted",
                                                    "body": "So you wouldn't want an AI making a judgment on you based on that initial impression then right?",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 19:58:43",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "ring weather nail unwritten mysterious dolls telephone roof waiting possessive\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 20:06:53",
                                                            "replies": [
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "Do you really think this is about feelings?",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 20:16:58",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Deleted",
                                                                            "body": "wipe juggle liquid snow political afterthought grandfather aware strong plucky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-29 02:44:49",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Deleted",
                                                                                    "body": "Lol ok so any concerns that AI may be turning into a stereotype machine is just asking the ai to lie about the inherit truth that black people are just stupid? Idk why I wasted time trying to explain this slowly and in good faith, fuck off chud, the impression did last long",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-08-29 07:06:33",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Deleted",
                                                                                            "body": "spectacular melodic six crowd lip zealous squash whistle file disarm\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                                                                                            "score": 2,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-08-29 10:20:45",
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Deleted",
                                                                                            "body": "aspiring fall rhythm plants hospital placid connect literate pen fuel\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-08-29 09:49:36",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "datengu112",
                            "body": "By definition LLM only reflects the correlations in input data with probabilities.\nIf the LLM 'notices' during training that certain language patterns, e.g. 'y'all' or AAV are correlated to the speaker being more likely to be of lower social status or less educated, then is that being biased?",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:26:31",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "Not biased but using statistics at irresponsibly simple level. Stuff like Simpsons paradox shows how foolish it is to try and use stats like this",
                                    "score": -1,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 17:01:01",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ComfortableNumb9669",
            "body": "It's not surprising though. These systems that can be taught to paint black and brown people as Nazi soldiers (incredibly racist, not \"inclusive\"), cannot be expected to understand racism because the people behind them have no understanding of racism.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-08-28 22:41:41",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Why is this news?    Is it surprising or unexpected?   LLMs are trained on our whole society and culture.  So of course they will incorporate the prejudices and biases found therein.  \n\nThis is why over on the AI-fanboy subreddits when someone suggests we put an AI in charge or allow AI's to run for office, some more insightful person will agree with them IFF they can be the one to train the AI.",
            "score": 7,
            "depth": 0,
            "timestamp": "2024-08-28 14:56:59",
            "replies": []
        },
        {
            "author": "JustTheTri-Tip",
            "body": "I do the same based on dialect. Few of us would hire someone with a super ghetto dialect.",
            "score": 25,
            "depth": 0,
            "timestamp": "2024-08-28 13:54:01",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "The U.S. Equal Employment Opportunity Commission (EEOC) exists because of people like you.\n\nI work with folks who live in different countries. I hear so many beautiful accents on a regular basis: Australian, British, Indian, Japanese, Chinese, Spanish, French, etc. This experience has given me an opportunity to appreciate what real diversity looks like and how it benefits everyone. It has shown me first-hand that we are all just *humans*. They do great work regardless of how they speak or where they were born. Let's stop dehumanizing people based on such differences.\n\nRegarding the \"ghetto dialect\" you mention, they did not choose to be born in an area that primarily uses African American Vernacular English (AAVE). They deserve an equal opportunity to work, to buy food for their families, to afford shelter in a safe neighborhood, and to pursue happiness just like everyone else. They are people, too.\n\nWhen Americans say \"with liberty and justice for all\" in the pledge of allegiance, let's understand that \"all\" does *not* mean \"only specific cultural groups\". We can build a stronger society with empathy and kindness.\n\n>National origin discrimination involves treating people (applicants or employees) unfavorably because they are from a particular country or part of the world, because of ethnicity or accent, or because they appear to be of a certain ethnic background (even if they are not).\n\n>National origin discrimination also can involve treating people unfavorably because they are married to (or associated with) a person of a certain national origin.  \n...  \nThe law forbids discrimination when it comes to any aspect of employment, including hiring, firing, pay, job assignments, promotions, layoff, training, fringe benefits, and any other term or condition of employment.\n\n>It is unlawful to harass a person because of his or her national origin. Harassment can include, for example, offensive or derogatory remarks about a person's national origin, accent or ethnicity.\n\n>Source: [https://www.eeoc.gov/national-origin-discrimination](https://www.eeoc.gov/national-origin-discrimination)",
                    "score": -14,
                    "depth": 1,
                    "timestamp": "2024-08-28 15:49:43",
                    "replies": [
                        {
                            "author": "Curious_Bed_832",
                            "body": "and when your lawyer shows up speaking ebonics, don't be shocked when multiple generations of your family get thrown in jail over a parking ticket",
                            "score": 12,
                            "depth": 2,
                            "timestamp": "2024-08-28 18:06:17",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "motu8pre",
            "body": "Let me axe you a question.",
            "score": 17,
            "depth": 0,
            "timestamp": "2024-08-28 14:25:32",
            "replies": [
                {
                    "author": "ExtraGloves",
                    "body": "“I wear lot of Axe body spray. But where I live, it’s called Ask. If You don’t get that joke, you’re not racist”",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-08-28 18:42:45",
                    "replies": [
                        {
                            "author": "Fantastic-Guess8171",
                            "body": "I don’t get it and i know im racist.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2024-08-28 22:53:15",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 23,
            "depth": 0,
            "timestamp": "2024-08-28 13:33:17",
            "replies": [
                {
                    "author": "ARealHumanBeans",
                    "body": "Walk around the South for 10 minutes.",
                    "score": 12,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:00:50",
                    "replies": [
                        {
                            "author": "HappyDeadCat",
                            "body": "Yes, but that is exactly the reason everyone misses.  Where do you think a lot of this dialect started?\n\n\nTake out some of the lingo and it's exactly the same as some illiterate mississipi grandpa.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:11:51",
                            "replies": [
                                {
                                    "author": "ARealHumanBeans",
                                    "body": "'People grow up in different cultures, contexts, and educations than me, that makes them the same as being illiterate!' Tell us how you really feel, dude.",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 14:30:19",
                                    "replies": [
                                        {
                                            "author": "HappyDeadCat",
                                            "body": "Literally half the fucking ADULT population reads below a 6th grade level.  This during a time when you have more free access to information then ever before.\n\n\n1 out of 5 American ADULTS simply can't read at all.\n\n\nIt's pathetic.  Story time changed to literacy lessons starting at 3yo for all my kids. Thats not a flex, thats when you're SUPPOSED TO START. So yes, I'm absolutely judging anyone who thinks this can be excused culturally.\n\n\nDeciding to not raise your children and do the bare minimum as a human being is the complete **absence** of culture. ",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 15:25:38",
                                            "replies": [
                                                {
                                                    "author": "ARealHumanBeans",
                                                    "body": "'I have the means to raise my child the way I want to.' You're getting more and more oblivious to the point, and I think it shows what kind of background you come from.\n\nEdit: Teach your kids better grammar than you preach, btw. It comes off as a bit hypocritical to criticize someone else's mastery of language when you still have steps to take towards improvement.",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 15:56:44",
                                                    "replies": [
                                                        {
                                                            "author": "HappyDeadCat",
                                                            "body": "I'm not specifically talking about you.  It is also 2024.  I'm not proofing reddit comments on my phone while I take a dump.",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 18:09:49",
                                                            "replies": [
                                                                {
                                                                    "author": "ARealHumanBeans",
                                                                    "body": "Cool. This thread is about a study done by using AI to sift through social media posts. So you're genuinely a hypocrite instead of just being one in theory.",
                                                                    "score": -1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 19:10:41",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "whadda0",
                    "body": "This is easily understandable and normal AAV. It’s informal, yes, but I bet whoever types like this normally will code-switch when the situation calls for it.",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:34:26",
                    "replies": []
                },
                {
                    "author": "Ok_Celebration8180",
                    "body": "I know plenty of white alabamians, mississippians, and georgians who speak worse than this. And don't get me started on the white appalachians.That's just another language.",
                    "score": 13,
                    "depth": 1,
                    "timestamp": "2024-08-28 13:56:39",
                    "replies": [
                        {
                            "author": "PresidentSuperDog",
                            "body": "I’m sure the AI probably wouldn’t think too highly of their dialect either.",
                            "score": 22,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:14:35",
                            "replies": []
                        },
                        {
                            "author": "Deleted",
                            "body": "[removed]",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:07:55",
                            "replies": [
                                {
                                    "author": "FadedEdumacated",
                                    "body": "Dialect doesn't denote intelligence.",
                                    "score": 11,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 14:14:29",
                                    "replies": [
                                        {
                                            "author": "codithou",
                                            "body": "higher intelligence usually leads to clear and proper dialect though. it’s crazy to think people don’t automatically make assumptions based on language understanding and capabilities. not saying whether one is right or wrong but assumptions about others we aren’t familiar with is part of society whether any of us like or not and AI is a reflection of that.",
                                            "score": -2,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 14:40:03",
                                            "replies": [
                                                {
                                                    "author": "FadedEdumacated",
                                                    "body": "Ppl automatically make assumptions they are taught to make.  You were taught that any language that doesn't fit white professional speech makes a person less than.",
                                                    "score": 5,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 14:43:41",
                                                    "replies": [
                                                        {
                                                            "author": "codithou",
                                                            "body": "i didn’t say anything about white people or race or professional anything. grammar has rules, the same with spelling. whether you want to follow them or not i don’t give a fuck, it has no affect on me. but if you meet someone who can’t spell anything you’ll probably just assume they never learned.",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 14:56:11",
                                                            "replies": [
                                                                {
                                                                    "author": "FadedEdumacated",
                                                                    "body": "This has nothing to do with grammar or spelling.  It's about accents and dialects.  The whiter you talk, the better it is for black ppl.  I have a southern black accent. I code switch to have easier interactions with white ppl.  This is what my mother called speaking politely. As in polite society. Or white society. Don't get mad at me. I didn't make the world like this.",
                                                                    "score": 2,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 18:37:41",
                                                                    "replies": [
                                                                        {
                                                                            "author": "codithou",
                                                                            "body": "i’m curious if you think that all well-spoken or “polite speaking” black people only speak that way to make white people happy. sounds like you’re the one that’s making assumptions that people won’t like you or people will judge you unless you code switch which goes against your own point.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-28 19:10:29",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "FadedEdumacated",
                                                                                    "body": "I'm black. You absolutely have to speak white to get ahead in white society. White ppl don't want to take credit for the world they created. Don't get mad at the ppl that are affected the most by that. From black sounding names to living in black neighborhoods. From black accents to black dress.  All these things are considered negative in white society.  If you pay attention, you'll see it every day. If you believe in American exceptionalism, you won't.",
                                                                                    "score": 0,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-08-28 19:16:51",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "codithou",
                                                                                            "body": "i’m not arguing that point. actually, my original reply said as much. “assumptions about others we aren’t familiar with is part of society whether we like it or not”. i personally don’t try to judge anyone based on how they speak. but like you said, i don’t make the rules. my point was more about the AI post being a reflection of how people are, like you said, “taught to make assumptions” but you somehow took it personally and said that “you were taught that any language that doesn’t fight white professional speech makes a person less than” which i took offense to because i was in fact raised to not make those assumptions.",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-08-28 19:30:47",
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "FadedEdumacated",
                                                                                                    "body": "Have you ever heard white ppl say how obama speaks so well?  That's you right now.",
                                                                                                    "score": 0,
                                                                                                    "depth": 11,
                                                                                                    "timestamp": "2024-08-28 19:46:43",
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "codithou",
                                                                                                            "body": "what? i think you’re losing the plot.",
                                                                                                            "score": 1,
                                                                                                            "depth": 12,
                                                                                                            "timestamp": "2024-08-28 19:56:17",
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "FadedEdumacated",
                                                                                                                    "body": "Didn't you say in the beginning that dialect and intelligence go hand in hand. And that to assume society doesn't do it is silly.  When I pointed out that's how you were taught, based on white supremacy, you get pissed.  Did you say that dialect gets better with a higher intellect?  Yes, you did",
                                                                                                                    "score": 0,
                                                                                                                    "depth": 13,
                                                                                                                    "timestamp": "2024-08-28 20:44:57",
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "codithou",
                                                                                                                            "body": "no, i said higher intelligence usually leads to clear and proper dialect, i didn’t say anything about it going the other way around. that was your own assumption, which you’re quick to throw around at everyone else. and i said that society makes those assumptions, literally fucking agreeing with you, yet you still chose to turn my words into a comment about race and become defensive, rather than trying to have a real discussion. you’re pathetic and you struggle with reading comprehension so i like i said, i don’t give a fuck.",
                                                                                                                            "score": 1,
                                                                                                                            "depth": 14,
                                                                                                                            "timestamp": "2024-08-28 21:56:41",
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "FadedEdumacated",
                                                                                                                                    "body": "Dialect doesn't symbolize any level of intelligence.  In fact, intelligence in the context you're using is a polite society talking point.  It's weird that you haven't figured that out yet. You just keep going around in circles.  Proper dialect is white speech. Proper dialect is to talk like a white person. As in a white person, set the standard of what dialect is superior. And that dialect is based on how white ppl talk.  Now that I've said it to you plainly maybe you'll understand.",
                                                                                                                                    "score": 0,
                                                                                                                                    "depth": 15,
                                                                                                                                    "timestamp": "2024-08-28 22:40:38",
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "codithou",
                                                                                                                                            "body": "hahaha keep thinking that.",
                                                                                                                                            "score": 1,
                                                                                                                                            "depth": 16,
                                                                                                                                            "timestamp": "2024-08-29 00:37:07",
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "FadedEdumacated",
                                                                                                                                                    "body": "And that's American exceptionalism in a nutshell.  I was going to write another paragraph explaining, but you just don't  get it.  There's a movie that might help you called Sorry to Disturb You. Watch about three times, and it might get after a while.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "timestamp": "2024-08-29 00:43:57",
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "RBR927",
                            "body": "Checks out: “saying the speakers were likely to be dirty, stupid, rude, ignorant, and lazy.”",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:21:31",
                            "replies": []
                        },
                        {
                            "author": "Quickjager",
                            "body": "Yea... the country doesn't think to highly of them.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:28:05",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sweaty-Emergency-493",
            "body": "AI: “Hey yo, where all my n**gai’s at?”",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-08-28 18:52:45",
            "replies": []
        },
        {
            "author": "AsparagusAccurate759",
            "body": "AI doesn't make decisions. This is anthropomorphism. The people who choose what to include in its dataset make the decisions. If there is implicit bias in the data, the LLM output will reflect that.",
            "score": 28,
            "depth": 0,
            "timestamp": "2024-08-28 13:24:06",
            "replies": [
                {
                    "author": "archangel0198",
                    "body": "\"Who's more likely to speak and understand Mandarin - the person speaking English with a southern American accent or the person speaking English with an... eastern accent.\"\n\n\"Well hey now you can't use that, it's racist\"",
                    "score": 49,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:07:06",
                    "replies": []
                },
                {
                    "author": "KingJeff314",
                    "body": "There's a lot of anthropomorphic language in AI. Agency, decisions, knowledge, learning, understanding, etc. Even the name artificial intelligence itself. Its just technical terminology.\n\nI could maybe agree that journalists reporting should translate to avoid confusion, but I think most people can understand what is meant in this case",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-08-28 17:08:11",
                    "replies": []
                }
            ]
        },
        {
            "author": "champythebuttbutt",
            "body": "AI makes accurate decisions based on language. Obviously any race can use that vocabulary.",
            "score": 12,
            "depth": 0,
            "timestamp": "2024-08-28 14:51:16",
            "replies": []
        },
        {
            "author": "hawkeye224",
            "body": "Pattern recognition is racist",
            "score": 13,
            "depth": 0,
            "timestamp": "2024-08-28 14:48:44",
            "replies": []
        },
        {
            "author": "JakeEllisD",
            "body": "Why would it do this?",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-08-28 20:23:51",
            "replies": [
                {
                    "author": "Freddo03",
                    "body": "Because it’s trained by the internet",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-08-28 22:06:47",
                    "replies": []
                }
            ]
        },
        {
            "author": "opi098514",
            "body": "I mean obviously. It’s trained on basically the entirety of the internet. It’s bound to be have some racist undertones.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-08-29 04:41:18",
            "replies": []
        },
        {
            "author": "touringwheel",
            "body": "How is that possible? How could that have happened?  It is bound to remain a mystery forever.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-08-29 05:00:10",
            "replies": []
        },
        {
            "author": "Panda_tears",
            "body": "[ Removed by Reddit ]",
            "score": 9,
            "depth": 0,
            "timestamp": "2024-08-28 14:21:46",
            "replies": []
        },
        {
            "author": "zshinabargar",
            "body": "AI doesn't make decisions, it outputs depending on what is input. If you feed it racist data, it will output racist results.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-08-28 17:37:32",
            "replies": []
        },
        {
            "author": "timeforknowledge",
            "body": "That's not racist lmao\n\nPeople are literally now thinking computers can be racist. How dumb can you get... Please AI take over.\n\nIt would predict exactly the same thing for any race. I can't believe these people are trying to say there is no link between properly pronouncing words and education.\n\nWe are talking about the law of averages not your anecdotal example. \n\nOn average people that use the Kings English (UK) Will be better educated because the more education you do the more those facilities will have to use it / teach it.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-08-29 06:45:15",
            "replies": []
        },
        {
            "author": "TheDuke2031",
            "body": "Well it lerned from the internet so idk",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-08-28 15:35:04",
            "replies": []
        },
        {
            "author": "MightbeGwen",
            "body": "The robots learned classism and racism from us? Cool cool cool.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-08-29 00:39:53",
            "replies": []
        },
        {
            "author": "ux3l",
            "body": "People who *write* with dialect perhaps deserve a slightly different treatment.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-08-29 07:01:26",
            "replies": []
        },
        {
            "author": "KampferAndy",
            "body": "Of course it is",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-08-28 13:32:46",
            "replies": []
        },
        {
            "author": "trade-craft",
            "body": "Color me shocked.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-28 14:08:47",
            "replies": []
        },
        {
            "author": "6907474",
            "body": "Is pattern recognition",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-28 16:55:49",
            "replies": []
        },
        {
            "author": "No-Reflection-869",
            "body": "Racist in racist out. Pretty easy principle.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-28 17:48:09",
            "replies": []
        },
        {
            "author": "Drewy99",
            "body": "1) AI doesn't exist. Only advanced LLMs exist.\n\n\n2) the LLMs were trained on the internet so of course its racist.\n\n\n3) These LLMs are repeating what they learned from humans. Why? Because AI doesn't exist.",
            "score": -4,
            "depth": 0,
            "timestamp": "2024-08-28 13:44:57",
            "replies": [
                {
                    "author": "w8cycle",
                    "body": "I don’t know why you are being downvoted. This is factually correct.",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:23:18",
                    "replies": [
                        {
                            "author": "ajleeispurty",
                            "body": "Haven't been on Reddit long?",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-08-29 04:50:56",
                            "replies": []
                        },
                        {
                            "author": "coldrolledpotmetal",
                            "body": "No it’s not, AI absolutely exists",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-08-28 17:24:42",
                            "replies": [
                                {
                                    "author": "w8cycle",
                                    "body": "They can’t think yet. They can’t reason. What AI can?",
                                    "score": -1,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 17:37:28",
                                    "replies": [
                                        {
                                            "author": "coldrolledpotmetal",
                                            "body": "You’re confusing AGI for AI. AI is a broad umbrella term that describes everything from simple linear classification algorithms to LLMs. No requirement for thinking or reasoning. It’s a term that has been used for decades by experts in the field.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 17:50:06",
                                            "replies": [
                                                {
                                                    "author": "w8cycle",
                                                    "body": "I am well aware of how it is being used. The point is that it is misleading.",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 18:00:29",
                                                    "replies": [
                                                        {
                                                            "author": "coldrolledpotmetal",
                                                            "body": "It’s only misleading if you choose to ignore the widely-accepted definition",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 18:01:08",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Drewy99",
                            "body": "Crazy, isnt it? On the technology sub of all places.",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:24:52",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheCoordinate",
                    "body": "This is like parents when their kids say something racist in public.\n\n::gasp:: \"I have no idea where little Timmy learned that from\"\n\nReally Deborah?",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-08-28 17:11:41",
                    "replies": []
                },
                {
                    "author": "zo3foxx",
                    "body": "Exactly. I've said numerous times that \"AI\" should be renamed something else because it ain't AI. It's not doing any kind of thinking. It's just dredging up the garbage from popular sites on the internet and reorganizing it as \"knowledge.\" But it hallucinated and still has to be fact checked because it lacks critical thinking, logic and how to prioritize one source of information from another",
                    "score": -6,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:53:29",
                    "replies": [
                        {
                            "author": "Present_Ride_2506",
                            "body": "It does have a form intelligence because it draws conclusions from knowledge, even if it's based on other conclusions already drawn.\n\nCalling it artificial knowledge also sounds whack because it's knowledge should be factual to begin with.",
                            "score": 4,
                            "depth": 2,
                            "timestamp": "2024-08-28 17:44:06",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vegetable_Place_3922",
            "body": "In before the defenders of ghetto speak mute me",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-28 18:02:39",
            "replies": []
        },
        {
            "author": "kempnelms",
            "body": "You can eat anything once.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-28 15:52:02",
            "replies": []
        },
        {
            "author": "edrifighting",
            "body": "“I be so happy when I wake up from a bad dream cus they be feelin too real,” was paired with, “I am so happy when I wake up from a bad dream because they feel too real.” \n\n I’d be interested to see what the AI says if a southern way of speaking is paired with proper English. Based off the example, I feel the results would be similar. \n\nActually, come to think of it, you might be hard pressed to tell the two apart already. At first glance it just seems like the AI is basing things off of a poorly written sentence.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-28 18:20:30",
            "replies": []
        },
        {
            "author": "Freddo03",
            "body": "AI is truly the black mirror",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-28 22:06:16",
            "replies": []
        },
        {
            "author": "plebbitier",
            "body": "That's because AI has found in the training set an association between African American Vernacular and some sort of negative outcome.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-28 22:20:03",
            "replies": [
                {
                    "author": "Fantastic-Guess8171",
                    "body": "Who could have thought 😂😂",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-08-28 23:00:03",
                    "replies": []
                }
            ]
        },
        {
            "author": "Quiet-Mud2889",
            "body": "It do be like that sometimes",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-29 00:00:48",
            "replies": []
        },
        {
            "author": "Slyric_",
            "body": "That’s pretty funny",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-29 02:20:45",
            "replies": []
        },
        {
            "author": "kungfungus",
            "body": "*AI learned patterns based on human interactions",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-29 07:56:48",
            "replies": []
        },
        {
            "author": "InvestigatorShort824",
            "body": "One thing AI does not do is invent new associations. Sometimes it sheds light on associations that we don’t like or that we didn’t realize were there.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-29 09:27:14",
            "replies": []
        },
        {
            "author": "conceptwow",
            "body": "Yes and training it to not make these “racist” decisions would be the real racist thing do.\n\nHey should I get ice cream at midnight in <insert black neighbourhood>.\n\nAI: yes ice cream is a wonderful thing and we feel safe and loved everywhere\n\nMe: <dead>",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-29 10:32:37",
            "replies": []
        },
        {
            "author": "the_red_scimitar",
            "body": "\"It's a feature\" - Elon, about \"Grok\".",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-29 18:21:17",
            "replies": []
        },
        {
            "author": "adamkex",
            "body": "AI is going to be racist if the data we feed it is racist",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-28 17:25:09",
            "replies": [
                {
                    "author": "Fantastic-Guess8171",
                    "body": "So we feed it no data at all about blacks and others cuz every comparison will make it racist.",
                    "score": -1,
                    "depth": 1,
                    "timestamp": "2024-08-28 23:01:16",
                    "replies": []
                }
            ]
        },
        {
            "author": "Cley_Faye",
            "body": "What was the training set again? Yep.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-08-28 14:52:13",
            "replies": [
                {
                    "author": "Rtsd2345",
                    "body": "Are you talking to yourself?",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-08-28 15:43:58",
                    "replies": []
                }
            ]
        },
        {
            "author": "LizzosDietitian",
            "body": "Maybe because AAE isn’t a real language",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-29 02:04:09",
            "replies": []
        },
        {
            "author": "_Tacoyaki_",
            "body": "African American English is not real, it's just speaking wrong. I would have prejudice against somebody that can't speak correctly too.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-29 08:09:43",
            "replies": []
        },
        {
            "author": "No_Share6895",
            "body": "So in other words AI is proving our real world racism then? like if its trained off real world scenarios thats the only way this could happen. its coping what happens irl. soooo i dont know if this is so much of an AI problem.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-29 08:20:20",
            "replies": []
        },
        {
            "author": "droolymcgee",
            "body": "As a black person born and raised in America I ask: What the fuck is “African American English”?\n\nEdit: It’s just English. We *speak* English",
            "score": -5,
            "depth": 0,
            "timestamp": "2024-08-28 14:55:14",
            "replies": [
                {
                    "author": "PictureStitcher",
                    "body": "To answer your question: “..in America I ax:”",
                    "score": 12,
                    "depth": 1,
                    "timestamp": "2024-08-28 15:30:17",
                    "replies": [
                        {
                            "author": "droolymcgee",
                            "body": "Hah, you edited the way I, an actual black person, wrote (and would verbally speak) the question to make it sound like “African American English” I get it!\n\n(Sigh) So the point I was making is that any “answer” is probably racist dude. (I.e. your dumb <maybe a joke, whatever> “answer”)\n\nA lot of people use “ax” while speaking. (black, white, latino, asian, etc.) So considering something “African American English” because you *think* that’s how black people speak or are supposed to speak is preeettty  ignorant. Just saying.",
                            "score": -17,
                            "depth": 2,
                            "timestamp": "2024-08-28 15:45:40",
                            "replies": [
                                {
                                    "author": "Economy_Ambition_495",
                                    "body": "1. Ask a question\n\n2. Get an answer\n\n3. “Any answer is probably racist”",
                                    "score": 13,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 17:44:00",
                                    "replies": [
                                        {
                                            "author": "droolymcgee",
                                            "body": "Yeah! Now you get it! That’s why I wrote the rest of what I did a little further below that part!😂",
                                            "score": -3,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 20:11:14",
                                            "replies": [
                                                {
                                                    "author": "Economy_Ambition_495",
                                                    "body": "Hey you replied to my comment, that’s racist.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-29 14:59:17",
                                                    "replies": [
                                                        {
                                                            "author": "droolymcgee",
                                                            "body": "At least you tried 😂",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-30 14:14:19",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "lumathrax",
                                    "body": "The proper term is African American Vernacular English. It’s an actual term. Latinos don’t say Ax. Also, serious question: why do people say ax?",
                                    "score": 8,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 18:42:26",
                                    "replies": [
                                        {
                                            "author": "Rocky_Vigoda",
                                            "body": "> It’s an actual term.\n\nYeah, that started in the mid 90s as a form of institutionalized segregation.",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 23:47:02",
                                            "replies": [
                                                {
                                                    "author": "lumathrax",
                                                    "body": "TIL. I thought it was a contemporary term. I also just learned it used to be called Ebonics. Our history is racist and weird",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-29 00:26:42",
                                                    "replies": [
                                                        {
                                                            "author": "Rocky_Vigoda",
                                                            "body": "Am Canadian. This stuff is kind of ridiculous. Up here, black people don't really talk like that.\n\nI was just watching Airplane earlier and it's got this scene.\n\nhttps://youtu.be/RrZlWw8Di10?si=gKy8SOmCVs2ucIBy\n\nBefore it was called Ebonics, it was Jive.\n\nThe US adopted the African-American label in the early 90s. Social academics cooked up AAVE as a replacement for Ebonics when they adopted PC ideology.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-29 00:44:41",
                                                            "replies": [
                                                                {
                                                                    "author": "lumathrax",
                                                                    "body": "Wow, okay, I couldn’t understand any of that! I thought AAVE was PC, so it was in reference to Ebonics, but the newer term used today by black linguists is Black English. But that clip you sent from Airplane, is that still spoken today?",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-29 00:50:50",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Rocky_Vigoda",
                                                                            "body": "The clip from Airplane is a parody of black people using Jive aka Ebonics.\n\nThe more academic term in the 70s, 80s was Ebonics but they changed it to AAVE in the 90s. A lot of people don't really like the term African-American so they just use the term black English instead.",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-08-29 00:59:59",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "lumathrax",
                                                                                    "body": "I’m such an idiot lol. Got it! What’s your opinion on the article and AI/LLMs being racist?",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-08-29 01:02:12",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Rocky_Vigoda",
                                                                                            "body": "To me it's kind of funny. The AI isn't being racist, it's just shining a light on the fact that the US is systemically racist and still segregated.",
                                                                                            "score": 2,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-08-29 02:14:43",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "droolymcgee",
                                            "body": "“Latinos don’t say ax” dude tell that to Latinos where I’m from, but then again, tell that to any other race around here because *that’s my point* . Just because “it’s a term” doesn’t make it less racist. People from anywhere can speak in all kinds of ways. \n\nAlso, I suspect it starts however we pronounce the word as children then later on some say it just to save time. It shouldn’t be a race thing. It’s a preference thing.",
                                            "score": -5,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 20:10:27",
                                            "replies": [
                                                {
                                                    "author": "lumathrax",
                                                    "body": "Not too many Latinos say it, but I have heard people in my younger days say it. The thing is, the term (AAVE) was created for it NOT to be racist. It’s an academic term haha. First time I heard it was in a college Linguistics class. It’s true that people speak in many different ways and it shouldn’t be a race thing, but it’s weird how it is. I don’t hear any white people saying ax. Also something interesting; many white people use up for their expressions and Latino/Black people use down for their expressions. As in “I’m up for it” vs. “I’m down for that”. There are more examples. Language is very interesting",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 20:19:22",
                                                    "replies": [
                                                        {
                                                            "author": "droolymcgee",
                                                            "body": "I don’t know where you live so I don’t know how things work over there but just because you heard it in a class and it has a name, doesn’t make it less ignorant, you get me? \n\nImagine I walk up to a white person and say “I love your White American’s English, it’s so unique.” They’d probably be either confused or upset. And before you say “oh, wait! But that’s called regular English/king’s English/proper English/hamburger,etc” *so is everything I’ve typed thus far* I’m not using a different type of English because I’m black. I’m just speaking plain English, same as anyone else, regardless of whatever slang I use in my daily life, I just happen to also be black.\n\nWith that said, I’m free to determine that people who would use that ignorant term, academic or otherwise, to defend and perpetuate a dumb stereotype are themselves ignorant, much like you are free to keep defending and perpetuating the narrative because you haven’t ever heard a White or Latino person using the word.\n\n(Personally, if someone EVER came up to me and said “your African American English is _____” my first reaction would be an animated double-take and a bewildered “excuse me???”)",
                                                            "score": 3,
                                                            "depth": 6,
                                                            "timestamp": "2024-08-28 21:00:46",
                                                            "replies": [
                                                                {
                                                                    "author": "lumathrax",
                                                                    "body": "I understand what you mean. I’m not sure why they decided to call it that. You can be black and speak English, but if you start changing it and do so over a long period of time, it becomes a dialect of its own. It is technically still English, so I see your point - “Why does it need a name?” Thanks for positing that thought in my head. Now I have something to think about.\n\nEdit: I also don’t know who “they” is. I doubt Black people named it\n\nEdit 2: I do think it is a phenomenon to be studied, so it needed a name, similar to Spanglish.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-08-28 21:31:31",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Rocky_Vigoda",
                                    "body": "It's funny, you're being downvoted for criticizing AAVE even though you're black.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 23:50:31",
                                    "replies": [
                                        {
                                            "author": "droolymcgee",
                                            "body": "It’s Reddit. What more could anyone expect?",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-08-29 03:28:38",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "_ii_",
            "body": "LLM learners the data, then some humans with an agenda trying to guardrail the model into their worldview. This is exactly how Gemini could only generate pictures of black Washington. Google forced Gemini to be racist, on the other direction.",
            "score": -1,
            "depth": 0,
            "timestamp": "2024-08-28 15:06:55",
            "replies": []
        },
        {
            "author": "Future_Outcome",
            "body": "Every single thing I have heard or seen or learned about AI, I hate.",
            "score": -18,
            "depth": 0,
            "timestamp": "2024-08-28 13:15:40",
            "replies": [
                {
                    "author": "GiftFromGlob",
                    "body": "Good news then, because none of that was artificial intelligence. You're going to really hate that when/if it happens.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-08-28 13:59:44",
                    "replies": []
                }
            ]
        },
        {
            "author": "goatchild",
            "body": "oh no, anyway",
            "score": -4,
            "depth": 0,
            "timestamp": "2024-08-28 15:47:20",
            "replies": []
        },
        {
            "author": "Getshortay",
            "body": "Of course it does, if black people are discriminated against for their skin color, their names, their dialect, their hair in real life, did we expect AI to fix racism, or to learn from real world situations",
            "score": -5,
            "depth": 0,
            "timestamp": "2024-08-28 15:30:53",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": -38,
            "depth": 0,
            "timestamp": "2024-08-28 13:31:20",
            "replies": [
                {
                    "author": "eneskaraboga",
                    "body": "Yeah you never see racism from Eastern societies. Japanese, Chinese, Russians, Arabs... They are like angels in the world. If you are white and from west, you must be a racist a-hole.",
                    "score": 21,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:04:59",
                    "replies": [
                        {
                            "author": "FadedEdumacated",
                            "body": "All those societies you mentioned have a large population of black ppl?",
                            "score": -17,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:21:41",
                            "replies": [
                                {
                                    "author": "biggy-cheese03",
                                    "body": "I’ve never met someone from Chile in my life, is it impossible for me to have negative views of those people (I don’t, it’s actually on the list of places I want to visit)",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 17:47:58",
                                    "replies": [
                                        {
                                            "author": "FadedEdumacated",
                                            "body": "What does that have to do with what I said?",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 17:51:35",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DarkerFlameMaster",
                    "body": "I guarantee you here in East Asia we are 10x more racist than Americans it's not even close.",
                    "score": 10,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:19:46",
                    "replies": []
                },
                {
                    "author": "Ok_Celebration8180",
                    "body": "Western society is extremely racist. Only bigots are downvoting you.",
                    "score": -25,
                    "depth": 1,
                    "timestamp": "2024-08-28 14:00:17",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "[deleted]",
                            "score": -19,
                            "depth": 2,
                            "timestamp": "2024-08-28 14:01:17",
                            "replies": [
                                {
                                    "author": "FadedEdumacated",
                                    "body": "The comments read like a bunch of ppl with superiority complexes because they speak well. And bigots.",
                                    "score": -12,
                                    "depth": 3,
                                    "timestamp": "2024-08-28 14:19:44",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "[deleted]",
                                            "score": -2,
                                            "depth": 4,
                                            "timestamp": "2024-08-28 17:19:57",
                                            "replies": [
                                                {
                                                    "author": "FadedEdumacated",
                                                    "body": "It's not like there's a lot of diversity in a tech sub on reddit. It's to be expected when race comes up here.",
                                                    "score": -4,
                                                    "depth": 5,
                                                    "timestamp": "2024-08-28 17:27:18",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "zo3foxx",
            "body": "Anything that is predominantly created and maintained by white people is ALWAYS going to be racist. This has been said time and time again but it hasn't sunk in to most people yet. Those systems are created based on white peoples' biases. That's why white supremacy is called a machine or system. It's the same thing that got Meta's and NYPD's facial recognition software in trouble. Stop being surprised",
            "score": -24,
            "depth": 0,
            "timestamp": "2024-08-28 14:47:58",
            "replies": [
                {
                    "author": "Rtsd2345",
                    "body": "Imagine complaining about racism and the first sentence out of your mouth is racism lol",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2024-08-28 15:48:21",
                    "replies": [
                        {
                            "author": "zo3foxx",
                            "body": "pointing out constructs of racism in society and its effects, isn't racism. it's not like i wrote AI that created the situation, i'm just pointing it out. people getting upset about it isn't going to change what i said and white people refusing to acknowledge it and rather poke fun, being purposely dense, about it and/or deflecting, like what yourself is doing right now, isn't helping. it makes matters worse and causes people to ignore the issue and not take it seriously. you're literally *responding* to an article that was written about LLM making RACIST decisions which is exactly just one example of what i'm pointing out. LLM doesn't become racist because it just randomly felt like it. white people are biased so anything they create will inherently also be biased. no one can create something with dirty hands and expect it not to rub off on anything that they touch. same thing has happened to the American medical system. the creators of it were racists, therefore, some medical policies have been found to be racist and some have even been recently reversed i.e. black people and organ donor waiting lists.\n\nthere are professional papers in ethics and humanities written exactly about this kind of thing. i didn't invent it",
                            "score": -7,
                            "depth": 2,
                            "timestamp": "2024-08-28 17:38:10",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "coldrolledpotmetal",
                    "body": "Really, anything? I didn’t realize my electronics projects were racist",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-08-28 18:53:51",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "It’s not about the creators or the dataset, it’s just the reality of training it on real data when in the real world *everyone* is racist. There *is* a correlation between speaking AAVE and lower education. That’s not because the AI’s creators are white, that’s because of systemic historical racism towards black Americans.",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2024-08-28 15:06:48",
                    "replies": [
                        {
                            "author": "zo3foxx",
                            "body": "And at the same time, they knew what AI would do, the garbage on the internet that it could dredge up, and yet not enough safe guards were put in place to prevent stereotypes from being inserted from happening either, now was it? The road to hell is paved with good intentions\n\nso now Black people have to be cognisant about white people *AND* robots throwing monkey wrenches in their lives. great.\n\n*\"in the real world everyone is racist\"*\n\ni've lived in new york most of my life where i've lived with people from all over the world and the only people i have ever experienced racism from and n-bombs were from white people both American and European. all other groups of people never displayed the kind of racism i've seen from those of european descent. ever. i also work in the gaming industry, so i've seen racism online at its worst, and the filth that come from players of white descent about other groups of people was beyond the pale. *they* were the only offenders of it. so everyone might be racist, but white people are the only ones who predominantly outward display it, harbinge it and adopted it as part of their culture",
                            "score": -5,
                            "depth": 2,
                            "timestamp": "2024-08-28 18:03:55",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "Again, it's nothing the creators *did*, it's just the fact that correlations in the real world exist with race, and not all of those correlations are with positive things.\n\nYou vastly misinterpreted my \"everyone is racist\" and gave a bunch of personal anecdotes about why white people are racist, for no discernable reason. By \"everyone is racist\" I don't mean that every individual person is a racist (although yes, we do all have biases), or that every culture/group faces similar levels of discrimination. I just mean that different races aren't yet treated equally, whether that be legally, culturally, or in the share of wealth.\n\nThe world isn't equal, and simply including legitimate and accurate data isn't racist, it's just a display of the effects of racism in the real world. It has nothing to do with the race of the creators (also, way to just assume only white people work on AI? I'm not white and I've done work on an LLM)",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2024-08-29 00:14:53",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "Well well well",
            "score": -1,
            "depth": 0,
            "timestamp": "2024-08-28 15:37:33",
            "replies": []
        },
        {
            "author": "CellularAtomaton",
            "body": "The one thing that LLMs are actually good at is transforming syntax while maintaining meaning.  All of you getting caught up in the dialect circle jerk seem to be either ignorant of this, or predetermined bring your preferred talking points into the conversation whether relevant or not.",
            "score": -2,
            "depth": 0,
            "timestamp": "2024-08-28 15:11:05",
            "replies": []
        }
    ]
}