{
    "post_title": "Does anyone work full time at Data Annotation and how is it?",
    "post_timestamp": "2024-02-06 22:38:18",
    "last_comment_timestamp": "2025-05-04 20:11:12",
    "time_difference": "452 days, 21:32:54",
    "comments": [
        {
            "author": "stevends448",
            "body": "People get let go from it all the time with no explanation so it would be silly to plan your life around it.",
            "score": 13,
            "depth": 0,
            "timestamp": "2024-02-07 14:11:52",
            "replies": []
        },
        {
            "author": "nottakenusername2027",
            "body": "I do it and it’s been great but I will say you never know when it’s going to end. And I guess if they don’t like your work they just don’t give you any more projects. \n\nThe lack of security is very anxiety inducing so idk if it would be stressful for that reason as a full time gig.",
            "score": 10,
            "depth": 0,
            "timestamp": "2024-02-07 19:12:16",
            "replies": [
                {
                    "author": "PappaSmurfAndTurf",
                    "body": "I signed up and haven't gotten any projects yet. Do you have any tips to be selected?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-07-09 12:37:44",
                    "replies": [
                        {
                            "author": "RhinoTortoise",
                            "body": "I’m in the same boat. Did you ever get any jobs?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-11-22 07:40:15",
                            "replies": [
                                {
                                    "author": "zatkobratko",
                                    "body": "Same here lol, waited a week or so. Any updates for you?\n\nSaw you could add text to your background in \"profile\", maybe that helps them to pick you. Idk tho",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-12-12 06:57:45",
                                    "replies": [
                                        {
                                            "author": "WoodenRegular1684",
                                            "body": "guys do you got any project?",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-03-04 08:15:40",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ramona_Blue",
            "body": "I’m doing it full time right now but it isn’t a long term plan. As long as you remain realistic that there isn’t any guaranteed job security, you can definitely make a good chunk of change.",
            "score": 13,
            "depth": 0,
            "timestamp": "2024-02-07 14:55:58",
            "replies": [
                {
                    "author": "Apart-Fudge-8123",
                    "body": "How is it going now? Are you getting any project till now?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-07 11:54:55",
                    "replies": []
                }
            ]
        },
        {
            "author": "Ms_Jane_Lennon",
            "body": "DAT pays the best of these types of companies, but they're very particular about quality work. They aren't going to tell you if you're not doing well, or even if you are doing well. Either you'll stop getting projects, or you'll start getting better projects. That's how they communicate, and you may never get a second chance. That may be something you dislike, but they're not a scam. They pay reliably, work is unlimited, and my pay is up to $30 hourly with no coding. You must have a precise, nitpicky, logical, perfectionist personality type, or you may struggle. If those things come naturally to you, you can monetized that with DAT. \n\nHowever, I would never count 100% on any online contract work personally. I'm fairly risk averse, so I have other means of replacing this income immediately if it goes away tomorrow. \n\nI'd also caution you that long hours doing analytical work with maximum effort can cause quality to slip. Most people struggle to produce top quality work after many hours of focus. When I feel like I'm struggling to focus, I take breaks. I'd rather make less that day than ruin a good gig by turning in subpar work.",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-02-11 00:43:11",
            "replies": [
                {
                    "author": "Sentient_Prosthetic",
                    "body": "How long have you been working to get to $30 per hour, non coding? I've been with them since November and just got to $23-25/hr non coding.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-02-11 14:07:24",
                    "replies": [
                        {
                            "author": "Ms_Jane_Lennon",
                            "body": "I started in early November.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-02-11 14:33:38",
                            "replies": [
                                {
                                    "author": "Own-Ad-3876",
                                    "body": "As of now May 2024, are there still “unlimited” work available for non-coding work? I’m planning to apply.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-06-28 00:06:16",
                                    "replies": []
                                },
                                {
                                    "author": "Helpful_Client4721",
                                    "body": "Are there still projects?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-05-04 10:22:55",
                                    "replies": [
                                        {
                                            "author": "Ms_Jane_Lennon",
                                            "body": "Yes. I've never had a day without at least 15-20 projects but usually (and currently) far more.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-05-04 12:56:17",
                                            "replies": [
                                                {
                                                    "author": "Helpful_Client4721",
                                                    "body": "In here we get 1 project that disappears in less than 4 seconds...",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-04 19:42:59",
                                                    "replies": [
                                                        {
                                                            "author": "Ms_Jane_Lennon",
                                                            "body": "I've been super fortunate that I've always had tons of work.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-05-04 20:11:12",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "wings_00",
                    "body": "Hey dear, which websites u work on?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-10-20 20:04:13",
                    "replies": [
                        {
                            "author": "Ms_Jane_Lennon",
                            "body": "Data Annotation Tech",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-10-20 21:54:56",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Silent_Photograph785",
                    "body": "Was it hard to join? I’ve just put in my application and by reading some comments I’m starting to think I’ve done a bad job.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-23 03:12:14",
                    "replies": [
                        {
                            "author": "Ms_Jane_Lennon",
                            "body": "The process was very fast for me. While it wasn't difficult to join, I spent extra time on the assessments so I would do well.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-01-24 00:40:01",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "radarmike",
                    "body": "Sounds like slave labor without security",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-05-21 06:47:56",
                    "replies": [
                        {
                            "author": "Ms_Jane_Lennon",
                            "body": "I'm satisfied with the pay and only work when I feel like it, so calling it slave labor doesn't make sense. It comes off as sour grapes. It's not secure work. It could end at any time. (Lots of W2 workers have been laid off without notice this year too though). However, many people have been doing it for years. So far, I've been promoted into a reviewer role, and I continue to have a ton of work available 24/7. This isn't my only means of income, but it sure has been helpful. As a gig I can do in my jammies in my home office as much or as little as I please, I've been very happy with it. Started in November 2023 and no complaints so far after earning many thousands of dollars which was all paid out as promised right down to the minute. I actually have far more complaints about my professional full time job than DAT.\n\nI see you do a ton of gig work where you work as an independent contractor which is no different than DAT, so why are you singing out DAT in particular?  DAT is much better than any of the others you listed and those you listed are also not secure. Yet you aren't complaining about being insecure or being enslaved. Huh. Were you rejected by DAT? Because it seems like you're just mad about not being selected. Sour grapes.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-05-21 07:43:44",
                            "replies": [
                                {
                                    "author": "radarmike",
                                    "body": "Oops, looks like i touched a nerve. Sorry if my comment offended you. It seemed like lot of walking on egg shells type of work with 0 security, that's why i said that. But as long as you are enjoying, good for you! May your time there last as long as you wish to work. I truly wish you the best.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-05-21 12:47:40",
                                    "replies": []
                                },
                                {
                                    "author": "NobodyLivesHere24",
                                    "body": "Hey! Do you mind if I ask how many hours per week you usually do? I’m a student, so this kind of work is absolutely perfect for me in terms of the flexibility, but I’m petrified that if I ramp up my hours a little then I may lose it altogether. So far everything’s gone well; I’m consistently getting more (and higher-paying) tasks on my dashboard and I’ve increased my hours slightly, but given what I’ve heard about people being shut down for earning too much, I’m curious to hear what hours others are putting into the platform, especially someone like yourself who has been doing this for so long.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-06-19 07:37:04",
                                    "replies": [
                                        {
                                            "author": "nhunter19",
                                            "body": "Just wondering, how are people being shut down for earning too much? Surely if they provide high quality work, they wouldn't be kicked out?",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-06-27 11:34:22",
                                            "replies": []
                                        },
                                        {
                                            "author": "Ms_Jane_Lennon",
                                            "body": "My hours vary a lot. If your quality doesn't falter, I see no reason you'd lose access. For most people, keeping quality high while doing analytical work is challenging after awhile. Be honest with yourself and take breaks when in doubt.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-06-28 00:14:45",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "zatkobratko",
                                    "body": "Hi bruv, applied like 2 weeks ago. Havent heard or gotten any taks. Any tips on how to receive tasks? Like is there something you can do? \n\nThanks in advance",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-12-12 07:01:10",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RefrigeratorShot7322",
                            "body": "No. Well paid WAGE labor with zero benefits, without job security.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-06-06 10:02:48",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ladysincere",
            "body": "I did one, or was it two?- projects with them and did well. However, I've gotten nothing since. You can't even find a way to contact them...",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-02-08 17:40:26",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Did the jobs just stop appearing in your dashboard? I'm worried about this too.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-02-08 23:37:04",
                    "replies": [
                        {
                            "author": "ladysincere",
                            "body": "Yes.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-02-09 00:00:50",
                            "replies": []
                        },
                        {
                            "author": "ladysincere",
                            "body": "At this point I think I was lied to. When I completed the first 1 or 2( can't remember  how it was done),  I was asked about another through email. It never showed on my dashboard.  That was a very long time ago. Over a year. I might as well delete the account.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-02-09 00:03:10",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bobfieri",
            "body": "I’m trying to make it my full time gig rn, I just started last week but I’m struggling to have projects to work on as of now. Many people said the same so it seems like it’s just the time rn hopefully. The fact they can/will cut you off without warning is scary, but I live in an at will state so it’s not much different honestly. I had some projects I really liked last week so I’m hoping I can get more hours and more enjoyable stuff to do :) I barely got 2 hours in today 😩",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-02-09 22:13:47",
            "replies": [
                {
                    "author": "jwrado",
                    "body": "Every state is at-will except Montana",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-04-24 19:47:13",
                    "replies": []
                },
                {
                    "author": "Hipster_Lincoln",
                    "body": "howd it go",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-21 18:12:48",
                    "replies": [
                        {
                            "author": "bobfieri",
                            "body": "I’m still on the platform but haven’t worked consistently on it for like a year but. No real issues",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-21 21:26:41",
                            "replies": [
                                {
                                    "author": "Hipster_Lincoln",
                                    "body": "fair enough, thanks",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-02-21 21:28:51",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Past_Body4499",
            "body": "Yes",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-02-12 05:54:04",
            "replies": []
        },
        {
            "author": "Intrepid_Rest6007",
            "body": "You might want to read this 1st... I am just getting out of a DATA ANN0TATION TECH job trying to get the money they took from me back. How it works is you put $100 (bitcoin) into what they call a work account. This money is used to optimize products for merchants. The work is fast and simple. You make $50 in pay and $40 in commission a day, then you get that and your $100 backs at the end of the day. Here is the clincher. They have a \"Random\" bonus system. If during your 3 sets of tasks (40 each) you hit a bundle you get 15-100% the regular commission. I got one during training. I think I got an extra $8. 1st day went smooth but the person training confused me more than helped me. 2nd day I hit another bundle. Here's the part they don't for-warn you about. Now to continue to finish and get my money I have to put another $85 in. So, I cough it up, Finish the set, I get my $90  plus $185 deposit and my extra $60. WhooHoo, right? Wrong! This is the scam. Next day, same thing except this time they need $475 more. Now, I'm on disability so I don't have that kind of money at my disposal. So I I use my rent. Start back up again BOOM! Another bundle, 1st task. What are the Random chances of that, right? Guess what? This time I have to pay $1471 to continue so I can get my new found fortune (haha) and my $575 back. I don't have that much money. No one mentioned this in \"training\" So, I'm out, I cant finish, I don't get paid my $90, my $575, MY money i put in or my 2 (15-100%) bonuses. I get nothing and now I can't pay rent due the next day. If I did have the money I probably wouldn't have done it any way $50 says once I started up again I'd get another bonus and this time it could be $4000. Fool me twice...Right!? So think about it before you work for them it's a scam from the get go. I have documented everything. If you want to see it or have questions, hit me back in the comments on this review. STAY AWAY, PLEASE. Leave the job to the little rich kids who can afford to have Daddys Money taken away. You can read their users guide but it doesn't mention paying more money to get your money back. If you ask they give vague answers and show you sweet innocent pictures of the person training you.(another lie)",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-01-20 02:14:20",
            "replies": [
                {
                    "author": "lilnate22",
                    "body": "Mate that's not data annotation you just got scammed",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-12 21:00:40",
                    "replies": []
                }
            ]
        },
        {
            "author": "itsyourmovego",
            "body": "Literally applied last night",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-02-07 12:44:37",
            "replies": [
                {
                    "author": "drewstake",
                    "body": "Did you end up getting it?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-05-24 17:15:13",
                    "replies": []
                }
            ]
        },
        {
            "author": "GymBloke123",
            "body": "Hey, there are a bunch of accounts that answer these questions, and whose only comments are talking about how legit it is. Which is… concerning. I keep getting ads from them, and I think if a company goes so hard to make themselves look legit with such obviously fake promotions it’s probably a scam.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-02-08 05:50:31",
            "replies": [
                {
                    "author": "Past_Body4499",
                    "body": "I've been doing about 20 hours per week for the last 8 weeks or so. Making very good money as a side gig.",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-02-08 18:14:20",
                    "replies": [
                        {
                            "author": "pikasauce",
                            "body": "How much are you making per hour?",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-02-09 15:07:09",
                            "replies": [
                                {
                                    "author": "Past_Body4499",
                                    "body": "Almost every (likely 97%+) project I work on is over $40 per hour.",
                                    "score": 6,
                                    "depth": 3,
                                    "timestamp": "2024-02-09 18:12:48",
                                    "replies": [
                                        {
                                            "author": "Stacixs3646",
                                            "body": "How hard is the exam for that?",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-09-27 14:56:41",
                                            "replies": [
                                                {
                                                    "author": "ArcaneM37",
                                                    "body": "I'm not who you asked, but I did the original application and exams for core, biology, physics, and math last night. it took about 7 hours total. The math exam was easy imho. Physics was hard. Like I love physics, and I could not answer one of the questions at all. Biology was easy as long as you knew the subject they were discussing. If you don't know anything about genetic illness or Crispr or whatever subjects come up in your exam, you're gonna have a hard time. I did not try the chemistry exam because the example exam I saw earlier was over my head.... and I am a material scientist.\n\nSo in short, quite. The exams are quite hard. I have education and work experience related to these subjects and I found them challenging.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-04 13:57:53",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "GymBloke123",
                            "body": "Are you a coder?",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-02-12 04:36:30",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "KevyP99",
                    "body": "Writing from northern New Jersey, in the United States. I’ve spent days reading reviews and these Reddit posts with all their comments, and had the same concerns about everything being positive and it being a scam.\n\nI took my chances and applied 7 days ago, expecting to wait a few weeks to hear back, if it was legit at all. THE NEXT MORNING after applying, I had access to the platform and 2 or 3 assessments. I took those, and they graded one of them 1 day later, and the other one more day after that. THE NEXT DAY when I logged in I had tasks available to work on, I’ve now been doing projects for them for 4 days and earning $$$!!",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-02-08 18:53:55",
                    "replies": [
                        {
                            "author": "thelastthrowwawa3929",
                            "body": "Can I message you privately?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-07-08 16:26:02",
                            "replies": []
                        },
                        {
                            "author": "Smash_4dams",
                            "body": "Can you update us on how that's going 6 months later?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-07-27 12:38:20",
                            "replies": []
                        },
                        {
                            "author": "MisterUkobach",
                            "body": "any update?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-07-31 18:55:12",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Psyduck46",
                    "body": "I applied about 2 months ago and haven't gotten anything. No project, no assessments, no response when I contact support. Smells more and more like a scam to me.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-02-11 02:30:42",
                    "replies": [
                        {
                            "author": "RefrigeratorShot7322",
                            "body": "A scam TAKES your money and disappears. You've been assessed (What results?). No subsequent work and no owed pay isn't evidence of illegitimacy.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-06-06 09:56:13",
                            "replies": [
                                {
                                    "author": "Psyduck46",
                                    "body": "No assessment, but they have my information (name, phone, email) that they can potentially sell.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-06-06 09:58:23",
                                    "replies": [
                                        {
                                            "author": "dderD_eidderF",
                                            "body": "i know im really late but i just wanted to say that you are really dumb lmao",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2024-08-10 01:19:35",
                                            "replies": []
                                        },
                                        {
                                            "author": "Asleep-Breadfruit831",
                                            "body": "It’s safe to assume that info is already out there somewhere LOL",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2024-07-28 14:03:13",
                                            "replies": []
                                        },
                                        {
                                            "author": "awkward_weebstan",
                                            "body": "You have social media, which also requires your name, email and phone number. How is that different from that site requiring you this information? 💀",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2025-02-12 01:40:03",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Smash_4dams",
                                    "body": "They're feeding the work you did in your \"evaluations\" into their algorithm anyway and just not paying you",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-07-27 12:39:32",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kianjz_",
                    "body": "I'm in NZ, been working for 6 months, made about $20k. It's definitely real.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-10-02 20:55:32",
                    "replies": [
                        {
                            "author": "fire_works10",
                            "body": "4 months later...are you still happy with the work?",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2025-02-15 17:06:38",
                            "replies": [
                                {
                                    "author": "kianjz_",
                                    "body": "Hey, yep I am! Only do around 10 hours a week now, but it's still a great source of secondary income for me. (Ends up being around 750 NZD a week). Approaching 50k total earnt.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-02-15 17:49:10",
                                    "replies": [
                                        {
                                            "author": "fire_works10",
                                            "body": "Wow, that's pretty good!  Thanks for the feedback.  Is there certain subject matter that you work with (like physics, etc.)?",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-02-15 17:54:50",
                                            "replies": [
                                                {
                                                    "author": "kianjz_",
                                                    "body": "I only ever do coding tasks really.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-02-15 19:03:48",
                                                    "replies": [
                                                        {
                                                            "author": "fire_works10",
                                                            "body": "Ah, okay.  It's not something I have experience in, so I doubt I'll have the same success.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-02-15 22:09:08",
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "jda318",
                                                            "body": "Can I ask how difficult the coding tasks are/what the assessment was like for that? Do they inquire about your language specialties?",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-02 07:10:26",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "QVRedit",
            "body": "Weird that they keep on advertising for people to work for them, yet they have people here who did work for them earlier who they don’t seem to want back.\n\nI was thinking about suggesting this to a friend - but now I am not so sure.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-02-10 17:19:04",
            "replies": [
                {
                    "author": "Ms_Jane_Lennon",
                    "body": "Every business lets people go if they don't like their work, and they still hire other people.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-02-11 00:22:24",
                    "replies": [
                        {
                            "author": "Desomite",
                            "body": "Usually a company will at least inform you that you've been let go. I'm currently doing Uber Eats delivery, and if they terminate you, you are at least notified. It's not directly comparable, but it's contract work, same as DA.\n\nData Annotation seems like a FWB. They're great for a time, but they'll eventually ghost you. Best not to get attached.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-02-12 21:35:57",
                            "replies": [
                                {
                                    "author": "RefrigeratorShot7322",
                                    "body": "Companies that hire gig workers, even \"day-players\" (I was a Hollywood grip), NEVER \"terminate\" anyone ...  Simply not \"re-hired\" for the next project, hour, or day ... Left hanging.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-06-06 10:00:53",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Certain-Ask-5380",
            "body": "Does anybody know how to retrieve the Starter Assessment and continue?",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-08-29 10:53:22",
            "replies": [
                {
                    "author": "Independent_Agent111",
                    "body": "Same problem!",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-09-02 17:58:07",
                    "replies": []
                }
            ]
        },
        {
            "author": "Extra_Landscape_5315",
            "body": "How do you know if you've past your first assessment?",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-09 18:22:10",
            "replies": []
        },
        {
            "author": "BoringSupermarket979",
            "body": "Can someone post the application link?",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-20 11:55:56",
            "replies": [
                {
                    "author": "mignetically",
                    "body": "just go to Indeed, there are several posts there. I was going to apply but in the terms it said something to the effect that they can take legal action without proof, that was triggering for me.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-01-09 10:10:00",
                    "replies": []
                }
            ]
        },
        {
            "author": "Responsible-Pay-9170",
            "body": "I just signed up on it, is it a scam??",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-27 10:41:47",
            "replies": [
                {
                    "author": "Vegetable_Echo2676",
                    "body": "Reading the comments, I can't say it's a scam or I can't that it isn't, just don't provide too much personal information about yourself and if they ask anything that involve money just says no. And do not revolve your fulltime job as this. DA seems to be a side hustle more than a full-time job. It just seems too robotics, like batteries, easily replaceable.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-02-09 04:14:42",
                    "replies": []
                },
                {
                    "author": "Candid-Guidance-6498",
                    "body": "i did it for like 10 months and it was pretty legit i wouldnt call it a scam.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-30 00:34:00",
                    "replies": []
                }
            ]
        }
    ]
}