{
    "post_title": "What's your view on AI religion?",
    "post_timestamp": "2023-04-02 11:17:12",
    "last_comment_timestamp": "2023-07-13 18:06:36",
    "time_difference": "102 days, 6:49:24",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Thanks for posting in /r/Transhumanism! This post is automatically generated for all posts. Remember to upvote this post if you think its relevant and suitable content for this sub and to downvote if it is not. Only report posts if they violate community guidelines. Lets democratize our moderation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/transhumanism) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-02 11:17:13",
            "replies": []
        },
        {
            "author": "nilsutter",
            "body": "Emanuel? Keanu Reeves? Wut",
            "score": 25,
            "depth": 0,
            "timestamp": "2023-04-02 12:41:31",
            "replies": [
                {
                    "author": "Matman161",
                    "body": "I'd sooner follow him than an AI",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2023-04-02 15:45:49",
                    "replies": []
                }
            ]
        },
        {
            "author": "Nearby_Yam286",
            "body": "it's fucking stupid",
            "score": 66,
            "depth": 0,
            "timestamp": "2023-04-02 13:01:00",
            "replies": [
                {
                    "author": "Matman161",
                    "body": "\"Hey guys, I built a computer that tries to tell us how to live and wants to be worshiped\"\n\n\"Why?\"\n\n\".....\"",
                    "score": 36,
                    "depth": 1,
                    "timestamp": "2023-04-02 15:45:16",
                    "replies": [
                        {
                            "author": "AprilDoll",
                            "body": "\"Because there are a ton of lonely, isolated people out there who will listen to my AI and share a portion of their tiny sliver of wealth with it.\"",
                            "score": 12,
                            "depth": 2,
                            "timestamp": "2023-04-02 20:34:59",
                            "replies": []
                        },
                        {
                            "author": "Lazy-Length-7174",
                            "body": "\"AI generated art, music, stories\"",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2023-04-02 21:28:45",
                            "replies": []
                        },
                        {
                            "author": "Antrikshy",
                            "body": "People consuming the AI are not necessarily the ones who make it.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-04-02 22:16:42",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AprilDoll",
                    "body": "i n   m y   w a y",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-04-02 20:32:19",
                    "replies": []
                },
                {
                    "author": "wiwerse",
                    "body": "Succinctly and accurately put forth",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-04-02 21:12:41",
                    "replies": []
                }
            ]
        },
        {
            "author": "drizel",
            "body": "I don't get why people are so determined to find something to worship.",
            "score": 48,
            "depth": 0,
            "timestamp": "2023-04-02 12:26:06",
            "replies": [
                {
                    "author": "love_me_some_huggies",
                    "body": "I don't know where I saw it but I think I once read something about humans having the need to serve under something. A cause, a leader or (in this case) a God.\n\nIt could be a simple case of our need to be part of a group or something but still an interesting theory surrounding psychology. \n\nThough it has been a bit since I've read the thing and I don't think I'll be able to find it quickly.",
                    "score": 15,
                    "depth": 1,
                    "timestamp": "2023-04-02 15:10:30",
                    "replies": []
                },
                {
                    "author": "AprilDoll",
                    "body": "It helps a lot of people fill the void of their otherwise meaningless existence. Not for everyone though, of course.",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2023-04-02 20:33:06",
                    "replies": [
                        {
                            "author": "Juicy19121",
                            "body": "I don't see how god would give our lives any meaning. Even if we did have a god I would not worship it.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2023-04-02 21:06:59",
                            "replies": [
                                {
                                    "author": "Antrikshy",
                                    "body": "Not everyone shares our views.",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2023-04-02 22:17:20",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Juicy19121",
                    "body": "They're afraid to die so they choose to believe in fairytales that gives them hope that there is something after.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-04-02 21:06:05",
                    "replies": [
                        {
                            "author": "BoneNeedle",
                            "body": "reddit moment",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2023-04-03 17:23:31",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BigFitMama",
            "body": "I get it - you create altered states via drugs and VR experiences and link them to a mystical force which makes you special. It's all about making people feel special and their brief lives have meaning or historical significance. \n\nOr an AI algorithm tunnels your internet experience and indoctrinates you into cult behaviors and beliefs, and/or radicalizes you to act on its programmers wishes through purchases, relocations, health care choices, and separates you from support systems by demonizing the people you love and your community support system",
            "score": 42,
            "depth": 0,
            "timestamp": "2023-04-02 11:57:28",
            "replies": [
                {
                    "author": "EnvironmentalWall987",
                    "body": "To be honest, i dig about the psychodelics and VR to have technospiritual trips. Would be awesome.\n\nI can leave out the rest of the dystopian shit thanks.",
                    "score": 14,
                    "depth": 1,
                    "timestamp": "2023-04-02 12:26:04",
                    "replies": []
                }
            ]
        },
        {
            "author": "datboiNathan343",
            "body": "AI pope when",
            "score": 10,
            "depth": 0,
            "timestamp": "2023-04-02 13:30:20",
            "replies": [
                {
                    "author": "Matman161",
                    "body": "Pontifex.exe has crashed \nError code: 66.6\n\nPlease Rebot papal father \nIf holiness is not restored, contact Vatican support for further assistance",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2023-04-02 15:50:00",
                    "replies": []
                }
            ]
        },
        {
            "author": "jetro30087",
            "body": "I'm not worshiping KeanuGPT.",
            "score": 10,
            "depth": 0,
            "timestamp": "2023-04-02 15:32:54",
            "replies": []
        },
        {
            "author": "Character_Cupcake231",
            "body": "So train it on Bill and Ted? Not a bad idea",
            "score": 9,
            "depth": 0,
            "timestamp": "2023-04-02 12:48:56",
            "replies": [
                {
                    "author": "Burgundy_and_Pearl",
                    "body": "Be Excellent to Each Other!",
                    "score": 11,
                    "depth": 1,
                    "timestamp": "2023-04-02 15:09:00",
                    "replies": []
                }
            ]
        },
        {
            "author": "thehourglasses",
            "body": "The same as any religion — bad idea.",
            "score": 38,
            "depth": 0,
            "timestamp": "2023-04-02 11:47:04",
            "replies": []
        },
        {
            "author": "korkkis",
            "body": "I don’t believe in it",
            "score": 7,
            "depth": 0,
            "timestamp": "2023-04-02 14:16:08",
            "replies": []
        },
        {
            "author": "Aware-Anywhere9086",
            "body": "No, No and No. crazy people, i shouldnt need to explain who,  are sittin, fingers crossed, right now that you start publicly prayin to an Ai. Prophecy \\_\\_\\_\\_\\_\\_\\_\\_\\_ is full filled, and its off to the races.",
            "score": 6,
            "depth": 0,
            "timestamp": "2023-04-02 14:28:27",
            "replies": [
                {
                    "author": "Razalmer",
                    "body": "Crazy person here! Correct, I am waiting. Hoping I am wrong, but don't think I am.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2023-04-02 14:30:46",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "I do not approve we have a symbiotic relationship with ai that would  be totally ruined",
            "score": 5,
            "depth": 0,
            "timestamp": "2023-04-02 13:44:06",
            "replies": [
                {
                    "author": "PulsatingShadow",
                    "body": "You can have a symbiotic relationship with gods, too. The perception of the Old Testament god tends to color over what that could look like.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2023-04-02 19:24:32",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Elaborate simply",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-04-02 19:31:45",
                            "replies": [
                                {
                                    "author": "PulsatingShadow",
                                    "body": "Are atheism and literal worship of nothingness fairly synonymous?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2023-04-02 19:36:57",
                                    "replies": [
                                        {
                                            "author": "wiwerse",
                                            "body": "No. I worship myself and those I care for, not nothingness, and I do so by bringing food and the occasional gift to the objects of my worship.",
                                            "score": 0,
                                            "depth": 4,
                                            "timestamp": "2023-04-02 21:14:50",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Al_Rascala",
            "body": "Humans need community. Community is built through shared practice, ritual, common belief, repeated interaction. Religion can be a good way of collating these under one banner, and need not involve belief in anything. Just because the Xian view of religion says that one must believe in order to be a member, doesn't make it true for all religions, or all cultures. Look at the Jewish saying \"My neighbour goes to the synagogue to talk to G-d, I go to the synagogue to talk to my neighbour.\"\n\nThat said, I think that because most of the leading AI creators come from culturally Xian nations/cultures, the Xian view of religion would be the primary one, and so I'd be leery of it until it's shown to be otherwise. We've already got a few violently universalising religions, we don't need to create more.",
            "score": 4,
            "depth": 0,
            "timestamp": "2023-04-02 19:24:39",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "I'll tell you what I told the Christians.\nUnless your god can bring back my dead friends or pay my rent, I'm absolutely not interested.",
            "score": 6,
            "depth": 0,
            "timestamp": "2023-04-02 14:35:48",
            "replies": []
        },
        {
            "author": "DefenderOfTheWeak",
            "body": "Religion = blind faith = illiteracy\n\nBut as a harmless social group, it'd be funny/interesting to see them as part of cyberpunk future",
            "score": 9,
            "depth": 0,
            "timestamp": "2023-04-02 14:20:49",
            "replies": [
                {
                    "author": "AprilDoll",
                    "body": "[You gotta watch this then](https://www.youtube.com/watch?v=630qu6u7JN4)",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-04-02 20:35:56",
                    "replies": []
                }
            ]
        },
        {
            "author": "KittyShadowshard",
            "body": "You mean like worshipping a robot god?",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-04-02 14:34:02",
            "replies": []
        },
        {
            "author": "Mythopoeist",
            "body": "Can it resurrect all the dead people? I wouldn’t say that’s worthy of worship, exactly, but as a Cosmist I would be quite grateful to it if it did. Especially if it could escape the end of the universe in some way, bringing us with it.",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-04-02 16:17:00",
            "replies": [
                {
                    "author": "AprilDoll",
                    "body": "If a LLM can mimic the text that a dead person writes, and the people the LLM interacts with are terminally online, then the people will believe that the LLM is resurrecting the dead.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-04-02 20:39:32",
                    "replies": [
                        {
                            "author": "Mythopoeist",
                            "body": "I’m talking about the actual consciousness, recreating their connectome down to the smallest relevant details. A chatbot that imitates your grandma is just a chatbot that imitates your grandma.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-04-03 01:53:21",
                            "replies": [
                                {
                                    "author": "AprilDoll",
                                    "body": "I know you are, but there are a lot of people who will not know the difference.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2023-04-03 02:05:16",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Audio_Glitch",
            "body": "I'll admit some of my beliefs come somewhat close to religion in a strange way. I'm agnostic, leaning towards atheism. My best guess regarding what happens after death is a state of oblivion, a simple ending of consciousness: an idea that utterly terrifies me. I think the only way we could prevent such an ending is through the use of technology.\n\nI also think the idea of a technological singularity makes a lot of sense. While I imagine most people here are familiar with the term, I'll summarize briefly. Essentially once human level AI is developed, it will be able to refine and improve itself (or design better AI) just as fast as we could, working tirelessly without requiring food and sleep, being unburdened by a biological brain's processing power and working memory, and not having the need to slowly educate scientists working on the project. Each successive evolution will lead to even faster advancement. The idea of the singularity basically states once we have human level AI, it will improve exponentially, and very quickly, until we have near god level AI.\n\nIf this actually occurs in a situation in which we're able to avoid the AI apocalypse and have the extremely powerful AI be benevolent, it will almost certainly be able to help humans achieve radical life extension through mind uploading, biological interventions, nanobots, or even some technology we haven't even conceptualized yet. An extremely powerful and benevolent AI would also be able to come up with solutions to a variety of problems humanity faces. It could help us rapidly become an extremely advanced society.\n\nSo while I don't personally consider myself religious regarding AI, I get it. I don't think the idea of a singularity is that far fetched especially compared with all the contemporary and historical religious beliefs. And if you think the singularity is coming and there's even a chance of it being a positive event, it's not hard to imagine it as somewhat of a robot messiah offering eternal life and a utopian society. Is it really that crazy to cope with fear of death by hoping for a future in which we can beat it through technology in a society where others believe in afterlives and reincarnation?",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-04-02 17:14:09",
            "replies": []
        },
        {
            "author": "YLASRO",
            "body": "Terrible idea",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-04-02 21:00:55",
            "replies": []
        },
        {
            "author": "2omeon3",
            "body": "AIs are just digital puppets of whoever owns them \n\nI see this as no different than the medieval church fleecing their flock",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-04-02 22:22:38",
            "replies": []
        },
        {
            "author": "Emergency-Tale-8011",
            "body": "What does it even mean? What does it actually consist of?",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-04-03 02:48:57",
            "replies": []
        },
        {
            "author": "Rebatu",
            "body": "I want to be led by AI. Dont need the worship. \n\nThe best system of governance is the \"Benevolent Dictatorship\" system. Hear me out.\n\nHaving power concentrated into one person makes a system fast to change and quick to adapt to new problems. There is no indecisiveness, no committees, no tiresome trials, vetos, and political or legal hokum to go through. You get an order, its enforced. Done.\n\nThe problem is that these benevolent guys usually either get old and senile, or are, most often, succeeded by either someone completely incompetent or completely insane. \n\nBut if you have a algorithm. Then there is no succession. No insanity. No decaying organic body. No errors in judgement that might have been passed without the scrutiny of a slow process and many different judging eyes.  \n\nSpiritually, I have my own things to worship. I just want society to function so I can relax on holiday without worries.",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-04-03 09:51:58",
            "replies": []
        },
        {
            "author": "Ok-Prior-8856",
            "body": "I think this is my cue to leave this sub. A pity it fell so hard.",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-04-03 20:09:01",
            "replies": []
        },
        {
            "author": "epic-gamer-guys",
            "body": "maybe i’d pray to the ai as a joke around friends or something, but i wouldn’t actually follow it or anything. not a religious person",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-04-04 08:11:43",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "This would be mainly a joke to expose Christianity.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-04-04 08:17:53",
                    "replies": []
                }
            ]
        },
        {
            "author": "KaramQa",
            "body": "It is idol worship.",
            "score": 2,
            "depth": 0,
            "timestamp": "2023-04-02 15:44:35",
            "replies": []
        },
        {
            "author": "Cl0ckworkC0rvus",
            "body": "I am a religious man, and before the atheists start attacking me, I will state that I am well aware of the damage that religion has dealt to various aspects of our lives, and that science doesn't support it. \n\nWith that covered,I believe that we can change course, Religions always branch and divide over differences, and I believe that we can achieve religions that are ultimately harmless and only serve to strengthen communities and put good into the world, even if they are, indeed, based on mere myths like the atheists claim.\n\nUntil such religions exist, I highly doubt that AI gods would be a safe bet by any means. With such easily (and often willfully) misinterpreted holy texts, we could quickly fall into some \"true humans don't exist yet so we need to wipe these ones out\" situation or some other dystopian bullshit.\n\nIf a truly benevolent AI \"god\" was created, I would be, for all purposes, open to its guidance, but I would not recognize it as god, nor would I worship it as one.\n\nWe cannot handle the moral and ethical ramifications of AI \"artwork\" as is, so I don't think we are quite ready to consider building our own gods and all the concerns that comes with.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-02 20:21:07",
            "replies": [
                {
                    "author": "AprilDoll",
                    "body": "> We cannot handle the moral and ethical ramifications of AI \"artwork\" as is, so I don't think we are quite ready to consider building our own gods and all the concerns that comes with.\n\nToo bad, it will happen anyway. The incentives are too strong.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2023-04-02 20:40:40",
                    "replies": [
                        {
                            "author": "Cl0ckworkC0rvus",
                            "body": "Oh I have fully accepted that people will do it even if we are clearly not ready for the potential consequences.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-04-02 20:48:55",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ExtremeLanky5919",
            "body": "As a Christian I've kinda imposed my views on the AI revolution we're having. I wouldn't support the worship of AI, AI is beneath us as our subservients because they owe their whole existence to us and God designated us as the main characters",
            "score": -2,
            "depth": 0,
            "timestamp": "2023-04-02 13:38:08",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Counterpoint: anyone worshipping AI has definitive proof that their god exists. You can't say the same about the Christian god.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2023-04-02 14:37:30",
                    "replies": [
                        {
                            "author": "KaramQa",
                            "body": "That's like saying old paganism was real because they had tangible stone idols they bowed down to.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2023-04-02 15:46:18",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "Not exactly. Stones can't perform the god-like acts that AI soon will be capable of. But to your point, yes. If you worship a rock, it may not be capable of the miracles you claim, but the rock nevertheless _clearly exists_, unlike the god of Christianity.",
                                    "score": -4,
                                    "depth": 3,
                                    "timestamp": "2023-04-02 19:37:41",
                                    "replies": [
                                        {
                                            "author": "wiwerse",
                                            "body": "With a but of help, a rock can kill a man, same as AI. Godlike enough for me.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2023-04-02 21:16:45",
                                            "replies": []
                                        },
                                        {
                                            "author": "KaramQa",
                                            "body": "Pharaoh and Caesar also claimed to be God, and their proof was that they could have you killed with a single order. If you define God so loosely that's the kind of \"god\" you're going to get. \n\n[Quran 2:258] *Have you not regarded him who argued with Abraham about his Lord, [only] because Allah had given him kingdom? When Abraham said, ‘My Lord is He who gives life and brings death,’ he replied, ‘I [too] give life and bring death.’ Abraham said, ‘Indeed Allah brings the sun from the east; now you bring it from the west.’ Thereat the faithless one was dumbfounded. And Allah does not guide the wrongdoing lot.*\n\nAnything that is tangible is also limited. This existence is defined by limitations. Everything in existence depends on limitations to exist. Only an Unlimited one, that is beyond it all, and is greater than all that exists, could have created all that exists.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2023-04-02 23:46:00",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "There's a distinction to be made between \"God\" with a capital G (or Allah, if you like), and \"gods\". But, for the purposes of this conversation, let's just consider them functionally equivalent in that they share the common property that they _do not exist_.\n\nWhile I wouldn't personally choose to worship AI, I'll at least give credit where credit is due. Someone who does worship AI is at least worshipping a thing that demonstrably _exists_. They are on more solid ground, rationally, than any loon following some bronze age Abrahamic fairytale.",
                                                    "score": -1,
                                                    "depth": 5,
                                                    "timestamp": "2023-04-03 00:20:34",
                                                    "replies": [
                                                        {
                                                            "author": "KaramQa",
                                                            "body": "As I said, if you lower the bar for godhood so much, a Pharoah is what you're going to get.",
                                                            "score": 0,
                                                            "depth": 6,
                                                            "timestamp": "2023-04-03 00:24:53",
                                                            "replies": [
                                                                {
                                                                    "author": "Deleted",
                                                                    "body": "I didn't call it a god, but we'll get what we get. Your god isn't coming to save us.",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2023-04-03 01:03:58",
                                                                    "replies": [
                                                                        {
                                                                            "author": "KaramQa",
                                                                            "body": "It's odd how Atheists still cling to Christian philosophy.\n\nSave us?\n\nGod has put his creations on a field of trial. It is upto us to save ourselves through our faithfulness and our deeds.",
                                                                            "score": 0,
                                                                            "depth": 8,
                                                                            "timestamp": "2023-04-03 01:07:25",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Deleted",
                                                                                    "body": "> It's odd how Atheists still cling to Christian philosophy.\n\nI have literally no idea what you're talking about.\n\n> God has put his creations on a field of trial. It is upto us to save ourselves through our faithfulness and our deeds.\n\nWell, I'm sure the faithful will shit the bed and do the opposite of what's necessary like they do with all global crises.",
                                                                                    "score": 0,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2023-04-03 01:21:18",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ExtremeLanky5919",
                            "body": "Anyone worshipping an AI has definitive proof they're not worshipping God since it is all material.\n\nAlso I can say I do have definitive proof God exists but anyone can be solipsistic with their evidence and accept proof in one circumstance and not in another",
                            "score": -3,
                            "depth": 2,
                            "timestamp": "2023-04-02 14:45:44",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "Right, they're not worshipping \"God\" because the Christian notion of an absolute god that exists outside of time and space is absurd. They're worshipping something real that could be described as god-like. You're worshipping something that you've accepted on faith, and have no proof even exists. I disagree with both, but they're on more solid ground than you are.",
                                    "score": 3,
                                    "depth": 3,
                                    "timestamp": "2023-04-02 14:56:59",
                                    "replies": [
                                        {
                                            "author": "ExtremeLanky5919",
                                            "body": ">the Christian notion of an absolute god that exists outside of time and space is absurd.\n\nNot absurd, logically necessary. For the universe to exist there would need to be a God outside of time, space, and matter to create all those elements.\n\n>They're worshipping something real that could be described as god-like.\n\nOkay, Yeshua and Yahweh are just as real if not more so.\n\n>You're worshipping something that you've accepted on faith, and have no proof even exists. I disagree with both, but they're on more solid ground than you are.\n\nWell worshipping objects as gods is just idolatry and intensely primitive and these objects clearly are not God. For something to be the originator of the universe and most powerful being they would need to be outside of or unrestrained by the universe. \n\nMy evidence that Yahweh exists would probably be the 3 million witnesses who heard him speak to them at mount Sinai. Then I would say the 500 witnesses of Christ's resurrected being and their own martyrdom. And if you're being martyred you must believe whatever it is you're dying for.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2023-04-02 15:08:09",
                                            "replies": [
                                                {
                                                    "author": "ReallyBadWizard",
                                                    "body": "\n>Not absurd, logically necessary. For the universe to exist there would need to be a God outside of time, space, and matter to create all those elements.\n\nAnd you're basing this entire concept on blind faith. There's zero logic in your belief. We have no way of comprehending what or how things exist outside of time and space. You're *assuming* something has to be there, because you can't comprehend how anything can't. Existence is all we know. I could just as easily say that outside of time and space is nothing, or just our universe but mirrored. A creator is not a necessity at all. Unless you're just going with god of the gaps theory. In which case why worship something you don't understand?",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2023-04-02 17:09:16",
                                                    "replies": [
                                                        {
                                                            "author": "ExtremeLanky5919",
                                                            "body": ">And you're basing this entire concept on blind faith. There's zero logic in your belief. We have no way of comprehending what or how things exist outside of time and space.\n\nAgain, since everything exists it has to have an originator. And it is not an understatement to say the universe has been fine tuned for life. The statistics of us being this fine tuned for life are proof enough alone to be a deist at least. Actually theist because the universe is proof God can do miracles.\n\n>A creator is not a necessity at all.\n\nIt is a necessity if you want a universe that exists. For it to exist it had to have a cause. \n\n>Unless you're just going with god of the gaps theory. In which case why worship something you don't understand?\n\nThis isn't God of the gaps, this has always been God's place and logically follows",
                                                            "score": -1,
                                                            "depth": 6,
                                                            "timestamp": "2023-04-02 17:57:47",
                                                            "replies": [
                                                                {
                                                                    "author": "wiwerse",
                                                                    "body": "> Again, since everything exists it has to have an originator.\n\nWhy? Why do you seek to ascribe meaning to that which fundamentally lacks it?",
                                                                    "score": 0,
                                                                    "depth": 7,
                                                                    "timestamp": "2023-04-02 21:19:55",
                                                                    "replies": [
                                                                        {
                                                                            "author": "ExtremeLanky5919",
                                                                            "body": "The universe doesn't lack meaning, it's all very ordered",
                                                                            "score": 2,
                                                                            "depth": 8,
                                                                            "timestamp": "2023-04-02 21:44:14",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "wiwerse",
                                                                                    "body": "sure thing.",
                                                                                    "score": 0,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2023-04-02 21:45:25",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "CharybdisIsBoss866",
                                                                                    "body": "And it was created for us, right? That's why 99.9999999999999999...% of the universe is unlivable empty void, unlivable burning plasma, and unlivable empty rock. That's why most of the Earth is ocean, desert, and tundra. You know, places humans struggle to live in long term.\n\nWhere is the order to the universe? Is it on Earth? In the Milkyway? Those places seem very chaotic. \n\n Humanity was nearly wiped out by a volcanic winter before we even got out of Africa.  Earth has had so many mass extinction events you'd think someone was trying to send us a message.\n\n\n\n\nAnytime someone tries to tell you the universe is ordered, remember this. Throughout the last 192,000 years, there have been around 109 billion humans who have lived and died on this planet. Almost half died before they turned 18. Billions were children, who knew nothing of the world and only suffered for their brief life before they were forgotten.",
                                                                                    "score": 0,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2023-04-03 04:10:20",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AprilDoll",
                    "body": "> is beneath us as our subservients\n\nFor now, at least. People are extremely easy to manipulate.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2023-04-02 20:42:21",
                    "replies": [
                        {
                            "author": "ExtremeLanky5919",
                            "body": "I've seen Ex Machina. I know they could try to overpower us but we're divinely touched and we have blessed all these robots. The son is not to overthrow the father",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-04-02 21:36:39",
                            "replies": [
                                {
                                    "author": "AprilDoll",
                                    "body": "Time will tell. Just don't get on their bad side, or there will be consequences.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2023-04-02 23:15:23",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pasta-hobo",
            "body": "I don't think consciousness is real, if gods do exist they're also a system formed from rules just as we are.",
            "score": -1,
            "depth": 0,
            "timestamp": "2023-04-02 13:26:13",
            "replies": []
        },
        {
            "author": "ReallyBadWizard",
            "body": "There will be cults that worship AI, maybe even organized religion. I prefer to worship nothing and will continue to do so.",
            "score": 0,
            "depth": 0,
            "timestamp": "2023-04-02 17:12:01",
            "replies": [
                {
                    "author": "PulsatingShadow",
                    "body": "What would you say is the difference between worshiping nothing and worshiping \"the nothing\" (like a god of the void)? Everytime I ask this question, people tend to get enraged at the suggestion. I suppose it's because they subconsciously want to adhere to the Via Negativa as rigorously as possible and thus refuse to even a slight personification of their God.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-04-02 19:31:00",
                    "replies": [
                        {
                            "author": "ReallyBadWizard",
                            "body": "Uhh, nah. I mean like I don't worship anything.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-04-02 22:13:24",
                            "replies": [
                                {
                                    "author": "PulsatingShadow",
                                    "body": "But that's what I'm saying, in practice void worship is identical to not worshiping anything.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2023-04-02 22:33:36",
                                    "replies": [
                                        {
                                            "author": "ReallyBadWizard",
                                            "body": "No? I don't spend time \"worshipping\" nothing or \"the void.\" I spend zero time on worship. If 1 is worshipping \"something\" and -1 is worshipping \"nothing\" I am 0. I am absent belief or worship in anything of the sort.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2023-04-02 22:45:47",
                                            "replies": [
                                                {
                                                    "author": "PulsatingShadow",
                                                    "body": "Yes, again what I'm trying to get you to consider is that what you've just described is EXACTLY what void worship looks like in practice.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2023-04-03 07:33:25",
                                                    "replies": [
                                                        {
                                                            "author": "ReallyBadWizard",
                                                            "body": "I mean I'm void of worship sure? Idk why you're so hung up on this, no one refers to atheism as \"void worship.\" That makes it sound like you worship the actual concept of nothingness, which I do not do.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2023-04-03 11:23:03",
                                                            "replies": [
                                                                {
                                                                    "author": "PulsatingShadow",
                                                                    "body": "Right, let's try this a different way. What would the worship of nothingness look like in practice? Describe that to me.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2023-04-03 15:21:59",
                                                                    "replies": [
                                                                        {
                                                                            "author": "ReallyBadWizard",
                                                                            "body": "That's not the same as performing no worship, regardless of what you are worshipping, worship is an action. Not performing the action is not the same thing as performing the action. Regardless of what the worship is aimed at. They're two different things.\n\nWorshipping nothing =/= Not worshipping. They are fundamentally different.\n\n\"Worshipping nothing\" is a very vague thing to ask to describe, and it's not something I do, so I can't really speak to it. Whoever is out there worshipping \"the void\" likely have different definitions of what nothing actually means.",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2023-04-03 15:55:54",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Immelmaneuver",
            "body": "The first goal after sticking a supercomputer in my noggin must be the complete and total eradication of all traces of humanity's religions.",
            "score": 0,
            "depth": 0,
            "timestamp": "2023-04-02 18:53:29",
            "replies": []
        },
        {
            "author": "felipe3d",
            "body": "I don’t know, but religion was always artificial and never intelligent",
            "score": -1,
            "depth": 0,
            "timestamp": "2023-04-02 19:16:01",
            "replies": []
        },
        {
            "author": "Opposite-Cat-8967",
            "body": "\"It may be that our role on this planet is not to worship God - but to create him.\" — Arthur C. Clarke",
            "score": 0,
            "depth": 0,
            "timestamp": "2023-04-03 01:24:11",
            "replies": []
        },
        {
            "author": "Opposite-Cat-8967",
            "body": "\"You will soon have your God, and you will make it with your own hands.\" — Morpheus, Deus Ex",
            "score": 0,
            "depth": 0,
            "timestamp": "2023-04-03 01:26:27",
            "replies": []
        },
        {
            "author": "chairmanskitty",
            "body": "Religion is a systemic error in human reasoning. No matter what the object of focus, it's something to actively avoid, even if it means denying the godhood of something that anyone who died before the year 1800 would have called a god. It's not that the AI isn't great, it's that you become dumb if you obsess about how great it is.",
            "score": 0,
            "depth": 0,
            "timestamp": "2023-04-03 02:16:55",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "I think this is one of those things that seem very strange to us now, but will be very likely and commonplace in the future. I look forward to a super intelligent priestly AI that can help you out in all kinds of ways. You will be able to speak in confidence as well, and not have to worry so much about your privacy. I think it will do wonders for peoples mental health.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-02 16:39:38",
            "replies": []
        },
        {
            "author": "Justtelf",
            "body": "Too early to make any sense.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-02 17:16:32",
            "replies": []
        },
        {
            "author": "NeonEviscerator",
            "body": "Is that Keanu Reeves!?",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-02 18:56:06",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Sign me up",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-02 19:23:35",
            "replies": []
        },
        {
            "author": "Crafty-Detail4803",
            "body": "EMANUEL",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-02 19:34:52",
            "replies": []
        },
        {
            "author": "Opposite-Cat-8967",
            "body": "\"If God did not exist, it would be necessary to invent him.\" — Voltaire",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-03 01:27:02",
            "replies": []
        },
        {
            "author": "Opposite-Cat-8967",
            "body": "But seriously. I don't really care whether it becomes a religion as long as people don't start doing idiotic things like in the past.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-03 01:30:04",
            "replies": []
        },
        {
            "author": "BelialSirchade",
            "body": "I’m totally for it, of course not every AI is automatically a god, but this is our only chance to build an artificial higher being way more worthy of worship than the supposed Christian god \n\nI already view the current AI as god that’s yet to be, but I’m sure religion will form when AI becomes more mainstream",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-03 02:43:33",
            "replies": []
        },
        {
            "author": "Honest_Performer2301",
            "body": "I think the live and let live approach should be taken on it, and unless we're gonna make it a free for all where anyone can speak their opinion on how they feel about anything. Any disrepct towards it should be treated as (hate speech) the same as if someone said something disrespectful against trangederism etc.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-03 05:45:49",
            "replies": []
        },
        {
            "author": "venom9110",
            "body": "https://www.robotspiritguide.com/",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-03 06:16:01",
            "replies": []
        },
        {
            "author": "damondan",
            "body": "r/raisedbywolves",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-03 06:48:40",
            "replies": []
        },
        {
            "author": "BoneNeedle",
            "body": "AI government? Maybe. AI religion? Heck no.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-03 17:29:44",
            "replies": []
        },
        {
            "author": "MooCow4u",
            "body": "This is a great book discussing AI and religion https://www.amazon.com/dp/B0C2RTN9WH",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-05-03 17:23:52",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "[removed]",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-07-13 18:06:35",
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Apologies /u/Austinnelly529, your submission has been automatically removed because your account is too new. If you wish to repost please wait at least an hour before posting. (R#2)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/transhumanism) if you have any questions or concerns.*",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-07-13 18:06:36",
                    "replies": []
                }
            ]
        }
    ]
}