{
    "post_title": "meta has resumed research on real time facial ID in their AI glasses",
    "post_timestamp": "2025-05-08 04:29:13",
    "last_comment_timestamp": "2025-05-09 12:31:53",
    "time_difference": "1 day, 8:02:40",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hello u/auntiemuskrat, please make sure you read the sub rules if you haven't already. (This is an automatic reminder left on all new posts.) \n\n---\n[Check out the r/privacy FAQ](https://www.reddit.com/r/privacy/wiki/index/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/privacy) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-08 04:29:14",
            "replies": []
        },
        {
            "author": "LordFionen",
            "body": "Well we're already living in a panopticon. The police department in my area is trying to get people who have private cameras on their building and homes to sign up to allow cops to use them or their data to \"solve crimes.\" .They also bought portable cameras for events that are capable of facial recognition. We're already in this 24/7 surveillance reality unfortunately. ",
            "score": 163,
            "depth": 0,
            "timestamp": "2025-05-08 05:43:59",
            "replies": [
                {
                    "author": "Jazzspasm",
                    "body": "[UK has facial recognition vans which park up in town centers, sporting events and of course, at protests](https://www.bbc.com/news/articles/c1mn5r8ng3eo) - this is now common practice and is justified by examples of people being arrested.\n\n[Another example of mass arrests in the UK from one van being parked in town centers](https://www.bbc.com/news/uk-england-london-68638348)\n\n-\n\n[A man who covered his face when he saw one of these vans was arrested, charged with ‘Disorderly Behaviour’ and fined £90 - for the crime of covering his face in public!](https://www.standard.co.uk/news/london/moment-police-fine-pedestrian-after-he-covered-face-from-facial-recognition-camera-a4144156.html#:~:text=Footage%20has%20shown%20the%20moment,not%20to%20cover%20me%20face.)\n\n-\n\n[As anyone with half a brain would know already, facial recognition technology is a complete mess when it comes to black people - leading to false identification, arrests and imprisonment](https://www.silicon.co.uk/e-innovation/artificial-intelligence/facial-recognition-lawsuit-man-falsely-jailed-531093/amp)",
                    "score": 50,
                    "depth": 1,
                    "timestamp": "2025-05-08 06:11:22",
                    "replies": [
                        {
                            "author": "LordFionen",
                            "body": "Yes, I'm in the US and when the city here was holding hearings on buying this type of equipment we pointed out this could be an unconstitutional search. The cops said don't worry we will not use the facial recognition capability of the software, we'll just use the cameras for \"monitoring the event\" as it's happening. Yeah. Sure you will.",
                            "score": 37,
                            "depth": 2,
                            "timestamp": "2025-05-08 06:22:39",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Liquor_N_Whorez",
                    "body": "License plate readers and tracking vehicles in every town.",
                    "score": 20,
                    "depth": 1,
                    "timestamp": "2025-05-08 06:24:58",
                    "replies": [
                        {
                            "author": "LordFionen",
                            "body": "Yeah we just got those in my city and I wouldn't be surprised if they too have facial recognition tech. So not only are they monitoring every time I pass thru these intersections in my car, they are also monitoring every time I go by on foot or on my bicycle. They also put up cameras on a section of a public recreation trail. They justified that by saying that homeless people were causing too much trouble there and they had to monitor them. Then they came through and made all the homeless people leave and threw away all their tents and stuff yet the cameras are still there.",
                            "score": 14,
                            "depth": 2,
                            "timestamp": "2025-05-08 06:36:07",
                            "replies": [
                                {
                                    "author": "Liquor_N_Whorez",
                                    "body": "Somethin somethin sacrifice liberty and security somethin somethin deserve neither from the $100 bill guy.",
                                    "score": 6,
                                    "depth": 3,
                                    "timestamp": "2025-05-08 11:18:30",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TopExtreme7841",
                            "body": "They've been doing that LONG before Flock cameras were everywhere.",
                            "score": 8,
                            "depth": 2,
                            "timestamp": "2025-05-08 06:38:57",
                            "replies": [
                                {
                                    "author": "Liquor_N_Whorez",
                                    "body": "Well now the cams are on every main road into and out of the small towns here in Illinois, and now each county and town gets to store movements. A town down the way from me keeps \"suspected criminals with criminal records\" on file for 30days min to share with other leo's. The Chief hasnt defined what that criteria is for them to label someones vehicle suspicous. \n\n\nIt wasnt constitutional before the flocks and it sure af isnt constitutional now.",
                                    "score": 8,
                                    "depth": 3,
                                    "timestamp": "2025-05-08 07:20:50",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pwishall",
                    "body": "This is weird - either these cops didn't read 1984 or they just don't care? Someone like our Dear Leader Trump would absolutely use that kind of thing to control citizens.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-05-08 12:06:14",
                    "replies": []
                }
            ]
        },
        {
            "author": "Commercial_Ad_9171",
            "body": "This is the real crisis of today’s society. Now that companies know how to collect data, and they know how to profit from it, it’ll just be one after another trying to cash in on the gold mine that is human existence in increasingly damaging ways. I personally think protection of the data generated by a person’s existence should be enshrined as a human right. ",
            "score": 67,
            "depth": 0,
            "timestamp": "2025-05-08 07:00:26",
            "replies": [
                {
                    "author": "SkittishLittleToastr",
                    "body": "This is exactly what legislators are supposed to guard against. If only ours weren't broken.",
                    "score": 22,
                    "depth": 1,
                    "timestamp": "2025-05-08 11:43:44",
                    "replies": [
                        {
                            "author": "MattDemers",
                            "body": "I feel like for most of my life I've been waiting for legislators to magically age out, so people more savvy with technology can actually advocate for us and help us develop better guidelines for living with these things. Even going back to \"[a series of tubes!](https://en.wikipedia.org/wiki/Series_of_tubes)\" it was this humorous shoulder-shrugging moment, thinking \"Well, we've got all these tech-illiterate people, but one day, we won't.\"\n\nI've long-since become jaded to this, both from seemingly-immortal elder politicians, and the likelihood that lobbying means that anyone coming in will be compromised, anyways.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2025-05-08 13:30:19",
                            "replies": []
                        },
                        {
                            "author": "Commercial_Ad_9171",
                            "body": "The EU seems to be the only place taking an effective legislative stance against digital feudalism, and even that’s not enough. I’m still in shock how generative AI companies have just completely circumvented copyright law. It’s crazy. ",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2025-05-08 12:01:45",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "auntiemuskrat",
                    "body": "i fully agree with you, but i don't think that our legislators or courts believe that that the right to privacy will ever be without constraints. i read a [paper by daniel solove](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4024790), a professor at george washington university law school, that lays out the limitations of the right to privacy. he believes that (american) privacy rights don't allow people enough control over their data, nor do they actually have control of it when that right supposedly exists. privacy needs to be reframed to be expanded and guaranteed.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-05-08 15:30:51",
                    "replies": []
                }
            ]
        },
        {
            "author": "APIeverything",
            "body": "Could that man look like a bigger tool",
            "score": 22,
            "depth": 0,
            "timestamp": "2025-05-08 05:37:53",
            "replies": [
                {
                    "author": "Liquor_N_Whorez",
                    "body": "Sure, when he and musky boy with all our freshly stolen data meets Zuckerbergs FB & FBIandbeyond data collected since 2008 when the illegal experiments were being conducted, and fb stealing non user contacts and.data too. Ffs, yeah they ugly, horrible, nasty people. \n\n\nThey know all about us but thats all most people know about the reality of what is happening. ",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2025-05-08 06:23:12",
                    "replies": []
                }
            ]
        },
        {
            "author": "VerdantField",
            "body": "This is a horrible technology.  People will wear it in hospitals and other vulnerable places.",
            "score": 29,
            "depth": 0,
            "timestamp": "2025-05-08 07:49:15",
            "replies": [
                {
                    "author": "DelightfulDolphin",
                    "body": "Don't be so sure. Remember when google iirc rolled out those glasses that would tell you things in real time? Remember how many of them had said glasses torn off? How many were attacked? Harassed? I'm thinking we will see more of same.",
                    "score": 10,
                    "depth": 1,
                    "timestamp": "2025-05-08 10:29:28",
                    "replies": [
                        {
                            "author": "Nurofae",
                            "body": "They are less obvious nowadays and they only keep getting smaller",
                            "score": 9,
                            "depth": 2,
                            "timestamp": "2025-05-08 14:31:45",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SithLordRising",
            "body": "Very soon we won't be able to go anywhere without 24/7 surveillance.",
            "score": 36,
            "depth": 0,
            "timestamp": "2025-05-08 04:39:13",
            "replies": [
                {
                    "author": "Liquor_N_Whorez",
                    "body": "License plate readers, instant alerting police of infractions so the driver can be harassed and detained. Ring doorbells linked to police with permission, social media monitoring, self check outs with retina monitors, and phones. \n\n\nPretty soon was 30yrs back.",
                    "score": 25,
                    "depth": 1,
                    "timestamp": "2025-05-08 06:28:50",
                    "replies": []
                }
            ]
        },
        {
            "author": "SkittishLittleToastr",
            "body": "God I hate this timeline.",
            "score": 12,
            "depth": 0,
            "timestamp": "2025-05-08 11:42:44",
            "replies": []
        },
        {
            "author": "Jazzspasm",
            "body": "The ads appearing on reddit let me know something dangerous was on the way\n\n“*Meta, tell me that girl’s name and where she works”*",
            "score": 24,
            "depth": 0,
            "timestamp": "2025-05-08 06:02:30",
            "replies": []
        },
        {
            "author": "qp0n",
            "body": "You know that really disturbing black mirror episode? What if we made that our reality!",
            "score": 9,
            "depth": 0,
            "timestamp": "2025-05-08 09:11:54",
            "replies": []
        },
        {
            "author": "rockem_sockem_puppet",
            "body": "Using the account that I use for messenger and marketplace, I'm now just uploading pics from ThisPersonDoesNotExist and tagging myself in them.",
            "score": 7,
            "depth": 0,
            "timestamp": "2025-05-08 10:54:49",
            "replies": []
        },
        {
            "author": "TopExtreme7841",
            "body": "Nobody that cares about privacy would ever put a meta run camera on themselves.",
            "score": 13,
            "depth": 0,
            "timestamp": "2025-05-08 06:38:05",
            "replies": [
                {
                    "author": "foobarhouse",
                    "body": "What about everybody else who wants to walk around without having their privacy evaded and collected? How can we be absolved of the absence of our consent?\n\nThis is not good for anybody, and it shouldn’t ever be allowed to pass and be sold to consumers. Police would arguably have a case for it, but definitely not consumers.",
                    "score": 34,
                    "depth": 1,
                    "timestamp": "2025-05-08 06:45:03",
                    "replies": [
                        {
                            "author": "TopExtreme7841",
                            "body": "There's no privacy in public, that's just reality. Police actually do have a case for it, doesn't mean it can't be abused, because we all know it can, and has been, that's why it's a hard line to walk.\n\nEverybody everywhere is and will continue to use technology to make their lives easier, that's never going to change. I'd be more worried about a vehicle that's made in the last 10yrs that's literally Facebook on wheels than I would be of flock cameras taking random snapshots.\n\nOn of the reasons I stick with Ford where I can go in with Forscan and disable the telemetry on them.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-05-08 07:16:27",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[deleted]",
                                    "score": 5,
                                    "depth": 3,
                                    "timestamp": "2025-05-08 13:11:25",
                                    "replies": [
                                        {
                                            "author": "TopExtreme7841",
                                            "body": "That's a matter of opinion, the overwhelming majority of normies are very much for what allows. Don't forget, we're the weirdos.\n\nTake a normal person, and say hey, I can disable the telematics systems in your car which will give you more privacy, you won't be able to start it with the app, won't be able to play with climate control from inside your warm or cool house, won't be able to use your phone as a key,  won't be able to view your oil life, won't be reminded of service needed automatically, won't be able to click a button to schedule a service that will already know what needs to be done and just spit out a date for you, won't be able to send a tow truck to that unknown location in the middle of nowhere that you can't explain...the list goes on. Good luck convincing normal people of that.\n\nPeople WANT this stuff. It's going to keep coming. Our best hope is to keep stuff as privacy respecting as humanly possible, but we're not stopping the progression, thinking we can is delusional. \n\nThose staff-less Amazon stores have already started how retail is going to end, tell a mother with a bunch of kids she can walk into a supermarket, and through whatever method have her identity known, can just load up a cart and walk back out the door, no lines, no cashier, just walk out. That IS going to happen, it's already started. The overwhelming majority use store rewards cards, linked their banks to them, they already know who they are and what they're buying, and that's how people will view it, skipping the worst step in the process which is the line and cashier. Nobody is fighting that, half the privacy advocates won't even fight it, who we kidding?\n\nSome of this stuff is working FOR us as well. I have a handful of store apps, linked to bullshit names, blowoff phone numbers, made up PO Boxes, and linked to masked cards that will work with any info or ZIP code used. I get the benefit, and they don't know anything that's real, works at the gaspumps as well. That will change and it won't be that easy, but there's always ways to push back. It's a cat and mouse game.",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2025-05-08 15:53:06",
                                            "replies": [
                                                {
                                                    "author": "Ttylery",
                                                    "body": "I just meant having to use a specialized tool to disable \"features\" that should be under a menu. Just an option to not use all those things and have them hidden and not in my face when not in use. \n\nIf I dont have Sirius radio, then I shouldnt see it as an audio option (Ill never have it and I will never buy it so I really dont even want a physical button for it).",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-05-08 17:09:00",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EpictetanusThrow",
            "body": "I love that tech and privacy rights are mutually exclusive in both your telling and this regime’s outlook.\n\nBuckle up for the Stasi, boys.",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-05-08 11:32:09",
            "replies": []
        },
        {
            "author": "norfizzle",
            "body": "Privacy Act of 1974 desperately needs updating to include private collection of data, not just gov't.",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-05-09 10:53:18",
            "replies": []
        },
        {
            "author": "PM_ME_YOUR_MONTRALS",
            "body": "Can we agree to publicly shame anyone seen wearing these?",
            "score": 9,
            "depth": 0,
            "timestamp": "2025-05-08 19:27:45",
            "replies": [
                {
                    "author": "Forsaken-Hearing8629",
                    "body": "Like [this guy](https://www.boredpanda.com/man-confronts-creepy-influencer-for-filming-women-with-smart-glasses/) confronting a YouTuber secretly recording women while wearing them.",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2025-05-09 05:57:28",
                    "replies": []
                }
            ]
        },
        {
            "author": "sambull",
            "body": "With patented *woke not woke \" Identification tech",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-05-08 06:30:35",
            "replies": [
                {
                    "author": "Manga_Reader831",
                    "body": "New potential for hate crimes",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2025-05-08 08:48:07",
                    "replies": []
                }
            ]
        },
        {
            "author": "TeamFlameLeader",
            "body": "Meta sucking trumps toes",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-09 12:31:53",
            "replies": []
        },
        {
            "author": "M3wr4th",
            "body": "[ Removed by Reddit ]",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-05-08 07:49:19",
            "replies": []
        }
    ]
}