{
    "post_title": "Thoughts on AI as a Christian?",
    "post_timestamp": "2024-12-09 11:35:47",
    "last_comment_timestamp": "2025-03-07 02:11:48",
    "time_difference": "87 days, 14:36:01",
    "comments": [
        {
            "author": "Deleted",
            "body": "I think it’s a tool that could be used for good or for evil like almost anything else",
            "score": 36,
            "depth": 0,
            "timestamp": "2024-12-09 11:43:30",
            "replies": [
                {
                    "author": "Esox_Lucius_700",
                    "body": "Exactly.\n\nWe use GPT's at work to help us code, write better documentation, create cool diagrams, summarize long text etc.. like personal assistant.\n\nAlso our analytics team use different AI models to predict business trends, customer behavior, customer satisfaction etc..\n\nSecurity team uses it to detect new kind of attacks and sift through logs.\n\nThere is multitude of legit and normal use for it. And has been for year before we had consumer level GPT's (like ChatGPT, Copilot etc..) available. Your Spotify suggestions, web advertisement, stock markets, weather analysts have used \"AI\" or machine learning and different similar tools for ages.\n\nOr course some people use it for criminal purposes. Deepfakes, scams, phishing, writing malicious code. Just like people uses different tools before that.\n\nAnd some people get carried away and uses it in purposes where it does not fit (like giving sermons or answering different hotlines or doing diagnostics). And some people use it for fun and filth (like erotica, smut etc..).\n\nI understand that for some people this \"AI\" hype will be like Internet was in its early days, or TV or radio before that. Or mobile phones or.. you name it. We tend to be scared about something we do not know or understand.\n\nCurrently there is no real AI. LLM's are good prediction machines than can analyze and process massive amounts of data and build connections and relations between data points. There is no real \"intelligence\" as we see it or as it has been depicted in sci-fi.\n\nIt is just advanced mathematics, statistics and linguistics. It has no spirit, will or consciousness. So it can't be \"demonic\" or \"evil\". It can be erroneous, buggy, biased - or otherwise faulty. As anything we humans build or train.\n\nTo me - current \"AI's\" are like any other computer program I use to get job done.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-12-10 11:22:25",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 15,
            "depth": 0,
            "timestamp": "2024-12-09 14:28:12",
            "replies": []
        },
        {
            "author": "Lavishness-Economy",
            "body": "My biggest concern is that it will devalue artistry like art and writing - we're people made in God's image, our creativity is part of what sets us apart. I don't like that we're handing it off so easily to AI (and then laughing when artists protest against losing their jobs)",
            "score": 9,
            "depth": 0,
            "timestamp": "2024-12-09 13:14:04",
            "replies": [
                {
                    "author": "bunker_man",
                    "body": "People are only laughing at artists inasmuch as some people don't really want to address what is actually happening. Protesting technology that makes stuff easier because less people will be paid to do it is blaming the wrong thing. The issue is capitalism, and the fact that it has an idea how much each person needs to work to be valuable instead of increases in technology having the same amount of people each do less work. Professional artists and everyone else would love reduced work weeks. Blaming AI is actually a distraction from the real issue.\n\nI followed one professional artists for years who likes to draw characters and figures but not backgrounds for stuff. And in his new stuff he is working on now the characters are still hand drawn, but some of the backgrounds look like they might have used AI. I can't totally blame him, because backgrounds were never his thing even before AI, and stuff he worked on often didn't have especially interesting backgrounds. So he is still doing what he likes to do, but now with something that makes some of the work flow faster. And people who come there for his character art will still get to see hand drawn characters by him. People may like or dislike that he does this, but he isn't hurting himself by automating minor details in the workflow. And if there's a problem it's with capitalism.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-12-09 17:41:27",
                    "replies": [
                        {
                            "author": "ThePotatoOfTime",
                            "body": "No, but he's hurting other artists by stealing from them, which is basically what AI 'art' does. As a creative, I'm pretty worried to see what happens next for artists, authors etc. AI is a real problem for designers and people who self publish, as people are uploading AI drivel to print on demand platforms and soaking the market with crap so real art is harder to find. I think AI can be a good tool when used well, but when it comes to the creative space I think it's a travesty and goes against the Creator's intention in how we are made to create.",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2024-12-09 19:11:58",
                            "replies": [
                                {
                                    "author": "bunker_man",
                                    "body": ">No, but he's hurting other artists by stealing from them, which is basically what AI 'art' does. \n\nThat's not really what AI does in any meaningful sense. It's not a database of pictures that it frankensteins from, it scans things to learn what a \"cat\" is statistically based on millions of pictures. That's not considered plagiarism because if things are sufficiently transformative it is considered distinct, and since it's not based on any one thing there is no specific thing to connect it to. And observation of publicly available pictures isn't legally stealing either, otherwise normal artists couldn't learn from them.\n\nLike yeah, it *can* be used to plagiarize if someone makes a version based on a specific artist. But no one would do that for anything they intend to actually sell on a large scale, because they'd get sued immediately. And it was already possible for people to just copy stuff and edit it and claim it was their own, ai wasn't needed for that. \n\n>As a creative, I'm pretty worried to see what happens next for artists, authors etc. AI is a real problem for designers and people who self publish, as people are uploading AI drivel to print on demand platforms and soaking the market with crap so real art is harder to find. \n\nTbf AI books are atrocious, so no one is going to read those instead of real books. I doubt ai will be good enough to write real books, because it can make surface level aesthetics, but the logic of connection is a lot harder. \n\n>I think AI can be a good tool when used well, but when it comes to the creative space I think it's a travesty and goes against the Creator's intention in how we are made to create.\n\nThe thing is, what ai does was already a thing artists did for eons. In the past master artists would often fill in the important details of a painting themselves and then have novices do the busywork for the small details. So they were already handing off a bit of control to other people often who would get little to no credit for it. Ai is just that same idea but faster. And it's not much different than photos or photoshop. Photos are actually more directly copying imagery, since unless you only photograph nature, you are photographing designs other people made to repurpose for art. And photoshop already had tools designed to automate some of the art process.\n\nYeah, if people produce a lot of slop it will be bad. But every generation produces a lot of lazy stuff. If anything ai might decrease open plagiarism, because in the past people would steal and slightly edit entire images or snippets of text, and if those people use ai instead and people roll their eyes it's less intrusive to any one individual.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-12-09 20:24:14",
                                    "replies": [
                                        {
                                            "author": "ThePotatoOfTime",
                                            "body": "But when it scans things to learn what a cat is, it is scraping from millions of artists who have not given consent for their work to be involved in AI datasets. Here's an article on how it is stealing:\nhttps://juliabausenhardt.com/how-ai-is-stealing-your-art/\n\nRegarding books, yes it is utter slop, but the problem is the volume at which it is being generated and uploaded to POD platforms mean real authors have less room for discoverability. It is drowning the market.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-12-10 04:32:47",
                                            "replies": [
                                                {
                                                    "author": "bunker_man",
                                                    "body": ">But when it scans things to learn what a cat is, it is scraping from millions of artists who have not given consent for their work to be involved in AI datasets.\n\nWhy would they have to give consent? Again, its not saving a database of images. Its just looking at publicly available images to add to its understanding of what a cat is. If it doesn't produce something that looks like any of these images, then its not plagiarizing. Human artists could look at them and copy their style as long as they don't produce and try to sell something too similar. It makes no sense to treat machines differently.\n\n>Regarding books, yes it is utter slop, but the problem is the volume at which it is being generated and uploaded to POD platforms mean real authors have less room for discoverability. It is drowning the market.\n\nI dunno, on the author places I go like royal road, AI stuff gets rated badly so much it largely disappears from visibility, and they have to tag if it is ai written, so people can just skip it. Bigger issue is that on something like amazon you need to be an adult with a card to buy stuff so the ratings are usually real, whereas on free amateur sites there's no floor to the age of people using the site, so anyone who wants can give whatever they want bad ratings just to try to elevate what they like. So its pure chaos to try to be discovered.",
                                                    "score": 0,
                                                    "depth": 5,
                                                    "timestamp": "2024-12-10 04:53:17",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "I don't like the fact that there's a church that has recently been using an \"ai Jesus\" for people to confess their sins too.. I think that's wrong and a bit demonic .",
            "score": 22,
            "depth": 0,
            "timestamp": "2024-12-09 13:43:15",
            "replies": [
                {
                    "author": "Electrical-Pickle927",
                    "body": "Would you say it is an abomination of desolation in a place it does not belong?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-12-09 15:29:05",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "AI is a tool.  A hammer can be used to build a house or bash someone's head in.",
            "score": 10,
            "depth": 0,
            "timestamp": "2024-12-09 13:50:20",
            "replies": [
                {
                    "author": "Prestigious_Pea2620",
                    "body": "This is insightful",
                    "score": 6,
                    "depth": 1,
                    "timestamp": "2024-12-09 14:48:19",
                    "replies": []
                }
            ]
        },
        {
            "author": "Nateorade",
            "body": "I’m upskilling to make sure I don’t lose my job.",
            "score": 7,
            "depth": 0,
            "timestamp": "2024-12-09 11:48:14",
            "replies": []
        },
        {
            "author": "PaulTheApostle18",
            "body": "Humans are trying to create the worst of all idols, an AI deity.\n\nDon't trust it, brothers and sisters.\n\nThe image given breath of life is before you and is influencing people currently in the world, which will only get worse.\n\nSome of you cry, \"Oh, it's just another tool\", \"Oh, it's harmless,\" etc.\n\nWhat tool do you know of that could ever be used to give personalized advice or influence us?\n\nWhat tool can be used to generate words for you?\n\nWhat tool can talk to you in a conversation?\n\nIt is creeping up on all of us, like a panther readying to pounce from out in the field.\n\nNo one sees the panther until its teeth are sunk into your flesh. \n\nDon't become complacent.  \n\nCan you not see where this is going, my friends?  \n\nThe Kingdom of God is at hand.\n\nRemember, Jesus is the King of kings,  and every knee will bow. \n\nPut your faith in Him, always.  \n\nGod bless",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-12-10 01:08:36",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "What aspect of Christianity is going to make people concerned about AI",
            "score": 10,
            "depth": 0,
            "timestamp": "2024-12-09 11:44:29",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "[deleted]",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-12-09 14:32:05",
                    "replies": [
                        {
                            "author": "bunker_man",
                            "body": "Ai probably on average has less misconceptions than the average person has already though.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-12-09 17:42:07",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lazy_Middle1582",
                    "body": "The mark of the beast",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-12-09 14:17:42",
                    "replies": [
                        {
                            "author": "mauimudpup",
                            "body": "Thats a mark people take to biy and sell and show their allegiance. It's not something people will be tricked into taking",
                            "score": 0,
                            "depth": 2,
                            "timestamp": "2024-12-09 14:40:04",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zestyclose-Secret500",
                    "body": "There has been a recent controversy over the Swiss Church setting up an AI Jesus booth.  I'm assuming that is what the OP is referring to.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-12-09 14:41:28",
                    "replies": []
                }
            ]
        },
        {
            "author": "forest_elf76",
            "body": "I worry about it. That it will take away human thinking. Like a shortcut to study and learning: and it will always try to give an answer even if its wrong. Students rely on it instead of finding out things for themselves.\n\nIt's worth asking if it embodies christian values. To me in its current state it doesn't: it takes away creative jobs, and cheapens art. It also doesn't teach people to find information themselves and to critically think for themselves (which is lacking in our times as it is)",
            "score": 7,
            "depth": 0,
            "timestamp": "2024-12-09 15:07:22",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "I think it’s kinda cool but in the end I believe it will probably be one of the things that is apart of the end of days.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-12-09 13:14:21",
            "replies": []
        },
        {
            "author": "Zestyclose-Secret500",
            "body": "The recent news that the Swiss Church set up an AI Jesus booth for offering spiritual advice is quite concerning.  Here is a news article from NBC.\n https://www.nbcnews.com/news/world/deus-machina-swiss-church-installs-ai-jesus-connect-digital-divine-rcna182973\n\nI think by consulting an AI for spiritual advice, we risk replacing God with an idol.  I can see it being OK to look stuff up, but to confess to it or take it's word as a spiritual authority is very bothersome to me and seems downright sacrilegious, imo.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-12-09 14:40:21",
            "replies": []
        },
        {
            "author": "mini-eclipse",
            "body": "What do you mean? Like C.ai, ai art (I dislike ai art) or just ai/robots in general?",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-12-09 11:42:18",
            "replies": [
                {
                    "author": "fam0us_n0b0dy29",
                    "body": "Just AI in general",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-12-09 14:40:36",
                    "replies": [
                        {
                            "author": "mini-eclipse",
                            "body": "I don't think it's a bad thing, but it can be used for bad but also for good. Idk",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-12-09 14:41:40",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nateorade",
                    "body": "I assume they mean LLMs",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-12-09 11:47:28",
                    "replies": []
                }
            ]
        },
        {
            "author": "LordScottimus",
            "body": "Its pretty cool!  I use it to ask Study questions so that I may identify where something is located in the bible quickly.  I ask it questions on historical Christianity as well (I ALWAYS double check answers and do not take the answers at face value.) Its like I have my own Jarvis from Iron man! Lol",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-12-09 11:48:25",
            "replies": []
        },
        {
            "author": "Gemnist",
            "body": "It should be used to expedite work, not supplant it.",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-12-09 15:05:22",
            "replies": []
        },
        {
            "author": "Ok_Nature6459",
            "body": "I think we are about to create an artificial version of God, the consequences of could be not so great...",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-12-09 15:17:21",
            "replies": []
        },
        {
            "author": "zurajanai0001",
            "body": "It's just a tool. Like any other tool, we shall not rely on it. And it can be used for good purpose. For example, I've been using it to create gospel music, you can check this out: https://youtube.com/@mobioops?si=wJ1twMyeZ0r6HB6F",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-12-10 01:13:32",
            "replies": []
        },
        {
            "author": "Virtual-Reindeer7904",
            "body": "Its a useful tool for having it look up information quicker and you can tell it to use more reliable sources and ro be able to back up data from articles or trustworthy places. \n\nBut still needs work. It makes things qyicker to look up but always do your own research. Its just a tool like typing in a question into google.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 12:45:52",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "[deleted]",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-12-09 14:50:21",
                    "replies": [
                        {
                            "author": "Virtual-Reindeer7904",
                            "body": "Thats why I said still do your own research. Same with any other information. Otherwise we give way to misinformation and stay ignorant.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-12-09 16:20:09",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[deleted]",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-12-09 16:23:50",
                                    "replies": [
                                        {
                                            "author": "Virtual-Reindeer7904",
                                            "body": "I can have chatgpt brainstorm with me. I can ask it questions to extend ona theory or find a point i didint consider. Infact it also helps me come up with some out there plot points for the fiction books i like to write. \n\nBut it cant do that essay for me. It cant write my books. It cant do my researxh.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2024-12-09 17:13:41",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "bunker_man",
                            "body": "Tbf that's mostly because it's new. Over time people will probably catch on not to take it seriously.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-12-09 17:43:01",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thatsthewayuhuhuh",
            "body": "I have no idea what this question is suggesting, but me believing in Jesus and treating people correctly has no relation to recent AI developments",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 12:48:18",
            "replies": [
                {
                    "author": "Zestyclose-Secret500",
                    "body": "The Swiss Church recently set up an AI Jesus booth. I think that is probably what prompts the OPs question.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-12-09 14:42:43",
                    "replies": []
                }
            ]
        },
        {
            "author": "DangerousKidTurtle",
            "body": "Make sure you’re not trying to get moral or theological knowledge/fulfillment from it and you’ll be fine.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 13:07:53",
            "replies": []
        },
        {
            "author": "RuinGlacier",
            "body": "I’m not concerned at all. I’m more concerned about nuclear warfare than I am about a computer.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 14:13:42",
            "replies": []
        },
        {
            "author": "Dedianator65",
            "body": "I bet they would behave better than a lot of \"Christian's\"!",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 14:37:52",
            "replies": []
        },
        {
            "author": "mauimudpup",
            "body": "What people call AI is not artificial intelligence. Its not slighty more advance computer programs",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 14:38:48",
            "replies": []
        },
        {
            "author": "Dedianator65",
            "body": "As a Christian I could get AI to take over my setup responsibilities on Sunday, 10 out of 10 would recommend so if you hear of any AI wanting to be Christian, please let me know!!!!",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 14:40:46",
            "replies": []
        },
        {
            "author": "XokoKnight2",
            "body": "There are some things that being Christian doesn't change my answer to. I use AI, a lot tbh, but it's the same if you asked me \"as a Christian, do you prefer laptops or PC's? And my answer wouldn't be swayed because of the as a Christian part",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 15:24:29",
            "replies": []
        },
        {
            "author": "David123-5gf",
            "body": "Great opinion... It really helps me to clear my doubts and become more knowledgeable and stronger in my faith",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 16:08:36",
            "replies": []
        },
        {
            "author": "Classic-Tension-5587",
            "body": "Artificial Intelligence is a tool just like the internet. and just like any other tool, it must be used [not worshipped or anything else]. it must be controlled rather than it controlling the one who wields it. \n\n“Does the ax raise itself above the person who swings it, or the saw boast against the one who uses it? As if a rod were to wield the person who lifts it up, or a club brandish the one who is not wood!” (Isaiah 10:15 NIV). \n\nAI is the axe that must not raise itself above the person who swings it, it is the saw that must not boast against the one who uses it. people must always be in control of AI while using it.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 19:02:15",
            "replies": []
        },
        {
            "author": "Fast_Jury_1142",
            "body": "I don't like it. I don't think it should be in job applicant tracking systems. I think it might be good for science, but not for job seekers.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 22:03:23",
            "replies": []
        },
        {
            "author": "TroutFarms",
            "body": "I don't think there is anything distinctively Christian about AI. Thus Christians shouldn't have a single view on it; they should have as many views on it as non-Christians have.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 22:50:34",
            "replies": []
        },
        {
            "author": "antisocialforkedup",
            "body": "I found nothing wrong with AI. Let's say I have a knife. I can use my knife to cook delicious food and feed the hungry but I can also use it to kill a random guy on the street. \n\nIn my opinion, AI doesn't make you sin unless you use it in a bad way (e.g. cheating on academics) but I can use AI to help me find connected verses in the Bible. \n\nMy advice with AI is use it in a good way. Do not abuse it. Verify the facts it is giving you.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 23:59:53",
            "replies": []
        },
        {
            "author": "order_through_chaos",
            "body": "Ecclesiastes 1: 9-10\n\n\"9 What has been will be again,\n    what has been done will be done again;\n    there is nothing new under the sun.\n10 Is there anything of which one can say,\n    “Look! This is something new”?\nIt was here already, long ago;\n    it was here before our time.\"\n\nThis is our modern day tower of babel. Whether it is used as a tool, a weapon, a deity, or anything in between, it is certainly a testament to our fallen nature. As far as potential, I think it's more significant than our discovery of nuclear power. It almost certainly eclipses the potential destructive capability. Rather than splitting at atom, we have learned to divide an already atomized society and culture. Look at the algorithms that control the flow of information on our devices. Revelation speaks about deception increasing as the end approaches. Whether the enemy will use this tool in his final deception is unclear, but certainly possible. I don't trust it. Even if it's not part of prophecy, it's still a very big step in a direction that has taken us far from anything resembling the life a natural human being was made for.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-10 08:43:16",
            "replies": []
        },
        {
            "author": "Man_Who_Loves_God",
            "body": "I think AI is really cool, however I feel it has more cons than pros. I think we need to incorporate regulations on AI, otherwise a lot of people are going to lose their jobs.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-11 07:38:44",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Like about everything it can be used for good or bad. \n\nFire can be used to torture and destroy but also to heat and cook.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-11 12:37:34",
            "replies": []
        },
        {
            "author": "Living-Doughnut401",
            "body": "Here's one pastor's thoughts on God & AI - [https://www.youtube.com/watch?v=aCagNtgiejY](https://www.youtube.com/watch?v=aCagNtgiejY)",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-03-06 18:43:06",
            "replies": [
                {
                    "author": "fam0us_n0b0dy29",
                    "body": "Thank you",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-03-07 02:11:48",
                    "replies": []
                }
            ]
        },
        {
            "author": "jaylward",
            "body": "What does this have to do with Christianity, specifically?",
            "score": 4,
            "depth": 0,
            "timestamp": "2024-12-09 12:45:14",
            "replies": [
                {
                    "author": "fam0us_n0b0dy29",
                    "body": "Some individuals believe that AI is evil or demonic. Others believe that it will have a role during the end times like the mark of the beast.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-12-09 14:41:48",
                    "replies": [
                        {
                            "author": "jaylward",
                            "body": "Those individuals are foolish and are being led around by the nose by secular culture.\n\nI frankly don’t care what some individuals think.\n\nThis has nothing to do with the Bible.",
                            "score": -2,
                            "depth": 2,
                            "timestamp": "2024-12-09 15:08:01",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "heybossbabe",
            "body": "AI has been around for decades, it’s just advancing now. I don’t think there’s any certain stance we should have on it as a Christian, though…",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-12-09 11:42:03",
            "replies": []
        },
        {
            "author": "tonylouis1337",
            "body": "It should be regulated to the highest order. Maybe it should even get an AI Bill of Rights. Way way way too much capability for mass manipulation with it. The strides AI has made in just the last couple years is extraordinary and we should take it seriously",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-09 12:20:37",
            "replies": []
        },
        {
            "author": "Practical-Daikon9351",
            "body": "This is way too broad of a question and not concerning to Christians in how it’s stated. I think a better way of stating something like this is to narrow it down to teachings. \n\nIn which I would be majorly concerned if a pastor (or whomever is leading the study) used it to make his or her teaching.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-09 13:31:44",
            "replies": [
                {
                    "author": "Practical-Daikon9351",
                    "body": "My own personal thoughts in general are that for  agriculture, medical, science.. I am all for it. For things like art and music I am against it for the most part. \n\nExample being take the owner of the game Stellaris, he uses it to get the ideas down, out if his head than he passes it off to his art team to actually make the concept art the players see. That is how AI should be used.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-12-09 13:36:32",
                    "replies": []
                },
                {
                    "author": "fam0us_n0b0dy29",
                    "body": "Sorry, I’ll try to phrase my questions in better way next time.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-12-09 14:45:33",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "I want to see the medical application. I fear money will block this as currently a sick patient is $$$.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-09 19:02:50",
            "replies": []
        },
        {
            "author": "RikLT1234",
            "body": "I think it'll make us brain dead, making us not think anymore, and that evil has advantage over us with it in the end times. AI could also be manipulated and pre-set for a specific goal.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-09 19:51:57",
            "replies": []
        },
        {
            "author": "legitematehorse",
            "body": "Same as asking \"Thoughts on calculators as a Christian\". LOL!",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-10 04:55:56",
            "replies": []
        },
        {
            "author": "rcc777trueblue",
            "body": "AI reminds me of the invention of the car. AI is the steering wheel to the invention of the mark-of-the-beast that is in prophecy.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-09 12:51:24",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "Does the chicken or egg come first?\nAI says egg. God's Word says chicken.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-09 17:52:37",
            "replies": []
        },
        {
            "author": "Renegade_Meister",
            "body": "\"AI\" as we know it today, is basically **an elaborate and more convenient way to auto load the content from a first Google search result.**\n\n\nIt generates **what its creators think we should hear/see**. It delegates yet another layer of truth-seeking to a third party, and requires even less thinking & creativity from people.\n\n\nLike any tool, it can be used for good or bad. I do think that delegation ultimately does more harm than good to society because I know that the strongest faiths I've seen are from people who are diligent in seeking truth, especially direct from the bible.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-12-09 21:13:22",
            "replies": []
        },
        {
            "author": "Atravellingsheep",
            "body": "Terminator 2.  I feel like an apocalyptic scenerio would be fun, but if only everyone else was saved.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-12-09 12:13:09",
            "replies": []
        }
    ]
}