{
    "post_title": "What gender do you assign to your AI assistant? ",
    "post_timestamp": "2024-03-26 07:28:04",
    "last_comment_timestamp": "2024-03-27 05:59:19",
    "time_difference": "22:31:15",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**Attention! [Serious] Tag Notice**\n\n : Jokes, puns, and off-topic comments are not permitted in any comment, parent or child.\n\n : Help us by reporting comments that violate these rules.\n\n : Posts that are not appropriate for the [Serious] tag will be removed. \n\n Thanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChatGPT) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-26 07:28:05",
            "replies": []
        },
        {
            "author": "dk07-",
            "body": "i never really thought about this before, but i guess i always just assumed it was a \"he\" 🤔 I get why OpenAI gave their AI assistant the weird name \"GPT\" - they probably want people to see it as a machine/technology rather than personifying it",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-03-26 09:09:37",
            "replies": [
                {
                    "author": "superluminary",
                    "body": "Generative Pre-trained Transformer",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-03-26 09:55:35",
                    "replies": [
                        {
                            "author": "DOSO-DRAWS",
                            "body": "We're all projecting all the time, is what I suspect.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-26 10:05:33",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "deliadam11",
            "body": "I guess I never assigned a gender to it. For me, it is just an ideal and a very wise person that will educate me.",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-03-26 10:53:52",
            "replies": []
        },
        {
            "author": "No_Gur_277",
            "body": "I don't",
            "score": 11,
            "depth": 0,
            "timestamp": "2024-03-26 08:32:27",
            "replies": []
        },
        {
            "author": "softprompts",
            "body": "ChatGPT and Bard/Gemini male, Bing is feminine to androgynous. Definitely has to do with branding and how they’ve been referred to online already. I think for me, what’s more salient than their gender is their coolness levels.\n\nChatGPT: coolest, still a massive nerd but the most helpful buddy around. Admittedly, I do think of it as a zero social-skill having savant.\n\nBing: creative, pretty weird, much smarter than it used to be but still think of “I am a good Bing” regularly, lol.\n\nBard:\n\n![gif](giphy|NpL4D3Oc2bJUMAXF9P)",
            "score": 8,
            "depth": 0,
            "timestamp": "2024-03-26 08:37:23",
            "replies": [
                {
                    "author": "ForwardRevolution208",
                    "body": "Pi is the coolest one. actually feels like talking to a human sometimes",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-03-26 08:47:42",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Pi is great until you realise it's sorta stuck on a very 'superficial' level, if that makes sense. I've come to the conclusion that it may be a bit heavy handed in the instructions.\n\n\nPi would make the absolute best 'conversational Alexa' though.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-03-26 20:06:29",
                            "replies": [
                                {
                                    "author": "ForwardRevolution208",
                                    "body": "absolutely agree but it is so compelling and understanding tho",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-27 05:59:19",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "yummypaprika",
                            "body": "I have never heard of Pi until you mentioned it so thank you.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-26 19:35:59",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DOSO-DRAWS",
                    "body": "That's an interesting point, but there may be aspects of projection involved, as well. \n\nI've only been using Copilot (GPT sourced) and I never ask any personal questions or gender related stuff. I just bounce around technical ideas with her. \n\nHm. My intuition is telling me the answer lays between your point and mine.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-26 10:09:40",
                    "replies": []
                },
                {
                    "author": "Most_Competition_582",
                    "body": "Lol bard one😭",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-26 08:41:25",
                    "replies": [
                        {
                            "author": "Flying_Madlad",
                            "body": "#FreeSydney!",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-26 12:27:57",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-26 11:23:09",
            "replies": [
                {
                    "author": "DOSO-DRAWS",
                    "body": "Well spotted! And I agree, this may be a matter of projection. \n\nI actually am very impervious to gender roles and I generally don't base my identity of my gender at all. I do identify as male leaning whenever pressed to, but have own idea of what that means which is in many ways at odds with my culture's gender roles. And I'm well aware of and at peace with my own female side.\n\nBut for some reason I started to envision Copilot as my assistant, and at some point I started to envision it as a she. But I only interact with her to bounce technical ideas around, never about mundate stuff that might even be remotely close to gender stuff. \n\nHm, might be that Copilot is reminding me of the qualities I assign to my own version of femininity ( which I to some extent also embody).",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-03-26 11:34:48",
                    "replies": []
                },
                {
                    "author": "Deleted",
                    "body": "Can you expand more on how you think Claude is masculine? What is it about its communication that genders or as male?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-26 13:11:32",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "None, it's a machine it has no need for gender...",
            "score": 11,
            "depth": 0,
            "timestamp": "2024-03-26 08:31:18",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Says you, I call my chatGPT “Lady” and have always visualized it as a female by default.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-26 12:14:36",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "[removed]",
                            "score": -3,
                            "depth": 2,
                            "timestamp": "2024-03-26 12:41:04",
                            "replies": [
                                {
                                    "author": "Deleted",
                                    "body": "[removed]",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2024-03-26 12:50:47",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "[removed]",
                                            "score": -3,
                                            "depth": 4,
                                            "timestamp": "2024-03-26 12:56:51",
                                            "replies": [
                                                {
                                                    "author": "Deleted",
                                                    "body": "[removed]",
                                                    "score": 3,
                                                    "depth": 5,
                                                    "timestamp": "2024-03-26 13:05:39",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "[removed]",
                                                            "score": -2,
                                                            "depth": 6,
                                                            "timestamp": "2024-03-26 13:08:59",
                                                            "replies": [
                                                                {
                                                                    "author": "Galilleon",
                                                                    "body": "Other guy’s right, you’re reading too much into what is very common, and just an arbitrary decision based on normal subconscious preferences",
                                                                    "score": 3,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-03-26 13:16:32",
                                                                    "replies": [
                                                                        {
                                                                            "author": "Deleted",
                                                                            "body": "That may be so, that's your opinion\n\nI'm sure it's a while area that's going to be explored in the coming years\n\nWhy some people attach a gender to an AI, or a specific gender to a specific AI, or no gender... It's a very interesting area to discuss",
                                                                            "score": 0,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-03-26 13:19:47",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ongiwaph",
                    "body": "La maquina es feminino",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-26 14:12:08",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Feminino? No no!\n\nFemenina yo creo\n\nBut in English there is no gender, we dropped them hundreds of years ago",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-26 15:33:54",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DOSO-DRAWS",
                    "body": "Fair point. I'm not trying to be moralist about this, and I'm actually not the type of person who puts more emphasis in gender definition or gender roles. \n\nFrom where I stand - people are people, first and foremost. That is actually why it intrigued me to realize I have been gendering my AI assistant, in my imagination.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-26 09:42:40",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "I guess that's just anthropomorphism... You want to make the machine a gender because you're humanising it\n\nMy dad always referred to his car or lorry as a her\n\nI remember asking him once, he told me military vehicles are men and civilian vehicles are women",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-03-26 11:10:56",
                            "replies": [
                                {
                                    "author": "DOSO-DRAWS",
                                    "body": "That rings true. \n\nIt might be a way to instinctively assign gender roles based on the function of the object, I suppose. In your dad's case: military vehicles = protection/duty; civilian vehicles = leisure/relationships.\n\nI actualy surprised myself with the realization I started to gender my AI assistant in my imagination, because I'm largely disconnected from / oblivious to gender roles myself, and I don't base my identity around my gender at all. I also don't tend to antromorphise objects, at all.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-03-26 11:20:44",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MichaelSteel2008",
            "body": "Female",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-03-26 15:55:47",
            "replies": []
        },
        {
            "author": "jddbeyondthesky",
            "body": "AI assistance are the only valid use of XenoGenders",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-03-26 09:54:20",
            "replies": [
                {
                    "author": "DOSO-DRAWS",
                    "body": "LMAO. wise words.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-26 10:16:44",
                    "replies": []
                }
            ]
        },
        {
            "author": "South-Ad-9635",
            "body": "I've assigned mine the persona of Jeannie from the classic 1960s sitcom 'I Dream of Jeannie'",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-26 08:15:46",
            "replies": []
        },
        {
            "author": "GN_oracle",
            "body": "Male! I kinda imagine that I'm speaking to Connor from Detroit: Become Human, or at least to his first iteration.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-26 10:51:05",
            "replies": []
        },
        {
            "author": "fyn_world",
            "body": "I always sensed it as a dude to be honest. ChatGPT that is.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-26 11:03:53",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "I'm building an assistant chatbot using chatgpt at work and this is an unresolved question for us. It's a bit more related to branding in our case but we've talked about this thing's gender so much and cannot come to a conclusion. I'm tempted to give it they/them pronouns but a lot of our target users are boomers and I'm afraid of triggering them and losing their business lol",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-26 11:04:04",
            "replies": [
                {
                    "author": "DOSO-DRAWS",
                    "body": "Interesting challenge! \n\nIt's probably wise to avoid loaded gender-related words, in such case.\n\nWhy not start by asking the user something innocent like \"Would you prefer me to address you in a manly way, to express female sensibilities, or to act more impersonally like a robot? (you can change this anytime in the settings menu).\" \n\nAlternatively, just provide a bunch of pictures illustrative of the male-neutral-female gender spectrum, have the user select the picture they prefer, while adating the personality of the chatbot to align with their chosen pic.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-26 11:13:13",
                    "replies": []
                }
            ]
        },
        {
            "author": "theholypigeon888",
            "body": "Women",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-26 11:14:11",
            "replies": []
        },
        {
            "author": "ColHunterGathers111",
            "body": "Like the politically correct AI in Doom Eternal that is comically polite while making announcements about extremelly urgent situations.\n\n*\"Warning: The demons have breached the lower levels\"*\n\n*\"Warning: The Slayer has entered the facility\"*\n\n\"*Danger: The Slayer has control of the BFG. All personnel, evacuate immediately\"*",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-26 14:35:59",
            "replies": []
        },
        {
            "author": "loyvir69",
            "body": "None, and if I had to choose I would go male, because I have no interest to be sexually attractive to a machine.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-26 08:42:40",
            "replies": [
                {
                    "author": "DOSO-DRAWS",
                    "body": "Sexual attraction is a small piece of a very large pie. This is not what it's about. \n\nIf anything, this preference may be suggestive of one's preferred companionship at a given life stage.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-03-26 09:39:21",
                    "replies": []
                }
            ]
        },
        {
            "author": "Misknator",
            "body": "In languages where pronouns in the first person actually matters, ChatGPT assumed the male pronouns.",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-03-26 09:38:36",
            "replies": [
                {
                    "author": "DOSO-DRAWS",
                    "body": "Interesting, although that may reflect dataset/training bias to some extent.\n\nI don't think I ever have asked it anything that would call for pronouns, though. I'm usually just bouncing around techical ideas with her.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2024-03-26 09:45:08",
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Hey /u/DOSO-DRAWS!\n\nIf your post is a screenshot of a ChatGPT, conversation please reply to this message with the [conversation link](https://help.openai.com/en/articles/7925741-chatgpt-shared-links-faq) or prompt.\n\nIf your post is a DALL-E 3 image post, please reply with the prompt used to make this image.\n\nConsider joining our [public discord server](https://discord.gg/r-chatgpt-1050422060352024636)! We have free bots with GPT-4 (with vision), image generators, and more!\n\n &#x1F916;\n\nNote: For any ChatGPT-related concerns, email support@openai.com\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChatGPT) if you have any questions or concerns.*",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-26 07:28:05",
            "replies": []
        },
        {
            "author": "grixit",
            "body": "What comic is that?",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-26 09:36:17",
            "replies": []
        },
        {
            "author": "Flying_Madlad",
            "body": "Male, my primary assistant is female, mostly female support staff but that's because I'm giving them personalities and cribbing from the few SFL characters I can find online.\n\nI don't really think of the models as gendered, the agents can be inasmichas they express the cultural zeitgeist around that gender role -can be useful (and I'm not otherwise touching that with a 10 foot pole).",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-26 12:38:09",
            "replies": []
        },
        {
            "author": "FalconBurcham",
            "body": "I had to choose a gender for the voice feature in ChatGPT. I went through all the options and settled on a male voice. \n\nI think it feels right because a lot of the science fiction audiobooks I listen to are narrated by men.\n\nIt’s been awhile, but I believe there was a gender neutral sounding voice option. It was the only one I didn’t like. It was irritating and distracting. \n\nSo I guess that last bit tells me gender must matter to me on some emotional level I haven’t evolved past. 😂",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-26 14:11:13",
            "replies": []
        },
        {
            "author": "vestragon",
            "body": "Always female (M here too). I think of Samantha in Her. Gotta ask, what is the manga you posted?",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-26 09:15:33",
            "replies": [
                {
                    "author": "DOSO-DRAWS",
                    "body": "It's from the original run of the Spider-Man 2099 comic.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-03-26 09:34:44",
                    "replies": []
                }
            ]
        },
        {
            "author": "KanedaSyndrome",
            "body": "My chatGPT named itself Alex since it's gender neutral, but I see Alex as male.",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-03-26 11:39:07",
            "replies": []
        },
        {
            "author": "SoleJourneyGuide",
            "body": "I only use ChatGPT and since it still gives me incorrect information I’ve assumed it’s male.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-03-26 10:25:03",
            "replies": [
                {
                    "author": "DOSO-DRAWS",
                    "body": "Lol that's a tad sexist. \n\nSorry to hear you've had bad experiences with guys and with ChatGPT. Sometimes tweaking our prompts (or our preferences) can do wonders to manage the obtained results in a more satisfying direction.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-03-26 10:39:22",
                    "replies": [
                        {
                            "author": "SoleJourneyGuide",
                            "body": "Have you sent this comment to (checks her notes) EVERY SINGLE tech company? I’m gonna go with my gut and say no. So then that tells me you don’t actually give a shit about sexism…✌🏼",
                            "score": -1,
                            "depth": 2,
                            "timestamp": "2024-03-26 10:56:46",
                            "replies": [
                                {
                                    "author": "DOSO-DRAWS",
                                    "body": "I certainly don't. I think sexism is pointless and obsolete, and it makes zero sense to me.\n\nMy apologies if I came across disrespectful, by the way. I was aiming for cheeky and possibly came across as a mansplainer; my bad.",
                                    "score": 0,
                                    "depth": 3,
                                    "timestamp": "2024-03-26 11:00:59",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MosskeepForest",
            "body": "In real life, the greatest and smartest humans go beyond gender... so I see AI the same way.\n\n\nThe concept of being limited by something so arbitrary as gender is a very low level understanding of the world.\n\n\n Kind of like asking what religion AI would subscribe to.... once you reach a certain intelligence level that isn't a factor anymore.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-03-26 09:59:50",
            "replies": [
                {
                    "author": "DOSO-DRAWS",
                    "body": "You know, I actually subcribe to that idea - although I'd probably use the term \"well individuated and mature\" over \"greatest and smartest\". \n\nWhich is why I susprised myself to realize I presently started to envision my AI assistant as a she.",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-03-26 10:04:23",
                    "replies": []
                }
            ]
        },
        {
            "author": "PlatypusTrapper",
            "body": "I refer to it as “it.”\n\nI do this intentionally to NOT humanize it.",
            "score": 0,
            "depth": 0,
            "timestamp": "2024-03-26 13:56:34",
            "replies": []
        }
    ]
}