{
    "post_title": "Thoughts about gender bias in voice assistants?",
    "post_timestamp": "2023-04-20 00:15:55",
    "last_comment_timestamp": "2023-04-21 14:49:14",
    "time_difference": "1 day, 14:33:19",
    "comments": [
        {
            "author": "theHuskylovee",
            "body": "I change it to the one that sounds most gender neutral. I honestly don't really see the problem with how voice assistants are right now, or at least I don't with the Google assistant, which I use. What problem are you seeing?",
            "score": 3,
            "depth": 0,
            "timestamp": "2023-04-20 09:03:33",
            "replies": [
                {
                    "author": "Legitimate-Section31",
                    "body": "This sounds interesting, I never knew that they offered gender-neutral voice options. Please elaborate on your experiences with changing it, has it positively changed your experiences with Google assistant, and have you incorporated it into your daily routine since then? \n\nAnd yeah, I should've been more careful with my wording - I don't really see it as a problem either but it's just this ongoing discourse that has been bought up frequently, especially right now with the emergence of AI chatbots (Snapchat's new AI feature). I appreciate your input about this though, thanks!",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-04-21 14:33:39",
                    "replies": [
                        {
                            "author": "theHuskylovee",
                            "body": "I changed it to the most gender neutral option just because I wanted to. There wasn't any reason behind it. It hasn't changed my experience with it at all. I would use it the same no matter what voice I set it to.",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2023-04-21 14:49:14",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "What is your journalism project through.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-20 01:51:15",
            "replies": [
                {
                    "author": "Shiny_cats",
                    "body": "Didn’t they explain in the post?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-04-20 17:39:54",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "No, they just say they're doing a journalism project. I didn't ask what it's about or what it's *on*. I asked what it's through. Maybe that was a poor/confusing way to ask-- but I meant who is it through. A newspaper? Class for school? Are they an undergraduate student? Is it for an organization? A personal blog? A research project/in grad school (probably not since that would require IRB)? An exploratory state before starting a full research project? \n\nWhat/ who is the journalism project through?",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2023-04-20 19:58:59",
                            "replies": [
                                {
                                    "author": "Shiny_cats",
                                    "body": "Oh, alright. Sorry for the confusion!",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2023-04-21 10:20:09",
                                    "replies": [
                                        {
                                            "author": "Deleted",
                                            "body": "No problem! I asked them because I think it's important who we are sharing information/thoughts/opinions to when people come to us for our input. \n\nOP-- as a responsible journalist--should (if they don't want to use their personal account and announce who they are) have an account they can use to tell us who they are who they're working with, and provide some proof of that when asking people for input. \n\nEven though this is all public either way and bad people can come get the information as long as it's public. I just think it's important we question motives and where we are sharing this info to so that we don't spoon feed bad people with content quite as readily.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2023-04-21 13:02:39",
                                            "replies": [
                                                {
                                                    "author": "Legitimate-Section31",
                                                    "body": "Hi, I definitely agree with you - I should've specified this in the post, thank you for bringing it up! I'm an undergraduate journalism student and I'm just facilitating an open discussion surrounding gender bias in voice assistants. I thought it would be an excellent start to begin on Reddit so I could corral people's thoughts on this topic and then I'll take it on from there!",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2023-04-21 14:26:43",
                                                    "replies": [
                                                        {
                                                            "author": "Deleted",
                                                            "body": "Thank you for providing some context!",
                                                            "score": 2,
                                                            "depth": 6,
                                                            "timestamp": "2023-04-21 14:44:32",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Skillaholix",
            "body": "Hmm interesting, in short to answer your question I typically leave it at its default, I've played with the different voices and everywhere I have secondary voices usually aren't as pleasant or comprehensible as the default female voice.\n\n\nLONGER ANSWER: honestly never thought about it in a gender bias context, always assumed it had something to do with several factors like the female voice typically being clearer due to the lack of bass, possibly easier to modulate\n\n(voice assistants mainly came into play with telephone companies and banking institutions at a time when the speakers in phones struggled to produce much in the lower frequencies, and before they were recordings of real people they were modulated frequencies)\n\nthe female voice, but to speak to your idea of the possibility of gender bias, the female voice is typically perceived as more helpful than authoritative or intimidating and typically more calming than a male voice in a marketing sense these all make sense, people typically learn and function better when the environment isn't seen as hostile or involving the possibility of negative consequences. \n\nSo I guess depending on how you view gender bias who is the bias for and against in such a scenario? \n\nIs it biased towards females because that's the majority of voice assistants and against males because that's the minority? Or is it biased against females because of the patriarchal stereotypes of the way women are viewed in society and carried over in marketing?\n\nYou can see those same ideas present in different types of marketing media, want to sell a product and target the ideas of luxury, convenience and sex appeal? Have a female present it, want to sell a product and target the ideas of rugged, strong, and long lasting have a male present it. \n\nWant to teach kindness, humility, and acceptance in a workplace have a female present it, want to teach a safety topic that involves life or death for manual laborers, have a male present it. \n\nIndeed it seems you have a ton of research to do to report for or against the idea of gender bias in voice assistants. Let us know what you come up with, its definitely an interesting thought.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-20 09:13:17",
            "replies": []
        },
        {
            "author": "WhatTreeSaid",
            "body": "I never heard of this as a problem. I wasn't aware Alexa had pronouns, and I'm not sure how you determine a gender by a voice pitch.\n\nWith that said, I generally keep the default voice, and refer to the higher tones as if the a.i. were female.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-20 09:18:34",
            "replies": [
                {
                    "author": "Shiny_cats",
                    "body": "I think it’s because deeper voices in biological men tend to be because of the abundance of testosterone that affects the pitch of speech, so deeper pitches in fake voices are still associated with this.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2023-04-20 17:42:00",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "the default being feminine voice because historically & socially women & gender minorities have been & continue to be placed in servant roles as secretaries, housekeepers, party planners, sex workers, receptionist, etc.*\na feminine virtual assistant perpetuates the objectification of feminine bodies, reducing this feminine voice to a slave robot that is at your service and cannot retaliate to any harassment the user may inflict.\ntech companies understand the subconscious social implications of branding virtual assistants as feminine.\nassigning a feminine personality to an object & service that can be bought also triggers an emotional response in men who are deprived of physical & emotional closeness in contemporary society.\nas the heteronormative agenda promotes women being the catch-all emotional supporters & physical fulfillers of men’s needs, an iphone providing the world at your fingertips would be gendered feminine because this product promises to fulfill these needs & desires of the customer.\nultimately, big tech & most other big business targets white men as their customer base, who make the most money compared to any other demographic in the US.\n\n\ni changed my siri voice to aussie masc to undo the aforementioned perpetuation, although i don’t use siri; they just kick in while using maps.\n\n\n*(all of these are respectable & honest jobs & just a way to survive capitalism)",
            "score": 0,
            "depth": 0,
            "timestamp": "2023-04-20 14:56:26",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "So an interesting experiment that the fire dept did in a new building I worked in a few years back- and they had one of those “talking” alarm systems that gave instructions. The more masculine voice was really hard to hear over the noise of people evacuating- a bass voice doesn’t stand out very well over the clopping of a few hundred people down a steel staircase. Everyone agreed the female voice was easier to hear and discern. I wonder if a female voice assistant is easier to hear over household ambient noise like AC, washing machine, etc.",
            "score": 1,
            "depth": 0,
            "timestamp": "2023-04-20 11:02:11",
            "replies": []
        }
    ]
}