{
    "post_title": "Working dataannotation full time?",
    "post_timestamp": "2024-01-07 12:45:29",
    "last_comment_timestamp": "2024-06-28 00:25:10",
    "time_difference": "172 days, 11:39:41",
    "comments": [
        {
            "author": "Onlyanoption",
            "body": "I would not recommend this.  It’s too inconsistent, and remember that taxes are not calculated so you have to take that into account.\n\nI also find I can’t do more than 5 hours a day because it is mentally exhausting and my work declines.",
            "score": 67,
            "depth": 0,
            "timestamp": "2024-01-07 12:56:41",
            "replies": [
                {
                    "author": "samthemantha99",
                    "body": "Thank you! I've done a few full days of it (6-8 hours) and agree it's exhausting, but I wasn't sure if it would maintain consistency or not.",
                    "score": 10,
                    "depth": 1,
                    "timestamp": "2024-01-07 12:58:17",
                    "replies": [
                        {
                            "author": "InevitableOk7205",
                            "body": "I would personally think of it as overtime or bonus income. I had the same thought as you when I first got into the higher paying tasks. As the person above said, best to not rely on this sort of gig work, the pay is great but in exchange you don't get the stability of a normal job.\n\nI got started with DA when my workplace cut overtime heavily, now I can turn my nose up at it as even at time and a half from my boss  some DA projects can pay me more for my spare time than my employer can.\n\nAlso some advice if I may, in time you may get varying projects requiring different skills or workflows. Some more creative, some more analytical or research based. I personally find I can work for longer by jumping between these different kinds of projects as and when my mood strikes.",
                            "score": 8,
                            "depth": 2,
                            "timestamp": "2024-01-08 05:55:53",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sk8r2000",
            "body": "If and only if you are confident that you could quickly find and start at a job similar to your old one, or get by without a job for a while. Online contracting work can be fickle.",
            "score": 18,
            "depth": 0,
            "timestamp": "2024-01-07 13:01:59",
            "replies": [
                {
                    "author": "samthemantha99",
                    "body": "Thank you! I'm currently in the pursuit of a higher, more legitimate position but having no luck, but this has been insightful.",
                    "score": 4,
                    "depth": 1,
                    "timestamp": "2024-01-07 13:13:15",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 42,
            "depth": 0,
            "timestamp": "2024-01-07 13:21:10",
            "replies": [
                {
                    "author": "samthemantha99",
                    "body": "My current position is also remote with no social stimulation, so I wouldn't really be losing that aspect, but it's nice to know your experience working full time with this company.",
                    "score": 9,
                    "depth": 1,
                    "timestamp": "2024-01-07 13:23:59",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "Also, it’s not completely reliable, for instance, presently almost everyone is either receiving no tasks or very few...just something to think about. But, good luck my friend.",
                            "score": 3,
                            "depth": 2,
                            "timestamp": "2024-01-09 00:29:02",
                            "replies": [
                                {
                                    "author": "Own-Ad-3876",
                                    "body": "So sometimes there is unlimited work and sometimes there aren’t enough work to keep you busy? Is that correct?",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2024-06-28 00:25:10",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "inthemoneywwww",
                            "body": "What’s your current position and what’s stopping you from grinding both out for now and saving",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-01-08 02:17:10",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Boomland",
            "body": "I've been doing this full time pretty much since August. There's plenty of work, but there's zero guarantee that it will be around in 6 months even if you continue to do well. So, if you think you can get something in case opportunities fade away, I'd say go for it. Maybe you can even move to part time at your current job to keep a foot in the door.",
            "score": 14,
            "depth": 0,
            "timestamp": "2024-01-07 21:46:30",
            "replies": []
        },
        {
            "author": "SaYuOwn",
            "body": "I've been doing DA full time (70hr weeks) for about 8 months now. It's been pretty good to me, but I have 2 other sources of income so I'm not totally reliant on this.",
            "score": 13,
            "depth": 0,
            "timestamp": "2024-01-07 14:05:07",
            "replies": [
                {
                    "author": "w8sand8s",
                    "body": "How do you do 70 hrs? Are you other two sources also jobs?",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-01-11 14:04:14",
                    "replies": [
                        {
                            "author": "SaYuOwn",
                            "body": "10hrs everyday, and yes.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-01-11 22:03:02",
                            "replies": [
                                {
                                    "author": "Lucfer_9",
                                    "body": "Damn man, u must be making BANK",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2024-01-17 19:56:32",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "elmes3",
            "body": "Don't do it. As others have mentioned it is exhausting at the rate you need to do it to make a living. There is no guarantee it will be there for any length of time. It does not have any benefits like health care, retirement, sick days, time off, etc. I have been doing a mix of DA doordashing and working at a bar for the past two months while I have been on the job market. It's been relatively easy and I have enjoyed it and it has been a lifesaver in this situation but it just is not sustainable because you can't really take any time off without really taking a financial hit. I got offered a full time position in my field last week and took it in a heartbeat just to have some stability.",
            "score": 9,
            "depth": 0,
            "timestamp": "2024-01-07 18:46:41",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 9,
            "depth": 0,
            "timestamp": "2024-01-07 16:08:32",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "Why are taxes higher for a contractor?",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-01-07 23:50:52",
                    "replies": [
                        {
                            "author": "darriage",
                            "body": "Cause you are paying the taxes of an employee and an employer",
                            "score": 1,
                            "depth": 2,
                            "timestamp": "2024-01-12 15:09:55",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "iamaweirdguy",
            "body": "I do 30-40 hours a week on top of my W2 job. I actually make more money on DA, but I wouldn’t consider leaving my normal job.",
            "score": 9,
            "depth": 0,
            "timestamp": "2024-01-07 13:53:34",
            "replies": []
        },
        {
            "author": "twihard222",
            "body": "SAHM and this is my only income. I do 3ish hours a day seven days a week. Would not want to do this full time because it’s mentally exhausting",
            "score": 8,
            "depth": 0,
            "timestamp": "2024-01-07 22:32:42",
            "replies": [
                {
                    "author": "Outrageous-Quote-591",
                    "body": "let me have yours I can do 70hrs a week",
                    "score": 0,
                    "depth": 1,
                    "timestamp": "2024-01-11 14:47:21",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "I've been using my income from DA as a replacement for my full time job income while on maternity leave. I am planning on using it to bridge the gap while I look for childcare so I can return to working full time, because at the moment I have no options for childcare for either of my children. My partner just got accepted by DA and is also using it to replace the income he had at a full time job, but we are both well aware that he may have to return to the workforce if DA doesn't pan out.",
            "score": 8,
            "depth": 0,
            "timestamp": "2024-01-07 14:05:05",
            "replies": []
        },
        {
            "author": "MF_Belvedere",
            "body": "It has already been said, but I will repeat it: don't quit your day job. I had lots of projects for the first month or so, then nothing for over a month. No explanation and no indication of when or if I would get work again. It's a great way to supplement your income, or make money if you need to be home to care for children etc. But as a contractor you are disposable.",
            "score": 6,
            "depth": 0,
            "timestamp": "2024-01-08 11:23:01",
            "replies": []
        },
        {
            "author": "halieschu94",
            "body": "I have no other option at the moment so for the time being this is my sole source of income. It is good enough for NOW but I wouldn’t recommend relying only on DA for the long term, just because nothing is guaranteed. It’s absolutely wonderful as an additional source of income or to get you through a tough spot between other jobs.",
            "score": 10,
            "depth": 0,
            "timestamp": "2024-01-07 16:47:28",
            "replies": []
        },
        {
            "author": "feta_salad",
            "body": "Following this thread as I'm in the same situation: I'm currently traveling and using DA as my only source of income but I'm also worried about the work drying up and being left with nothing. Takeaway from this thread is that I might need to get a part-time job on the side",
            "score": 3,
            "depth": 0,
            "timestamp": "2024-01-07 22:46:42",
            "replies": []
        },
        {
            "author": "Dangerous_Darling",
            "body": "Don't quit your day job. I've been with them for 3 years and before the chatbot stuff there was not this volume of work. It will eventually go away leaving these full timers with no money. I do only part time. Always have. Mostly it used to be pay per task and it was low pay. I'm just enjoying while it lasts.",
            "score": 5,
            "depth": 0,
            "timestamp": "2024-01-08 09:22:42",
            "replies": [
                {
                    "author": "Nebloescobar",
                    "body": "If you don’t mind me asking, what was the volume of work like prior? Would appreciate your insight.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2024-01-08 22:53:42",
                    "replies": [
                        {
                            "author": "Dangerous_Darling",
                            "body": "It was all pay per task, at least the stuff I did was. There was a lot when they had certain contracts, but there were times when it wasn't that much. I started making so much more money when they started with the AI stuff and it became pretty regular. I used to work prolific also to get some extra cash. I truly was doing it for a little spending money. Now I can make enough to pay off debt due to the pay and the volume.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-01-15 18:18:01",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deleted",
                    "body": "[deleted]",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2024-01-17 15:07:01",
                    "replies": [
                        {
                            "author": "Deleted",
                            "body": "[deleted]",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2024-01-17 20:49:09",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PutDisastrous8033",
            "body": "My husband and I both do this part time as our only income. We live in a more rural area where jobs pay half what DA pays per hour, and we homeschool our son so it gives us the flexibility we need. But I also have a side business and he could go back to Instacart whenever he wants so it’s not a huge risk to us if it doesn’t work out. Majorly inconvenient but not life shattering. I also have other websites I’m on like remotasks if I need the option too but I haven’t been on there for most of the past year",
            "score": 2,
            "depth": 0,
            "timestamp": "2024-01-10 20:22:57",
            "replies": []
        },
        {
            "author": "Deleted",
            "body": "[deleted]",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-01-07 13:09:09",
            "replies": [
                {
                    "author": "Deleted",
                    "body": "by that definition, a part time job wouldn't be a real job?",
                    "score": 7,
                    "depth": 1,
                    "timestamp": "2024-01-07 13:19:23",
                    "replies": [
                        {
                            "author": "pipipcheerios",
                            "body": "A part time job is a part time job, not a real job.",
                            "score": -13,
                            "depth": 2,
                            "timestamp": "2024-01-07 14:13:33",
                            "replies": [
                                {
                                    "author": "JazziMari",
                                    "body": "A real job is any job that gives you money that you need. Some people fulfill that with a part time job, some with a full time job. Some people work a W2 job, some people work contract jobs. It is elitist and rude to downgrade what people do to pay their bills. It’s the same as people who say bartenders or waitresses don’t have “real jobs”. Are you making money legally? Then it’s a real job.",
                                    "score": 12,
                                    "depth": 3,
                                    "timestamp": "2024-01-07 15:21:48",
                                    "replies": [
                                        {
                                            "author": "pipipcheerios",
                                            "body": "I disagree. I don’t consider people working part time jobs to have real jobs. You can believe whatever you want.",
                                            "score": -20,
                                            "depth": 4,
                                            "timestamp": "2024-01-07 15:24:53",
                                            "replies": [
                                                {
                                                    "author": "JazziMari",
                                                    "body": "Again, a part-time job is a real job. The people working them are not receiving fake money. The definition is of a job is something you do to make money.",
                                                    "score": 6,
                                                    "depth": 5,
                                                    "timestamp": "2024-01-07 15:38:09",
                                                    "replies": [
                                                        {
                                                            "author": "pipipcheerios",
                                                            "body": "OK. Again, I don't consider a part time job a real job. You can believe whatever you want.",
                                                            "score": -15,
                                                            "depth": 6,
                                                            "timestamp": "2024-01-07 15:40:30",
                                                            "replies": [
                                                                {
                                                                    "author": "JazziMari",
                                                                    "body": "This isn’t really something that you can believe or not believe. Part-time jobs are not fake, they exist, and they give money which by definition makes them “real” jobs.",
                                                                    "score": 8,
                                                                    "depth": 7,
                                                                    "timestamp": "2024-01-07 15:45:52",
                                                                    "replies": [
                                                                        {
                                                                            "author": "pipipcheerios",
                                                                            "body": ">OK. Again, I don't consider a part time job a real job. You can believe whatever you want.",
                                                                            "score": -11,
                                                                            "depth": 8,
                                                                            "timestamp": "2024-01-07 15:48:23",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "mrsgreens",
                                                                                    "body": "You will when you have to get one.",
                                                                                    "score": 2,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2024-01-08 02:09:19",
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "pipipcheerios",
                                                                                            "body": "I've been in the same corporate position for 15 years. I wouldn't consider any job without a salary, bonus, health insurance, dental insurance, life insurance, PTO, holidays, stock options etc to be a real job. Best of luck!",
                                                                                            "score": 1,
                                                                                            "depth": 10,
                                                                                            "timestamp": "2024-01-08 15:38:19",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "samthemantha99",
                    "body": "That was something I forgot to mention in the original post, but I'm at an age where I'm still on my parents insurance and don't rely on my current employer's benefits, but it is definitely something to consider. Thanks!",
                    "score": 5,
                    "depth": 1,
                    "timestamp": "2024-01-07 13:12:30",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deleted",
            "body": "It's currently my primary source but I am always waiting for the other shoe to drop. I'm using the time to get through school and get some income streams going on the side, hoping I can finally work my way to entrepreneurship. It's definitely hit or miss for most and if you have the option for a FT job that's more secure, that would be safer. \n\nI'm a homeschool mom and have always worked non traditional jobs due to my neurodivergences and personal preferences, though, so this is perfect for me and I have some backup savings to get situated in other less desirable jobs if I have to :p",
            "score": 1,
            "depth": 0,
            "timestamp": "2024-01-21 02:57:55",
            "replies": []
        }
    ]
}