{
    "post_title": "AI could affect 40% of jobs and widen inequality between nations, UN warns - Artificial intelligence is projected to reach $4.8 trillion in market value by 2033, roughly equating to the size of Germany’s economy, the U.N. Trade and Development agency said in a report.",
    "post_timestamp": "2025-04-06 18:53:54",
    "last_comment_timestamp": "2025-04-12 13:40:21",
    "time_difference": "5 days, 18:46:27",
    "comments": [
        {
            "author": "FuturologyBot",
            "body": "The following submission statement was provided by /u/Gari_305:\n\n---\n\nFrom the article\n\nArtificial intelligence is projected to reach $4.8 trillion in market value by 2033, but the technology’s benefits remain highly concentrated, according to the U.N. Trade and Development agency.\n\nIn a [report](https://unctad.org/press-material/ais-48-trillion-future-un-trade-and-development-alerts-divides-urges-action) released on Thursday, UNCTAD said the AI market cap would roughly equate to the size of Germany’s economy, with the technology offering productivity gains and driving digital transformation. \n\nHowever, the agency also raised concerns about automation and job displacement, warning that AI could affect 40% of jobs worldwide. On top of that, AI is not inherently inclusive, meaning the economic gains from the tech remain “highly concentrated,” the report added. \n\n“The benefits of AI-driven automation often favour capital over labour, which could widen inequality and reduce the competitive advantage of low-cost labour in developing economies,” it said. \n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/Futurology/comments/1jt6t5u/ai_could_affect_40_of_jobs_and_widen_inequality/mlrxaan/",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-06 19:29:54",
            "replies": []
        },
        {
            "author": "BlueHym",
            "body": "Everyone is so bright eyed on seeing the potential of AI but nobody has come up with solutions on the people being displaced by AI. This is not a situation where someone simply jumps to a different field, because AI is displacing so many people from different fields simultaneously. \n\nHow do we help the people who get displaced by this?",
            "score": 39,
            "depth": 0,
            "timestamp": "2025-04-07 00:42:18",
            "replies": [
                {
                    "author": "DerekVanGorder",
                    "body": "You might be interested in Calibrated Basic Income. It's a policy proposal where a UBI is adjusted higher whenever the economy gets more productive / requires less labor.\n\nBy calibrating the UBI payout, we can not only prevent inflation, we can maximize econonic benefit to the average person while also maximizing leisure-time.\n\nToday, because our economy lacks a UBI we generally have to rely on wages and jobs in order to fund consumer spending. This has an unfortunate side-effect: we are forced to create jobs / boost employment for the purpose of distributing income---which is not the same thing as creating jobs because those jobs are actually needed by our economy.\n\nIn other words: due to the absnece of UBI, macroeconomic policymakers are forced to rely on job-creation policies to support aggregate consumer spending instead. This wastes resources and it wastes human time.\n\nAI or no AI, we very likely could already be enjoying much more production for much less employment; but the lack of a UBI from our monetary system actively prevents this desirable outcome.\n\nFor more informaiton, you can read my new working paper on the subject:\n\n[https://www.greshm.org/files/2025-04-01-calibrated-basic-income.pdf](https://www.greshm.org/files/2025-04-01-calibrated-basic-income.pdf)",
                    "score": 10,
                    "depth": 1,
                    "timestamp": "2025-04-07 12:20:09",
                    "replies": [
                        {
                            "author": "KanedaSyndrome",
                            "body": "Need to solve the need for social mobility. UBI locks people into an UBI socioeconomic class which will be the lowest socioeconomic class that there is",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-04-08 02:02:57",
                            "replies": [
                                {
                                    "author": "DerekVanGorder",
                                    "body": "UBI does not necessarily improve social mobility, you are correct.\n\nWhat it improves are consumer outcomes. It also provides the benefit of freeing people from the need to work, i.e. from the need to care about climbing to a higher \"class\" through labor.\n\nIf your goal is to make everyone a harder worker, and to provide more earning opportunities, UBI probably doesn't make sense.\n\nThat's not the purpose of basic income, however. The purpose of a calibrated UBI is to maximize wealth and leisure for the average person---irrespective of whether or not they are employed.\n\nQuite possibly, the optimal rate of UBI will be much higher than the average wage is today. It's also possible to imagine a world where the vast majority of people live on an ample, continually rising UBI, and only a minority of the population are employed at all.\n\nIn that world, the majority of people all live on exactly the same income: the UBI. This UBI has no reason to be limited to a \"bare subsistence\" level; it can be set as high as possible. In this scenario, whoever chooses not to work is simulatneously richer than the average person is today, but also, technically, the poorest people in their society.\n\nThey also will get richer anytime the economy itself (all of our machines, infrastructure, etc.) get more efficient and productive.\n\nIn this way, a calibrated UBI complicates the concept of \"socioeconomic class\" as we are used to thinking about it. An advantage of UBI policy is that it doesn't require anyone to be upwardly mobile in a \\*job market\\* in order for their income / purchasing power to increase.\n\nThere will always be some people who are richer than others. What UBI does is make the poorest people as rich as possible; and it gives the average person more freedom to refuse paid work if they choose.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-08 16:53:15",
                                    "replies": [
                                        {
                                            "author": "KanedaSyndrome",
                                            "body": "I mean, it could work, but I think human nature will put a wrench in that system.",
                                            "score": 1,
                                            "depth": 4,
                                            "timestamp": "2025-04-09 01:23:25",
                                            "replies": [
                                                {
                                                    "author": "DerekVanGorder",
                                                    "body": "Human nature doesn't put a wrench in money, so I'm not sure why it would for a UBI. UBI is just money, more efficiently distribuetd than it is at present.",
                                                    "score": 1,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-09 09:47:57",
                                                    "replies": [
                                                        {
                                                            "author": "KanedaSyndrome",
                                                            "body": "What I meant is, why would people be given UBI if they don't provide value? That's where I think human nature will let us down. The owning class has no monetary incentive to pay UBI to people.",
                                                            "score": 1,
                                                            "depth": 6,
                                                            "timestamp": "2025-04-09 10:00:34",
                                                            "replies": [
                                                                {
                                                                    "author": "DerekVanGorder",
                                                                    "body": "I'm not sure who exactly you have in mind by \"the owning class.\"\n\nThe administers of UBI will be a select number of policymakers at currency-managing institutions (central banks and governments, most likely).\n\nWhether there is a UBI or not is not really up to business owners, as individuals or as a group. Business owners, like consumers, operate within the context of the monetary system that is provided to them.\n\nI will say that business owners do have a meaningful financial reason to support UBI, in that it will provide their customers with more spending money.",
                                                                    "score": 1,
                                                                    "depth": 7,
                                                                    "timestamp": "2025-04-09 10:10:07",
                                                                    "replies": [
                                                                        {
                                                                            "author": "KanedaSyndrome",
                                                                            "body": "UBI will most likely be funded via company taxes - companies will probably relocate to nations without AI company taxes which leads to less UBI funding. Of course there's the chance everything goes smooth, I just don't think it will though",
                                                                            "score": 1,
                                                                            "depth": 8,
                                                                            "timestamp": "2025-04-09 10:33:28",
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DerekVanGorder",
                                                                                    "body": "I don't think it's accurate to posit that a UBI can be funded by taxes.\n\nI model UBI as an alternative to expansionary monetary policy (what central banks do today).\n\nBy implementing a UBI financed through public debt, a government can allow the central bank to expand private sector debt less aggressively than before.\n\nIn other words, UBI is simply an alternative way of supplying markets with spending money. Instead of letting central banks stimulate the private financial sector to support spending with lending and borrowing, a government may choose to support spending directly through consumer income (i.e. a UBI) instead.\n\nThe problem with taxing companies is, like you say, you discourage domestic produciton. This reduces the ceilling on UBI policy. Counterintuively: the more we tax the economy, the less UBI we can afford.",
                                                                                    "score": 1,
                                                                                    "depth": 9,
                                                                                    "timestamp": "2025-04-09 10:39:53",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Downtown_Skill",
                                    "body": "To be honest, I'm already in one of the lowest social classes. If I had UBI I'd be able to focus on building even more credentials and acquiring more training in different fields based on demand and interest.\n\n\nInstead I'm stuck working dead end jobs that provide very little in terms of professional development because I need that money to survive. I dont have the time or rescources to really invest in further training in the way I need. UBI may not give me all the financial rescources I need but it would give me the time I need.",
                                    "score": 1,
                                    "depth": 3,
                                    "timestamp": "2025-04-08 11:23:42",
                                    "replies": [
                                        {
                                            "author": "KanedaSyndrome",
                                            "body": "The day we get UBI there is no amount of training that will get you a job. That's part of my point",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2025-04-08 16:19:52",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Secure_Enthusiasm354",
                    "body": "That's the thing: there are no solutions as of today. Using the US as an example, they seek to develop AI without any sort of contingency plan for the economy. Politicians and corporate leaders believe that by incorporating AI for mundane tasks that could easily be done by automation, people would not have to worry about doing such jobs and assume they can easily find jobs elsewhere. This is what we get when the wealthy decides AI is the answer to deepen their pockets, hoping that people can get employment elsewhere to have income and buy their products\n\nI am not against AI automation, however if it were up to me, I say we are not ready for AI automation just yet. The economy is in shambles, people sitting in positions they are not qualified for, and younger generations cannot get jobs. AI defenders will argue that AI would create new jobs, but what they fail to understand is that getting a career change or new job is not as easy as changing clothes\n\nNot related, but watching this video helped me gain a perspective on what nations should be focusing on before doing anything like putting automation to work: [https://youtu.be/Ufmu1WD2TSk?feature=shared](https://youtu.be/Ufmu1WD2TSk?feature=shared)",
                    "score": 15,
                    "depth": 1,
                    "timestamp": "2025-04-07 01:31:08",
                    "replies": [
                        {
                            "author": "BlueHym",
                            "body": "Kurzgesagt, great choice.\n\nMy personal belief is that with AI being forced into all sectors, the economy itself needs a complete overhaul or paradigm shift. Supply and demand becomes shaky when only a very select few out of the vast majority is able to purchase the goods or services. The very concept of a job or role that people do in their respective field needs to be completely rethought as well. It is odd to see that we are still clinging onto the current economics as the norm when we are dealing with a new breakthrough that is upending the labor force. One thing does bug me though - how would AI generate revenue in a sense?",
                            "score": 5,
                            "depth": 2,
                            "timestamp": "2025-04-07 03:54:18",
                            "replies": [
                                {
                                    "author": "Secure_Enthusiasm354",
                                    "body": "I also have that question in my mind and is still unanswered. To me, automation is a method to speed up a labor process which enables distributing the budget towards other areas that need the funding (which should be what’s happening but in most cases  I doubt it), but it would not mean it generates revenue. For a company to generate them, they have to manage to sell products, because as we both know, money comes from the consumer",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-04-07 10:34:55",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DerekVanGorder",
                            "body": "The economy is not \"ready\" for new technology only insofar as our monetary system lacks a UBI.\n\nWith a UBI in place, new technology could result in higher spending power alongside *less* employment. Markets could freely unemploy more workers without harming the average consumer; we could all enjoy more purchasing power and more free time.\n\nWithout a UBI this desirable outcome is impossible; we end up either forced to create jobs as an excuse to distribute incomes---wasting resources and wasting human time---or we have to fret about people falling into poverty just because somebody invented a new machine.\n\nInstead of trying to delay new technology from getting invented because we're worried about losing jobs, it makes more sense to fix our broken monetary system so people never become arbitrarily poor in the first place.",
                            "score": 2,
                            "depth": 2,
                            "timestamp": "2025-04-07 12:42:26",
                            "replies": []
                        },
                        {
                            "author": "Psittacula2",
                            "body": "I think it potentially solves a myriad of problems however:\n\n1. AI replaces human labour = Reduce human energy consumption globally, albeit AI will require a lot of energy still total energy comes down.\n\n2. Profits from AI fed back into redistribution more equitably resolving wealth disparities and equalize resource and energy use from using lower less polluting levels.\n\n3. Reduced speed of economies and consumerism is also beneficial both for the planet and for human health ie 4 day weeks and maybe even 3 day with UBI eventually.\n\n4. Reorientation of societies towards more co-operation, more humane concepts of “work”. Etc\n\nDepends on speed and spread and depth of AI acceleration and penetration rates however.",
                            "score": -5,
                            "depth": 2,
                            "timestamp": "2025-04-07 03:43:30",
                            "replies": [
                                {
                                    "author": "SilverMedal4Life",
                                    "body": "I admire your optimism here. I just can't see how the current techbro oligarchs in power would do anything like that.",
                                    "score": 9,
                                    "depth": 3,
                                    "timestamp": "2025-04-07 04:31:13",
                                    "replies": [
                                        {
                                            "author": "StainlessPanIsBest",
                                            "body": "The bankbro oligarchs tell them they need to.\n\nThe bankbros have way more fucking power than the techbros.",
                                            "score": 2,
                                            "depth": 4,
                                            "timestamp": "2025-04-07 10:53:53",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Secure_Enthusiasm354",
                                    "body": "I’m sorry, but this looks like a ChatGPT response in the way it’s formatted and feels disingenuous given by how it actually didn’t address the concern in my post. I personally find this insulting, so I have questions\n\nHow is point 1 helping if that IS the primary concern OP is addressing?\n\nHow is point 2 “resolving” wealth disparities? This was also unexplained\n\nPoint 3: beneficial to the planet itself? What do you mean by this? I think I get human health as it would mean less hours, but the reality is people need hours due to rising costs of living and that includes basic necessities like food and water. That was part of why I brought up the video. To resolve the issues is to begin at the economy. Speaking of the economy, when was the last time a Republican mentioned anything about UBI, much less [advocated](https://www.pewresearch.org/short-reads/2020/08/19/more-americans-oppose-than-favor-the-government-providing-a-universal-basic-income-for-all-adult-citizens/) for it? I swear, I have seen countless people mention UBI in this subreddit, but none even think that living in a society where the wealth disparity grows wider and the elite only cares about themselves would mean UBI is not going to even be a thing. Let’s actually be realistic\n\nAnd for point 4: what other work? Where are the new jobs? Again, your response completely ignored my main point and this why I feel your reply was some AI slop generated",
                                    "score": 2,
                                    "depth": 3,
                                    "timestamp": "2025-04-07 10:18:16",
                                    "replies": []
                                },
                                {
                                    "author": "Dramatic_Rush_2698",
                                    "body": "> AI replaces human labour = Reduce human energy consumption globally, albeit AI will require a lot of energy still total energy comes down.\n\n\nThis has never been true. Assuming that the AI economy *doesn't* go the dystopian way of 90% of humanity being unemployed and unnecesary, economic advances always lead to MUCH higher consumption of everything, including energy. E banking didn't reduce fuel consumption by reducing the need banks have for delivery trucks; it increased it by ten fold with bitcoin mining, and if energy was twice as cheap it would had increased it by twenty fold. Advanced economies consume vastly more.\n\n\n> Profits from AI fed back into redistribution more equitably resolving wealth disparities and equalize resource and energy use from using lower less polluting levels.\n\n\nSocieties don't even redistribute profits from gold mined on publicly owned land. These redistribution sci fi societies remain just as theoretical as when Marx wrote about them.\n\n\n> Reduced speed of economies and consumerism is also beneficial both for the planet and for human health ie 4 day weeks and maybe even 3 day with UBI eventually.\n\n\nAgain, barring an unprecedented never before successfull revolution, AI economies will consume orders of magnitude more and have orders of magnitude more wealth inequality. Americans in 2025 don't consume less than in the 18th century because we invented cars that made transport more efficient.\n\n\n> Reorientation of societies towards more co-operation, more humane concepts of “work”. Etc\n\n\nThis just isn't how these dynamics work. At most, huge, overwhelming technological advances *may* or may not move the needle by a little bit.\n\n\nBronze age greece had a higher and more progressive standard of living than the soviet union, despite the latter society being 2500 years more technologically advanced. Archeologists discovered that pre contact tribes in ecuador where healthier and ate better than ecuadorians in the 21st century. The Iphone 6 replacing the Iphone 5 with 15 more megapixels doesn't mean anything to the 900 million Indians whose last president ran on giving every household a indoor toilet; something by the way that Britain achieved centuries ago.",
                                    "score": 4,
                                    "depth": 3,
                                    "timestamp": "2025-04-07 04:45:47",
                                    "replies": [
                                        {
                                            "author": "Psittacula2",
                                            "body": "Well aware of energy transitions end up adding more energy use… as track record.\n\nBut if we consider full energy conversion of resource use/energy use per person globally, I think it is possible and useful to reduce this aka what is used is used more efficiently, less of it for better outcome for humans.\n\nAI will be necessary to coordinate this. At the same time I can easily see civilization itself using more energy with new innovations eg fusion, solar, hydrogen or whatever advances are made. But those might be necessary at higher scale of infrastructures and thus efficient and clean.",
                                            "score": -1,
                                            "depth": 4,
                                            "timestamp": "2025-04-07 04:52:02",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "canofbeermenow",
            "body": "I work at a small meat processing plant that handles the “last mile” of production before it hits your plate. I feel this type of work is fairly immune to any AI interference. That being said, I’d be interested to know how it could be incorporated. Or more so how similar production could be effected. \n\nMy assumption when “they” talk about AI overtake it means coding; IP software, general medical, or even college databases. \n\nIt’d be nice if we had an administration that was focused on transitioning those positions into a more hands on role. If I remember correctly, that was attempted during the Obama era while we were in the recession of ‘08.",
            "score": 11,
            "depth": 0,
            "timestamp": "2025-04-06 19:59:09",
            "replies": [
                {
                    "author": "xian0",
                    "body": "I don't know how you business actually works but it'll be things like real-time route optimisation (traffic, weather, fuel usage etc), efficiencies when it comes to loading, more accurate delivery times, fluctuating inventory/ingredient/supplier mixes, streamlined order processing, well you get the idea.\n\nThere's much more space for advancement with general machine learning AI than specifically LMM AI. In healthcare general ML could give you disease outbreak detection (SVM), new medicine discovery (DNN) etc. while the LMM just gives you something like doctor note transcription. This subreddit is obsessed with \"chatbot somehow learns to reason and does job like human\" but I'd focus more on the general ML side, which has opportunities on the same scale as the widespread usage of electricity and helps us advance rather than being a wholesale replacement. There's more opportunities than people to work on them right now, it seems like enough to keep us busy for centuries even if countries made a huge effort (personalised medicine alone could take up all our time if we let it), if you consider how much a person can get done in a research career and how long a career lasts.",
                    "score": 8,
                    "depth": 1,
                    "timestamp": "2025-04-06 22:13:03",
                    "replies": []
                },
                {
                    "author": "Shadowcam",
                    "body": "Not immune, just longer before they can replace you compared to Jobs primarily involving computers. Humanoid robots are highly demanded, and being worked on as we speak. \nEveryone not in the investor-class is in danger, if not directly, then from increased competition as mass layoffs cause millions to seek out other jobs.",
                    "score": 15,
                    "depth": 1,
                    "timestamp": "2025-04-06 20:48:32",
                    "replies": [
                        {
                            "author": "canofbeermenow",
                            "body": "Luckily for most of us “frontline” workers, human labor is still cheaper than synthetic.",
                            "score": 6,
                            "depth": 2,
                            "timestamp": "2025-04-06 21:15:00",
                            "replies": [
                                {
                                    "author": "halfmeasures611",
                                    "body": "costs are coming down. AI never calls in sick, never needs PTO, never goes on strike, and works 24 hrs a day, 7 days a week. No OSHA issues.",
                                    "score": 16,
                                    "depth": 3,
                                    "timestamp": "2025-04-06 21:42:51",
                                    "replies": [
                                        {
                                            "author": "Auctorion",
                                            "body": "Some of that is true. Robotics aren’t free labour. Machines break, accumulate heat and mechanical stress, have parts that wear out, and all of that happens much quicker if you run them constantly. You can’t beat thermodynamics and entropy just because AI.\n\nSwapping them out like shift workers might be done, but even then there will inevitably be an economic rubric of disposability: like workers, each robot will have a limited shelf life and need replacement. Like any tool. It is likely to end up way much efficient, but how much more has yet to come out in the wash and will change with time and context.",
                                            "score": 4,
                                            "depth": 4,
                                            "timestamp": "2025-04-07 08:25:07",
                                            "replies": []
                                        },
                                        {
                                            "author": "shaneh445",
                                            "body": "This\n\nThey're drooling over the idea of finally having a workforce that doesn't require any type of benefits",
                                            "score": 3,
                                            "depth": 4,
                                            "timestamp": "2025-04-07 08:49:48",
                                            "replies": [
                                                {
                                                    "author": "MetalstepTNG",
                                                    "body": "What the oligarchy doesn't realize, is that these cost-cutting measures only work for so long before they need profit margin growth from somewhere else.\n\n\nEventually, debt needs to be paid back and returns are not infinite. The idea that the economy can always grow year after year was just a scheme to redistribute wealth to the top 1%. We never should have been in this economic system in the first place where we rely on low rates and QE to stimulate growth.\n\n\nHence, why we live in such an idiotic environment that we need *robots* to replace human labor for the wealthy to keep their extravagant lifestyle. Because they can't afford to both pay workers and stay rich.",
                                                    "score": 2,
                                                    "depth": 5,
                                                    "timestamp": "2025-04-08 10:41:15",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "chris8535",
                                    "body": "Yea you go home and have to take care of your own abused body at your own cost but robots still need to be managed by their masters.",
                                    "score": 7,
                                    "depth": 3,
                                    "timestamp": "2025-04-06 22:41:04",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tlst9999",
                    "body": ">I work at a small meat processing plant that handles the “last mile” of production before it hits your plate. I feel this type of work is fairly immune to any AI interference. That being said, I’d be interested to know how it could be incorporated. Or more so how similar production could be effected. My assumption when “they” talk about AI overtake it means coding; IP software, general medical, or even college databases. \n\nAI overtaking also means the a big portion of the labour market will shift towards manual work away from AI. A big influx of people shifting from digital services to manufacturing means your boss can keep your wages low or hire another guy off the street for cheaper.",
                    "score": 3,
                    "depth": 1,
                    "timestamp": "2025-04-07 07:48:04",
                    "replies": []
                },
                {
                    "author": "DisturbedNeo",
                    "body": "If it’s white-collar work, AI can do it.\n\nIf it’s blue-collar work, robots can do it.\n\nBoth fields are advancing rapidly.",
                    "score": 2,
                    "depth": 1,
                    "timestamp": "2025-04-07 03:37:48",
                    "replies": []
                },
                {
                    "author": "Louis6787",
                    "body": "Robotics will grow very fast, once they have got the mobility of a human, it will be easy to integrate with Ai and replace humans in most jobs.",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-07 08:02:57",
                    "replies": []
                }
            ]
        },
        {
            "author": "Pavillian",
            "body": "I think AI is butting heads with our society built on capitalism and our fascination with speed running it. It doesn’t exactly fit. Of course the few will be able to twist it to benefit them and not the working class. Show me AI that can settle the stars and chart the universe. Come on life I dare you to do something different for once and have a little fun while improving humanity and making life better for the people on this floating blue rock. What do you say?",
            "score": 6,
            "depth": 0,
            "timestamp": "2025-04-07 03:07:59",
            "replies": []
        },
        {
            "author": "md25x",
            "body": "In all of my years and experience with manufacturing and production plants all over the country I have my reservations. \n\nA lot of companies can't even be bothered to make even the smallest improvements to their current processes so I have a hard time believing most of them will implement AI in any significant manner any time soon.\n\nThe projections may have some accuracy if we are speaking exclusively on the potential, but realistically I don't see it being this dramatic.",
            "score": 4,
            "depth": 0,
            "timestamp": "2025-04-07 06:28:53",
            "replies": []
        },
        {
            "author": "Kiflaam",
            "body": "of course, anything that increases efficiency reduces manpower and thus reduces jobs and creates more poor people.\n\nEventually, we will have everything running so efficiently it can all be done by a single Australian man.\n\nAt that point, we move to the next phase of civilization: Post Scarcity. It will no longer be an issue of dividing resources based on who pays the most but instead just dividing evenly, fairly, and probably focusing some resources on those that need that resource the most.\n\nLike, if you want more jobs, then just ban tractors. Ban automated manufacturing. Ban anything that reduces the number of people needed for a job and boom, more jobs available. ^(/s)",
            "score": 5,
            "depth": 0,
            "timestamp": "2025-04-06 20:17:09",
            "replies": [
                {
                    "author": "jeremiahthedamned",
                    "body": "i think what the rich will do is force the poor to live on \"bounty worlds\"\n\nsee the novel Tunnel in the Sky",
                    "score": 1,
                    "depth": 1,
                    "timestamp": "2025-04-07 01:33:30",
                    "replies": []
                }
            ]
        },
        {
            "author": "Actual_Honey_Badger",
            "body": "Why are they bitching about AI widening the wealth gap between nations? That's the fucking point to the AI Arms race?",
            "score": 2,
            "depth": 0,
            "timestamp": "2025-04-07 00:45:51",
            "replies": []
        },
        {
            "author": "bigking-s",
            "body": "I wonder who will pay for it or all the things when ai takes all the money",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-07 05:34:35",
            "replies": []
        },
        {
            "author": "coporate",
            "body": "Projections on a speculative bubble. AI is the new shiny thing, once the novelty wears off, more people realize the lack of competency, and the enshitification begins, labour will return just as quickly as it was replaced.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-07 06:37:27",
            "replies": []
        },
        {
            "author": "rovyovan",
            "body": "Yes, but what about all the jobs that will be created to call bullshit on AIs confident mistakes?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-07 08:46:27",
            "replies": []
        },
        {
            "author": "No_Juggernaut4421",
            "body": "\"In its report, UNCTAD makes a number of recommendations to the international community for driving inclusive growth. They include an AI public disclosure mechanism, shared AI infrastructure, the use of open-source AI models and initiatives to share AI knowledge and resources.\"\n\nThis is exactly right, and what makes this article such a good read. The enemy is not AI as a whole, its the framework of exploitation and centralization silicon valley has hoisted upon us. \n\nChina is doing the right thing, they publish their more efficient models, open source and free of charge for anyone in the world to create opportunities for themselves.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-07 09:21:30",
            "replies": []
        },
        {
            "author": "DerekVanGorder",
            "body": "There are two possible responses to technological unemployment.\n\nThe central bank and the government could choose to let employment fall and hand out a universal income; instead of making people earn their money, our monetary institutions could decide to provide incomes directly to consumers. In other words, we could financially enable leisure time.\n\nThe other option? We could choose to create more jobs *anyway;* rather than pursue maximum leisure time or maximum efficiency, we could adopt a goal of *maximum employment.*\n\nOur society has, for centuries, picked the latter option. We use something called \"expansionary monetary policy\" to stimualte more lending and borrowing, in effect subsidizing the financial sector until the aggregate level of employment is as high as possible.\n\nIn other words: we already live in a post-automation economy---we just don't realize it because we've been too busy filling up that economy with useless jobs.\n\nIn our society, workers try to show off how hard they can work, business owners brag about how many jobs they create, and central bankers \"reassure\" the public that they'll do whatever it takes to keep employment high. Somehow, at the same time we all speculate about a future where robots will do our work for us---despite the fact that we've been actively resisting this outcome.\n\nWhether we realize it or not, we've all been indulging in superfluous job-creation; pushing markets towards higher employment not because production strictly requires it, but in order to have a socially acceptable *excuse* to distribute money.\n\nIt's only after our society deliberately decides to \\*stop\\* creating jobs and to pay out a UBI instead that we can discover how much leisure time is actually possible; how much prosperous unemployment is actually sustainable.\n\nCenturies-old popular debates about the possibility of robots or AI taking over jobs in the future are fundamentally missing the bigger picture: that in the present moment, right now, our monetary system is *not* designed to capitalize on technology and labor-efficiency developments. We're all stuck on a job-creating treadmill because we've yet to imagine a better way of distributing money.\n\nIf we want a future where the average person receives more despite working less, we don't need to be talking about robots or artificial intelligence: we need to be talking about money and UBI.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-07 14:45:12",
            "replies": []
        },
        {
            "author": "amandagulikson",
            "body": "Rewriting honestly: \"AI evidences crisis of capitalism\"",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-08 01:10:45",
            "replies": []
        },
        {
            "author": "ifthenNEXT",
            "body": "Wow, $4.8 trillion by 2033 is huge. The productivity boost sounds cool, but that 40% job impact is wild. Sucks that it might widen the gap and hit low-cost labor hardest. Any ideas on fixing that?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-08 15:02:37",
            "replies": []
        },
        {
            "author": "Loud_Fox9867",
            "body": "Haha made me think of this video I literally just watched\n\n[https://youtu.be/gJnQtgoTwbw](https://youtu.be/gJnQtgoTwbw)",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-09 17:56:21",
            "replies": []
        },
        {
            "author": "peternn2412",
            "body": "Well, AI *could* affect 40% of the jobs, but it *could* affect 5% or 95% as well ...  \nIt could widen the inequality between nations (why is this framed as something negative, aren't the most capable nations deserving to have an advantage) or it could narrow down the inequality ... between advanced nations.  \n  \nAI usually decreases the inequality between people - the less capable benefit way more,  the most capable are usually at a disadvantage because AI closes the capability gap.   \n  \nBut it's not like that about nations. The most primitive nations (e.g. Afghanistan, the 'Palestinians', assorted primitive tribes) don't benefit from humanity's advancements in the same way as everyone else.   \nBut that's ... what it is. We can't stop for 500 years and wait for them to catch up.",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-12 13:40:21",
            "replies": []
        },
        {
            "author": "the_millenial_falcon",
            "body": "Oh god we are all going to get Skynetted aren’t we?",
            "score": 1,
            "depth": 0,
            "timestamp": "2025-04-06 20:06:41",
            "replies": []
        },
        {
            "author": "Gari_305",
            "body": "From the article\n\nArtificial intelligence is projected to reach $4.8 trillion in market value by 2033, but the technology’s benefits remain highly concentrated, according to the U.N. Trade and Development agency.\n\nIn a [report](https://unctad.org/press-material/ais-48-trillion-future-un-trade-and-development-alerts-divides-urges-action) released on Thursday, UNCTAD said the AI market cap would roughly equate to the size of Germany’s economy, with the technology offering productivity gains and driving digital transformation. \n\nHowever, the agency also raised concerns about automation and job displacement, warning that AI could affect 40% of jobs worldwide. On top of that, AI is not inherently inclusive, meaning the economic gains from the tech remain “highly concentrated,” the report added. \n\n“The benefits of AI-driven automation often favour capital over labour, which could widen inequality and reduce the competitive advantage of low-cost labour in developing economies,” it said. ",
            "score": 0,
            "depth": 0,
            "timestamp": "2025-04-06 18:54:17",
            "replies": []
        },
        {
            "author": "Painty_The_Pirate",
            "body": "COMPUTER! MORE POWER!!!! INFINITE POWER!!!! 🤑🤑🤑🙈 😍 say high to the aliens for me <3",
            "score": -3,
            "depth": 0,
            "timestamp": "2025-04-06 19:43:56",
            "replies": []
        }
    ]
}